{
      "papers": [
            {
                  "layer": 0,
                  "paperId": "e8cfef98279aabd43f65d465b304345aec15d9bb",
                  "year": 2009,
                  "citationCount": 788,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 52,
                  "abstract": "We present a nested model for the visualization design and validation with four layers: characterize the task and data in the vocabulary of the problem domain, abstract into operations and data types, design visual encoding and interaction techniques, and create algorithms to execute techniques efficiently. The output from a level above is input to the level below, bringing attention to the design challenge that an upstream error inevitably cascades to all downstream levels. This model provides prescriptive guidance for determining appropriate evaluation approaches by identifying threats to validity unique to each level. We also provide three recommendations motivated by this model: authors should distinguish between these levels when claiming contributions at more than one of them, authors should explicitly state upstream assumptions at levels above the focus of a paper, and visualization venues should accept more papers on domain characterization.",
                  "journal": "none",
                  "title": "A Nested Model for Visualization Design and Validation",
                  "tldr": "A nested model for the visualization design and validation with four layers: characterize the task and data in the vocabulary of the problem domain, abstract into operations and data types, design visual encoding and interaction techniques, and create algorithms to execute techniques efficiently.",
                  "url": "https://www.semanticscholar.org/paper/e8cfef98279aabd43f65d465b304345aec15d9bb",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1732016",
                  "publicationDate": "2009-11-01"
            },
            {
                  "layer": 0,
                  "paperId": "48ac5c2bd0318b45621391f5a194b22030bb8989",
                  "year": 2012,
                  "citationCount": 669,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 93,
                  "abstract": "Design studies are an increasingly popular form of problem-driven visualization research, yet there is little guidance available about how to do them effectively. In this paper we reflect on our combined experience of conducting twenty-one design studies, as well as reading and reviewing many more, and on an extensive literature review of other field work methods and methodologies. Based on this foundation we provide definitions, propose a methodological framework, and provide practical guidance for conducting design studies. We define a design study as a project in which visualization researchers analyze a specific real-world problem faced by domain experts, design a visualization system that supports solving this problem, validate the design, and reflect about lessons learned in order to refine visualization design guidelines. We characterize two axes - a task clarity axis from fuzzy to crisp and an information location axis from the domain experts head to the computer - and use these axes to reason about design study contributions, their suitability, and uniqueness from other approaches. The proposed methodological framework consists of 9 stages: learn, winnow, cast, discover, design, implement, deploy, reflect, and write. For each stage we provide practical guidance and outline potential pitfalls. We also conducted an extensive literature survey of related methodological approaches that involve a significant amount of qualitative field work, and compare design study methodology to that of ethnography, grounded theory, and action research.",
                  "journal": "none",
                  "title": "Design Study Methodology: Reflections from the Trenches and the Stacks",
                  "tldr": "This paper reflects on the combined experience of conducting twenty-one design studies, conducts an extensive literature survey of related methodological approaches that involve a significant amount of qualitative field work, and compares design study methodology to that of ethnography, grounded theory, and action research.",
                  "url": "https://www.semanticscholar.org/paper/48ac5c2bd0318b45621391f5a194b22030bb8989",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_3020591_145976609_1732016",
                  "publicationDate": "2012-12-01"
            },
            {
                  "layer": 0,
                  "paperId": "c0147b41048540b8cb461da8216cbc565dca050e",
                  "year": 2000,
                  "citationCount": 503,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 13,
                  "abstract": "An extension to the treemap method for the visualization of hierarchical information, such as directory structures and organization structures, is presented. The standard treemap method often gives thin, elongated rectangles. As a result, rectangles are difficult to compare and to select. A new method is presented to generate lay-outs in which the rectangles approximate squares. To strenghten the visualization of the structure, shaded frames are used around groups of related nodes.",
                  "journal": "none",
                  "title": "Squarified Treemaps",
                  "tldr": "An extension to the treemap method for the visualization of hierarchical information, such as directory structures and organization structures, is presented and a new method is presented to generate lay-outs in which the rectangles approximate squares.",
                  "url": "https://www.semanticscholar.org/paper/c0147b41048540b8cb461da8216cbc565dca050e",
                  "venue": "VisSym",
                  "authors": "_2294916_2207836_143693813"
            },
            {
                  "layer": 0,
                  "paperId": "eee930533b539d872d7777aa6e7fa767b1fa6822",
                  "year": 2011,
                  "citationCount": 512,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 212,
                  "abstract": "The analysis of large graphs plays a prominent role in various fields of research and is relevant in many important application areas. Effective visual analysis of graphs requires appropriate visual presentations in combination with respective user interaction facilities and algorithmic graph analysis methods. How to design appropriate graph analysis systems depends on many factors, including the type of graph describing the data, the analytical task at hand and the applicability of graph analysis methods. The most recent surveys of graph visualization and navigation techniques cover techniques that had been introduced until 2000 or concentrate only on graph layouts published until 2002. Recently, new techniques have been developed covering a broader range of graph types, such as timevarying graphs. Also, in accordance with ever growing amounts of graphstructured data becoming available, the inclusion of algorithmic graph analysis and interaction techniques becomes increasingly important. In this StateoftheArt Report, we survey available techniques for the visual analysis of large graphs. Our review first considers graph visualization techniques according to the type of graphs supported. The visualization techniques form the basis for the presentation of interaction approaches suitable for visual graph exploration. As an important component of visual graph analysis, we discuss various graph algorithmic aspects useful for the different stages of the visual graph analysis process. We also present main open research challenges in this field.",
                  "journal": "none",
                  "title": "Visual Analysis of Large Graphs: StateoftheArt and Future Research Challenges",
                  "tldr": "This StateoftheArt Report surveys available techniques for the visual analysis of large graphs and discusses various graph algorithmic aspects useful for the different stages of the visual graph analysis process.",
                  "url": "https://www.semanticscholar.org/paper/eee930533b539d872d7777aa6e7fa767b1fa6822",
                  "venue": "Computer graphics forum (Print)",
                  "authors": "_2277743_145307900_1706471_1682620_143693813_144381703_1734569",
                  "publicationDate": "2011-04-21"
            },
            {
                  "layer": 0,
                  "paperId": "bc8852922f39403066381819b3bb401fd2c8e3c9",
                  "year": 2009,
                  "citationCount": 597,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 25,
                  "abstract": "Graphs depicted as nodelink diagrams are widely used to show relationships between entities. However, nodelink diagrams comprised of a large number of nodes and edges often suffer from visual clutter. The use of edge bundling remedies this and reveals highlevel edge patterns. Previous methods require the graph to contain a hierarchy for this, or they construct a control mesh to guide the edge bundling process, which often results in bundles that show considerable variation in curvature along the overall bundle direction. We present a new edge bundling method that uses a selforganizing approach to bundling in which edges are modeled as flexible springs that can attract each other. In contrast to previous methods, no hierarchy is used and no control mesh. The resulting bundled graphs show significant clutter reduction and clearly visible highlevel edge patterns. Curvature variation is furthermore minimized, resulting in smooth bundles that are easy to follow. Finally, we present a rendering technique that can be used to emphasize the bundling.",
                  "journal": "none",
                  "title": "ForceDirected Edge Bundling for Graph Visualization",
                  "tldr": "This work presents a new edge bundling method that uses a selforganizing approach to bundling in which edges are modeled as flexible springs that can attract each other, in contrast to previous methods, which require the graph to contain a hierarchy for this.",
                  "url": "https://www.semanticscholar.org/paper/bc8852922f39403066381819b3bb401fd2c8e3c9",
                  "venue": "Computer graphics forum (Print)",
                  "authors": "_34943770_143693813",
                  "publicationDate": "2009-06-01"
            },
            {
                  "layer": 1,
                  "paperId": "c5000b0d1f5a675cc086fbb52f8d4e7539d9771c",
                  "year": 2009,
                  "citationCount": 49,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 23,
                  "journal": "none",
                  "title": "What Does the User Want to See? What do the Data Want to Be?",
                  "tldr": "It is argued that designing information visualization techniques often requires more than designing for user requirements, and that focusing on the data, new insight is gained into the requirements of the user, and vice versa, resulting in more effective visualization techniques.",
                  "url": "https://www.semanticscholar.org/paper/c5000b0d1f5a675cc086fbb52f8d4e7539d9771c",
                  "venue": "Information Visualization",
                  "authors": "_30845108_143693813",
                  "publicationDate": "2009-06-01"
            },
            {
                  "layer": 1,
                  "paperId": "097ab740c8c6e3482bf39255e192894d12147f68",
                  "year": 2009,
                  "citationCount": 314,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 33,
                  "abstract": "We investigate techniques for visualizing time series data and evaluate their effect in value comparison tasks. We compare line charts with horizon graphs - a space-efficient time series visualization technique - across a range of chart sizes, measuring the speed and accuracy of subjects estimates of value differences between charts. We identify transition points at which reducing the chart height results in significantly differing drops in estimation accuracy across the compared chart types, and we find optimal positions in the speed-accuracy tradeoff curve at which viewers performed quickly without attendant drops in accuracy. Based on these results, we propose approaches for increasing data density that optimize graphical perception.",
                  "journal": "none",
                  "title": "Sizing the horizon: the effects of chart size and layering on the graphical perception of time series visualizations",
                  "tldr": "This work identifies transition points at which reducing the chart height results in significantly differing drops in estimation accuracy across the compared chart types, and finds optimal positions in the speed-accuracy tradeoff curve.",
                  "url": "https://www.semanticscholar.org/paper/097ab740c8c6e3482bf39255e192894d12147f68",
                  "venue": "International Conference on Human Factors in Computing Systems",
                  "authors": "_1803140_34981458_1820412",
                  "publicationDate": "2009-04-04"
            },
            {
                  "layer": 1,
                  "paperId": "592a2e669ad7e5d6ccb8096f767cba624e00d189",
                  "year": 2008,
                  "citationCount": 141,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 75,
                  "abstract": "Interaction cost is an important but poorly understood factor in visualization design. We propose a framework of interaction costs inspired by Normanpsilas Seven Stages of Action to facilitate study. From 484 papers, we collected 61 interaction-related usability problems reported in 32 user studies and placed them into our framework of seven costs: (1) Decision costs to form goals; (2) system-power costs to form system operations; (3) Multiple input mode costs to form physical sequences; (4) Physical-motion costs to execute sequences; (5) Visual-cluttering costs to perceive state; (6) View-change costs to interpret perception; (7) State-change costs to evaluate interpretation. We also suggested ways to narrow the gulfs of execution (2-4) and evaluation (5-7) based on collected reports. Our framework suggests a need to consider decision costs (1) as the gulf of goal formation.",
                  "journal": "none",
                  "title": "A Framework of Interaction Costs in Information Visualization",
                  "tldr": "A framework of interaction costs inspired by Normanpsilas Seven Stages of Action is proposed to facilitate study of interaction-related usability problems and suggests a need to consider decision costs as the gulf of goal formation.",
                  "url": "https://www.semanticscholar.org/paper/592a2e669ad7e5d6ccb8096f767cba624e00d189",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_8358143",
                  "publicationDate": "2008-11-01"
            },
            {
                  "layer": 1,
                  "paperId": "a715231247119678019f5f07cc47c8949c1a553f",
                  "year": 2008,
                  "citationCount": 110,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 65,
                  "abstract": "Systems biologists use interaction graphs to model the behavior of biological systems at the molecular level. In an iterative process, such biologists observe the reactions of living cells under various experimental conditions, view the results in the context of the interaction graph, and then propose changes to the graph model. These graphs serve as a form of dynamic knowledge representation of the biological system being studied and evolve as new insight is gained from the experimental data. While numerous graph layout and drawing packages are available, these tools did not fully meet the needs of our immunologist collaborators. In this paper, we describe the data information display needs of these immunologists and translate them into design decisions. These decisions led us to create Cerebral, a system that uses a biologically guided graph layout and incorporates experimental data directly into the graph display. Small multiple views of different experimental conditions and a data-driven parallel coordinates view enable correlations between experimental conditions to be analyzed at the same time that the data is viewed in the graph context. This combination of coordinated views allows the biologist to view the data from many different perspectives simultaneously. To illustrate the typical analysis tasks performed, we analyze two datasets using Cerebral. Based on feedback from our collaborators we conclude that Cerebral is a valuable tool for analyzing experimental data in the context of an interaction graph model.",
                  "journal": "none",
                  "title": "Cerebral: Visualizing Multiple Experimental Conditions on a Graph with Biological Context",
                  "tldr": "Cerebral, a system that uses a biologically guided graph layout and incorporates experimental data directly into the graph display and is concluded that Cerebral is a valuable tool for analyzing experimental data in the context of an interaction graph model.",
                  "url": "https://www.semanticscholar.org/paper/a715231247119678019f5f07cc47c8949c1a553f",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_40553755_1732016_2512488_144183077",
                  "publicationDate": "2008-11-01"
            },
            {
                  "layer": 1,
                  "paperId": "7a5f745b8f162fa5a2a25acafc4845b65d3f6410",
                  "year": 2008,
                  "citationCount": 375,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 18,
                  "abstract": "Animation has been used to show trends in multi-dimensional data. This technique has recently gained new prominence for presentations, most notably with Gapminder Trendalyzer. In Trendalyzer, animation together with interesting data and an engaging presenter helps the audience understand the results of an analysis of the data. It is less clear whether trend animation is effective for analysis. This paper proposes two alternative trend visualizations that use static depictions of trends: one which shows traces of all trends overlaid simultaneously in one display and a second that uses a small multiples display to show the trend traces side-by-side. The paper evaluates the three visualizations for both analysis and presentation. Results indicate that trend animation can be challenging to use even for presentations; while it is the fastest technique for presentation and participants find it enjoyable and exciting, it does lead to many participant errors. Animation is the least effective form for analysis; both static depictions of trends are significantly faster than animation, and the small multiples display is more accurate.",
                  "journal": "none",
                  "title": "Effectiveness of Animation in Trend Visualization",
                  "tldr": "This paper proposes two alternative trend visualizations that use static depictions of trends: one which shows traces of all trends overlaid simultaneously in one display and a second that uses a small multiples display to show the trend traces side-by-side.",
                  "url": "https://www.semanticscholar.org/paper/7a5f745b8f162fa5a2a25acafc4845b65d3f6410",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1699184_37409035_2243968_49132427_1691661",
                  "publicationDate": "2008-11-01"
            },
            {
                  "layer": 1,
                  "paperId": "c8810ca10bd3b2c42c257e44f969055b2357f500",
                  "year": 2008,
                  "citationCount": 60,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 84,
                  "journal": "none",
                  "title": "Physical and Digital Artifact-Mediated Coordination in Building Design",
                  "tldr": "An ethnographic field study examining how a building design team used representational artifacts to coordinate the design of building systems, structure, and architecture found that gesturing, navigation, annotation, and viewing were the four primary interactions meeting participants had with design artifacts.",
                  "url": "https://www.semanticscholar.org/paper/c8810ca10bd3b2c42c257e44f969055b2357f500",
                  "venue": "Computer Supported Cooperative Work (CSCW)",
                  "authors": "_2441204_1401400455_1797134_3133198",
                  "publicationDate": "2008-08-01"
            },
            {
                  "layer": 1,
                  "paperId": "30623788b80db1f702d11a97c0e9993ca0a6e7f9",
                  "year": 2008,
                  "citationCount": 151,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 20,
                  "abstract": "To design information visualization tools for collaborative use, we need to understand how teams engage with visualizations during their information analysis process. We report on an exploratory study of individuals, pairs, and triples engaged in information analysis tasks using paper-based visualizations. From our study results, we derive a framework that captures the analysis activities of co-located teams and individuals. Comparing this framework with existing models of the information analysis process suggests that information visualization tools may benefit from providing a flexible temporal flow of analysis actions.",
                  "journal": "none",
                  "title": "An exploratory study of visual information analysis",
                  "tldr": "An exploratory study of individuals, pairs, and triples engaged in information analysis tasks using paper-based visualizations derives a framework that captures the analysis activities of co-located teams and individuals.",
                  "url": "https://www.semanticscholar.org/paper/30623788b80db1f702d11a97c0e9993ca0a6e7f9",
                  "venue": "International Conference on Human Factors in Computing Systems",
                  "authors": "_1767660_2080173208_144189259",
                  "publicationDate": "2008-04-06"
            },
            {
                  "layer": 1,
                  "paperId": "fa0987d1f32bfb88703d01d0b2f1613e27d76e47",
                  "year": 2008,
                  "citationCount": 206,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 27,
                  "abstract": "We present LiveRAC, a visualization system that supports the analysis of large collections of system management time-series data consisting of hundreds of parameters across thousands of network devices. LiveRAC provides high information density using a reorderable matrix of charts, with semantic zooming adapting each charts visual representation to the available space. LiveRAC allows side-by-side visual comparison of arbitrary groupings of devices and parameters at multiple levels of detail. A staged design and development process culminated in the deployment of LiveRAC in a production environment. We conducted an informal longitudinal evaluation of LiveRAC to better understand which proposed visualization techniques were most useful in the target environment.",
                  "journal": "none",
                  "title": "LiveRAC: interactive visual exploration of system management time-series data",
                  "tldr": "This work presents LiveRAC, a visualization system that supports the analysis of large collections of system management time-series data consisting of hundreds of parameters across thousands of network devices, and conducts an informal longitudinal evaluation of the system to better understand which proposed visualization techniques were most useful in the target environment.",
                  "url": "https://www.semanticscholar.org/paper/fa0987d1f32bfb88703d01d0b2f1613e27d76e47",
                  "venue": "International Conference on Human Factors in Computing Systems",
                  "authors": "_21665459_1732016_2621476_2885843",
                  "publicationDate": "2008-04-06"
            },
            {
                  "layer": 1,
                  "paperId": "80c1561ea178251dcab1cb7fbc8820870fd19a88",
                  "year": 2008,
                  "citationCount": 44,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 23,
                  "abstract": "We conducted an ethnographic field study examining the ways in which building design teams used visual representations of data to coordinate their work. Here we describe our experience with this field study approach, including both quantitative and qualitative analysis of field study data. Conducting a field study enabled us to effectively examine real work practice of a diverse team of experts, which would have been nearly impossible in a laboratory study. We also found that structured qualitative analysis methods provided deeper insight into our results than our initial quantitative approach. Our experience suggests that field studies and qualitative analysis could have substantial benefit in visualization and could nicely complement existing quantitative laboratory studies.",
                  "journal": "none",
                  "title": "Qualitative analysis of visualization: a building design field study",
                  "tldr": "An ethnographic field study examining the ways in which building design teams used visual representations of data to coordinate their work found that structured qualitative analysis methods provided deeper insight into the results than the initial quantitative approach.",
                  "url": "https://www.semanticscholar.org/paper/80c1561ea178251dcab1cb7fbc8820870fd19a88",
                  "venue": "Workshop on Beyond Time and Errors: Novel Evaluation Methods for Visualization",
                  "authors": "_2441204_1401400455",
                  "publicationDate": "2008-04-05"
            },
            {
                  "layer": 1,
                  "paperId": "a2b7ffc3d8325eb81d005331d95521594d91cce7",
                  "year": 2008,
                  "citationCount": 18,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 41,
                  "abstract": "Information Visualization (InfoVis) is at least in part defined by a process that occurs within the subjective internal experience of the users of visualization tools. Hence, users interaction with these tools is seen as an experience. Relying on standard quantitative usability measures evaluates the interface. Yet, there is more to users interaction with InfoVis tools than merely the interface. Qualitative methods targets users subjective experiences. In this paper we demonstrate the potential benefits of qualitative methods, more specifically Grounded Theory, for generating a theoretical understanding of users InfoVis experiences through discussing the results of a qualitative study we conducted. The study was conducted in order to evaluate a visualization of the academic literature domain, which we have designed and built using a user-centered design approach. The study resulted in us identifying categories that are essential to the InfoVis experience. This paper argues that these categories can be used as a foundation for building an InfoVis theory of interaction.",
                  "journal": "none",
                  "title": "Internalization, qualitative methods, and evaluation",
                  "tldr": "The potential benefits of qualitative methods, more specifically Grounded Theory, for generating a theoretical understanding of users InfoVis experiences are demonstrated through discussing the results of a qualitative study conducted.",
                  "url": "https://www.semanticscholar.org/paper/a2b7ffc3d8325eb81d005331d95521594d91cce7",
                  "venue": "Workshop on Beyond Time and Errors: Novel Evaluation Methods for Visualization",
                  "authors": "_2503097_3002046_145753642_67184210",
                  "publicationDate": "2008-04-05"
            },
            {
                  "layer": 1,
                  "paperId": "5418c3d0175cca0a65d3be53ca8274234853eeab",
                  "year": 2008,
                  "citationCount": 123,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 34,
                  "abstract": "We introduce grounded evaluation as a process that attempts to ensure that the evaluation of an information visualization tool is situated within the context of its intended use. We discuss the process and scope of grounded evaluation in general, and then describe how qualitative inquiry may be a beneficial approach as part of this process. We advocate for increased attention to the field of qualitative inquiry early in the information visualization development life cycle, as it tries to achieve a richer understanding by using a more holistic approach considering the interplay between factors that influence visualizations, their development, and their use. We present three case studies in which we successfully used observational techniques to inform our understanding of the visual analytics process in groups, medical diagnostic reasoning, and visualization use among computational linguists.",
                  "journal": "none",
                  "title": "Grounded evaluation of information visualizations",
                  "tldr": "Ground evaluation is introduced as a process that attempts to ensure that the evaluation of an information visualization tool is situated within the context of its intended use, and how qualitative inquiry may be a beneficial approach as part of this process is described.",
                  "url": "https://www.semanticscholar.org/paper/5418c3d0175cca0a65d3be53ca8274234853eeab",
                  "venue": "Workshop on Beyond Time and Errors: Novel Evaluation Methods for Visualization",
                  "authors": "_1767660_144916073_144406618_144189259",
                  "publicationDate": "2008-04-05"
            },
            {
                  "layer": 1,
                  "paperId": "e2add84ee57a3252ced5f4aefae34b76a7c93304",
                  "year": 2008,
                  "citationCount": 111,
                  "referenceCount": 49,
                  "journal": "none",
                  "title": "Theoretical Foundations of Information Visualization",
                  "tldr": "Drawing on theories within associated disciplines, three different approaches to theoretical foundations of Information Visualization are presented: data-centric predictive theory, information theory, and scientific modeling.",
                  "url": "https://www.semanticscholar.org/paper/e2add84ee57a3252ced5f4aefae34b76a7c93304",
                  "venue": "Information Visualization",
                  "authors": "_32489306_1780833_1399266866_1685227",
                  "publicationDate": "2008-03-01"
            },
            {
                  "layer": 1,
                  "paperId": "28d63b0a44ad4fa462795137c67175decd9bf160",
                  "year": 2008,
                  "citationCount": 361,
                  "referenceCount": 99,
                  "journal": "none",
                  "title": "Evaluating Information Visualizations",
                  "tldr": "The purpose of this chapter is to increase awareness of empirical research in general, of its relationship to information visualization in particular, and to emphasize its importance to encourage thoughtful application of a greater variety of evaluative research methodologies in information visualization.",
                  "url": "https://www.semanticscholar.org/paper/28d63b0a44ad4fa462795137c67175decd9bf160",
                  "venue": "Information Visualization",
                  "authors": "_144189259",
                  "publicationDate": "2008-03-01"
            },
            {
                  "layer": 1,
                  "paperId": "bb3295f52855f35a1cc6a029c8a999ea8743dd6e",
                  "year": 2008,
                  "citationCount": 40,
                  "referenceCount": 5,
                  "abstract": "As the information visualisation (infovis) community matures, the evaluation of information visualisation techniques is becoming more of a requirement and less of an optional extra. Unfortunately, the term evaluation means dierent things to dierent people. Simply encouraging evaluation is too general and imprecise. There is a need for clarication as to what kind of evaluation is expected at what stage. When reporting their work, authors should clearly distinguish between exploratory, predictive, formative, and summative evaluation.",
                  "journal": "none",
                  "title": "Evaluation Comes in Many Guises",
                  "url": "https://www.semanticscholar.org/paper/bb3295f52855f35a1cc6a029c8a999ea8743dd6e",
                  "authors": "_144877610"
            },
            {
                  "layer": 1,
                  "paperId": "e30ecedc7f5fa639915e95f153d9561a3da0962f",
                  "year": 2007,
                  "citationCount": 1048,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 66,
                  "abstract": "Even though interaction is an important part of information visualization (Infovis), it has garnered a relatively low level of attention from the Infovis community. A few frameworks and taxonomies of Infovis interaction techniques exist, but they typically focus on low-level operations and do not address the variety of benefits interaction provides. After conducting an extensive review of Infovis systems and their interactive capabilities, we propose seven general categories of interaction techniques widely used in Infovis: 1) Select, 2) Explore, 3) Reconfigure, 4) Encode, 5) Abstract/Elaborate, 6) Filter, and 7) Connect. These categories are organized around a users intent while interacting with a system rather than the low-level interaction techniques provided by a system. The categories can act as a framework to help discuss and evaluate interaction techniques and hopefully lay an initial foundation toward a deeper understanding and a science of interaction.",
                  "journal": "none",
                  "title": "Toward a Deeper Understanding of the Role of Interaction in Information Visualization",
                  "tldr": "Seven general categories of interaction techniques widely used in Infovis are proposed, organized around a users intent while interacting with a system rather than the low-level interaction techniques provided by a system.",
                  "url": "https://www.semanticscholar.org/paper/e30ecedc7f5fa639915e95f153d9561a3da0962f",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1681808_145015438_1691661_2184437",
                  "publicationDate": "2007-11-01"
            },
            {
                  "layer": 1,
                  "paperId": "f9e65a13a71bdb7e2afcf32dcd32ba4bdce7ebba",
                  "year": 2007,
                  "citationCount": 68,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 35,
                  "abstract": "Large-scale session log analysis typically includes statistical methods and detailed log examinations. While both methods have merits, statistical methods can miss previously unknown sub- populations in the data and detailed analyses may have selection biases. We therefore built Session Viewer, a visualization tool to facilitate and bridge between statistical and detailed analyses. Taking a multiple-coordinated view approach, Session Viewer shows multiple session populations at the Aggregate, Multiple, and Detail data levels to support different analysis styles. To bridge between the statistical and the detailed analysis levels, Session Viewer provides fluid traversal between data levels and side-by-side comparison at all data levels. We describe an analysis of a large-scale web usage study to demonstrate the use of Session Viewer, where we quantified the importance of grouping sessions based on task type.",
                  "journal": "none",
                  "title": "Session Viewer: Visual Exploratory Analysis of Web Session Logs",
                  "tldr": "This work describes an analysis of a large-scale web usage study to demonstrate the use of Session Viewer, where the importance of grouping sessions based on task type was quantified.",
                  "url": "https://www.semanticscholar.org/paper/f9e65a13a71bdb7e2afcf32dcd32ba4bdce7ebba",
                  "venue": "2007 IEEE Symposium on Visual Analytics Science and Technology",
                  "authors": "_8358143_32598306_144575353_1732016",
                  "publicationDate": "2007-10-30"
            },
            {
                  "layer": 1,
                  "paperId": "53877e5e12fd219ab406d98fc32eca838efdef19",
                  "year": 2007,
                  "citationCount": 175,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 31,
                  "abstract": "We describe TopoLayout, a feature-based, multilevel algorithm that draws undirected graphs based on the topological features they contain. Topological features are detected recursively inside the graph, and their subgraphs are collapsed into single nodes, forming a graph hierarchy. Each feature is drawn with an algorithm tuned for its topology. As would be expected from a feature-based approach, the runtime and visual quality of TopoLayout depends on the number and types of topological features present in the graph. We show experimental results comparing speed and visual quality for TopoLayout against four other multilevel algorithms on a variety of data sets with a range of connectivities and sizes. TopoLayout frequently improves the results in terms of speed and visual quality on these data sets",
                  "journal": "none",
                  "title": "TopoLayout: Multilevel Graph Layout by Topological Features",
                  "tldr": "A feature-based, multilevel algorithm that draws undirected graphs based on the topological features they contain, which frequently improves the results in terms of speed and visual quality on these data sets with a range of connectivities and sizes.",
                  "url": "https://www.semanticscholar.org/paper/53877e5e12fd219ab406d98fc32eca838efdef19",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_2503181_1732016_2460043",
                  "publicationDate": "2007-03-01"
            },
            {
                  "layer": 1,
                  "paperId": "ac765d12e845aa9ab728f5ad84c254372e12584c",
                  "year": 2006,
                  "citationCount": 316,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 36,
                  "abstract": "MatrixExplorer is a network visualization system that uses two representations: node-link diagrams and matrices. Its design comes from a list of requirements formalized after several interviews and a participatory design session conducted with social science researchers. Although matrices are commonly used in social networks analysis, very few systems support the matrix-based representations to visualize and analyze networks. MatrixExplorer provides several novel features to support the exploration of social networks with a matrix-based representation, in addition to the standard interactive filtering and clustering functions. It provides tools to reorder (layout) matrices, to annotate and compare findings across different layouts and find consensus among several clusterings. MatrixExplorer also supports node-link diagram views which are familiar to most users and remain a convenient way to publish or communicate exploration results. Matrix and node-link representations are kept synchronized at all stages of the exploration process",
                  "journal": "none",
                  "title": "MatrixExplorer: a Dual-Representation System to Explore Social Networks",
                  "tldr": "Network visualization system that uses two representations: node-link diagrams and matrices that provides tools to reorder (layout) matrices, to annotate and compare findings across different layouts and find consensus among several clusterings.",
                  "url": "https://www.semanticscholar.org/paper/ac765d12e845aa9ab728f5ad84c254372e12584c",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1692395_144381703",
                  "publicationDate": "2006-09-01"
            },
            {
                  "layer": 1,
                  "paperId": "81339b4ef6f980a565e0991420061b44be0e8e21",
                  "year": 2006,
                  "citationCount": 128,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 38,
                  "abstract": "The field of visualization is maturing. Many problems have been solved and new directions are sought. In order to make good choices, an understanding of the purpose and meaning of visualization is needed. In this paper, visualization is considered from multiple points of view. First, a technological viewpoint is adopted, where the value of visualization is measured based on effectiveness and efficiency. An economic model of visualization is presented and benefits and costs are established. Next, consequences and limitations of visualization are discussed (including the use of alternative methods, high initial costs, subjectiveness, and the role of interaction). Example uses of the model for the judgment of existing classes of methods are given to understand why they are or are not used in practice. However, such an economic view is too restrictive. Alternative views on visualization are presented and discussed: visualization as an art, visualization as design and, finally, visualization as a scientific discipline.",
                  "journal": "none",
                  "title": "Views on Visualization",
                  "tldr": "This paper considers visualization from multiple points of view: a technological viewpoint is adopted, where the value of visualization is measured based on effectiveness and efficiency, and an economic model of visualize is presented and benefits and costs are established.",
                  "url": "https://www.semanticscholar.org/paper/81339b4ef6f980a565e0991420061b44be0e8e21",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_143693813",
                  "publicationDate": "2006-07-01"
            },
            {
                  "layer": 1,
                  "paperId": "4fdf98ca739598636fa9d65bed0fd6701d9fb7fe",
                  "year": 2006,
                  "citationCount": 87,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 27,
                  "abstract": "The design of multidimensional visualization techniques is based on the assumption that a graphical representation of a large dataset can give more insight to a user, by providing him/her a more intuitive support in the process of exploiting data. When developing a visualization technique, the analytic and exploratory tasks that a user might need or want to perform on the data should guide the choice of the visual and interaction metaphors implemented by the technique. Usability testing of visualization techniques also needs the definition of users tasks. The identification and understanding of the nature of the users tasks in the process of acquiring knowledge from visual representations of data is a recent branch in information visualization research. Some works have proposed taxonomies to organize tasks that a visualization technique should support. This paper proposes a taxonomy of visualization tasks, based on existing taxonomies as well as on the observation of users performing exploratory tasks in a multidimensional data set using two different visualization techniques, Parallel Coordinates and RadViz. Different scenarios involving low-level tasks were estimated for the completion of some high-level tasks, and they were compared to the scenarios observed during the users experiments.",
                  "journal": "none",
                  "title": "A taxonomy of tasks for guiding the evaluation of multidimensional visualizations",
                  "tldr": "A taxonomy of visualization tasks is proposed, based on existing taxonomies as well as on the observation of users performing exploratory tasks in a multidimensional data set using two different visualization techniques, Parallel Coordinates and RadViz.",
                  "url": "https://www.semanticscholar.org/paper/4fdf98ca739598636fa9d65bed0fd6701d9fb7fe",
                  "venue": "Workshop on Beyond Time and Errors: Novel Evaluation Methods for Visualization",
                  "authors": "_2306577_48065095_1715529",
                  "publicationDate": "2006-05-23"
            },
            {
                  "layer": 1,
                  "paperId": "695317f69c53eb4a418667e75c9f8f43b89d7e61",
                  "year": 2006,
                  "citationCount": 413,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 11,
                  "abstract": "Our goal is to define a list of tasks for graph visualization that has enough detail and specificity to be useful to: 1) designers who want to improve their system and 2) to evaluators who want to compare graph visualization systems. In this paper, we suggest a list of tasks we believe are commonly encountered while analyzing graph data. We define graph specific objects and demonstrate how all complex tasks could be seen as a series of low-level tasks performed on those objects. We believe that our taxonomy, associated with benchmark datasets and specific tasks, would help evaluators generalize results collected through a series of controlled experiments.",
                  "journal": "none",
                  "title": "Task taxonomy for graph visualization",
                  "tldr": "A list of tasks commonly encountered while analyzing graph data is suggested and it is demonstrated how all complex tasks could be seen as a series of low-level tasks performed on those objects.",
                  "url": "https://www.semanticscholar.org/paper/695317f69c53eb4a418667e75c9f8f43b89d7e61",
                  "venue": "Workshop on Beyond Time and Errors: Novel Evaluation Methods for Visualization",
                  "authors": "_49132427_1764846_8594851_144381703_1692395",
                  "publicationDate": "2006-05-23"
            },
            {
                  "layer": 1,
                  "paperId": "1ea117cbc6ddd3b5c072e5c1b071b4d9ed1e9b70",
                  "year": 2006,
                  "citationCount": 156,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 19,
                  "abstract": "This paper presents an analysis of user studies from a review of papers describing new visualisation applications and uses these to highlight various issues related to the evaluation of visualisations. We first consider some of the reasons why the process of evaluating visualisations is so difficult. We then dissect the problem by discussing the importance of recognising the nature of experimental design, datasets and participants as well as the statistical analysis of results. We propose explorative evaluation as a method of discovering new things about visualisation techniques, which may give us a better understanding of the mechanisms of visualisations. Finally we give some practical guidance on how to do evaluation correctly.",
                  "journal": "none",
                  "title": "An explorative analysis of user evaluation studies in information visualisation",
                  "tldr": "An analysis of user studies from a review of papers describing new visualisation applications is presented and proposes explorative evaluation as a method of discovering new things about visualisation techniques, which may give a better understanding of the mechanisms of visualisations.",
                  "url": "https://www.semanticscholar.org/paper/1ea117cbc6ddd3b5c072e5c1b071b4d9ed1e9b70",
                  "venue": "Workshop on Beyond Time and Errors: Novel Evaluation Methods for Visualization",
                  "authors": "_36877668_144978737",
                  "publicationDate": "2006-05-23"
            },
            {
                  "layer": 1,
                  "paperId": "6584be2c6c09a4a44cdbbceb57792985c6bb359c",
                  "year": 2006,
                  "citationCount": 131,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 27,
                  "abstract": "Heuristic evaluation is a well known discount evaluation technique in human-computer interaction (HCI) but has not been utilized in information visualization (InfoVis) to the same extent. While several sets of heuristics have been used or proposed for InfoVis, it is not yet known what kind of heuristics are useful for finding general InfoVis problems. We performed a meta-analysis with the goal of exploring the issues of heuristic evaluation for InfoVis. This meta-analysis concentrates on issues pertaining to the selection and organization of heuristics, and the process itself. For this purpose, we used three sets of previously published heuristics to assess a visual decision support system that is used to examine simulation data. The meta-analysis shows that the evaluation process and results have a high dependency on the heuristics and the types of evaluators chosen. We describe issues related to interpretation, redundancy, and conflict in heuristics. We also provide a discussion of generalizability and categorization of these heuristics.",
                  "journal": "none",
                  "title": "Heuristics for information visualization evaluation",
                  "tldr": "A meta-analysis of the heuristics used to assess a visual decision support system that is used to examine simulation data shows that the evaluation process and results have a high dependency on theHeuristics and the types of evaluators chosen.",
                  "url": "https://www.semanticscholar.org/paper/6584be2c6c09a4a44cdbbceb57792985c6bb359c",
                  "venue": "Workshop on Beyond Time and Errors: Novel Evaluation Methods for Visualization",
                  "authors": "_144916073_2858016_143855725_1771907_144189259",
                  "publicationDate": "2006-05-23"
            },
            {
                  "layer": 1,
                  "paperId": "6e77a3fce66982106066636634549ea219450d78",
                  "year": 2006,
                  "citationCount": 484,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 36,
                  "abstract": "After an historical review of evaluation methods, we describe an emerging research method called Multi-dimensional In-depth Long-term Case studies (MILCs) which seems well adapted to study the creative activities that users of information visualization systems engage in. We propose that the efficacy of tools can be assessed by documenting 1) usage (observations, interviews, surveys, logging etc.) and 2) expert users success in achieving their professional goals. We summarize lessons from related ethnography methods used in HCI and provide guidelines for conducting MILCs for information visualization. We suggest ways to refine the methods for MILCs in modest sized projects and then envision ambitious projects with 3-10 researchers working over 1-3 years to understand individual and organizational use of information visualization by domain experts working at the frontiers of knowledge in their fields.",
                  "journal": "none",
                  "title": "Strategies for evaluating information visualization tools: multi-dimensional in-depth long-term case studies",
                  "tldr": "An emerging research method called Multi-dimensional In-depth Long-term Case studies (MILCs) which seems well adapted to study the creative activities that users of information visualization systems engage in is described.",
                  "url": "https://www.semanticscholar.org/paper/6e77a3fce66982106066636634549ea219450d78",
                  "venue": "Workshop on Beyond Time and Errors: Novel Evaluation Methods for Visualization",
                  "authors": "_1740403_1764846",
                  "publicationDate": "2006-05-23"
            },
            {
                  "layer": 1,
                  "paperId": "180e548520d2091beb8bb039473bd542e7de5aec",
                  "year": 2005,
                  "citationCount": 664,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 14,
                  "abstract": "Existing system level taxonomies of visualization tasks are geared more towards the design of particular representations than the facilitation of user analytic activity. We present a set of ten low level analysis tasks that largely capture peoples activities while employing information visualization tools for understanding data. To help develop these tasks, we collected nearly 200 sample questions from students about how they would analyze five particular data sets from different domains. The questions, while not being totally comprehensive, illustrated the sheer variety of analytic questions typically posed by users when employing information visualization systems. We hope that the presented set of tasks is useful for information visualization system designers as a kind of common substrate to discuss the relative analytic capabilities of the systems. Further, the tasks may provide a form of checklist for system designers.",
                  "journal": "none",
                  "title": "Low-level components of analytic activity in information visualization",
                  "tldr": "This work presents a set of ten low level analysis tasks that largely capture peoples activities while employing information visualization tools for understanding data, and hopes that the tasks may provide a form of checklist for system designers.",
                  "url": "https://www.semanticscholar.org/paper/180e548520d2091beb8bb039473bd542e7de5aec",
                  "venue": "IEEE Symposium on Information Visualization, 2005. INFOVIS 2005.",
                  "authors": "_1909986_2152856_1691661",
                  "publicationDate": "2005-10-23"
            },
            {
                  "layer": 1,
                  "paperId": "dc2ee6f90162ec35ef2b5ed876f0bb24137adcee",
                  "year": 2005,
                  "citationCount": 351,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 21,
                  "abstract": "Cartographers have long used flow maps to show the movement of objects from one location to another, such as the number of people in a migration, the amount of goods being traded, or the number of packets in a network. The advantage of flow maps is that they reduce visual clutter by merging edges. Most flow maps are drawn by hand and there are few computer algorithms available. We present a method for generating flow maps using hierarchical clustering given a set of nodes, positions, and flow data between the nodes. Our techniques are inspired by graph layout algorithms that minimize edge crossings and distort node positions while maintaining their relative position to one another. We demonstrate our technique by producing flow maps for network traffic, census data, and trade data.",
                  "journal": "none",
                  "title": "Flow map layout",
                  "tldr": "A method for generating flow maps using hierarchical clustering given a set of nodes, positions, and flow data between the nodes, inspired by graph layout algorithms that minimize edge crossings and distort node positions while maintaining their relative position to one another is presented.",
                  "url": "https://www.semanticscholar.org/paper/dc2ee6f90162ec35ef2b5ed876f0bb24137adcee",
                  "venue": "IEEE Symposium on Information Visualization, 2005. INFOVIS 2005.",
                  "authors": "_34138622_2149552742_2105696_144872229_1699245",
                  "publicationDate": "2005-10-23"
            },
            {
                  "layer": 1,
                  "paperId": "5aea8f3e229cbb9a8f1fd4746cec7a1c7e4fe4a9",
                  "year": 2005,
                  "citationCount": 58,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 23,
                  "abstract": "The general problem of visualizing family trees, or genealogical graphs, in 2D, is considered. A graph theoretic analysis is given, which identifies why genealogical graphs can be difficult to draw. This motivates some novel graphical representations, including one based on a dual tree, a subgraph formed by the union of two trees. Dual trees can be drawn in various styles, including an indented outline style, and allow users to browse general multitrees in addition to genealogical graphs, by transitioning between different dual tree views. A software prototype for such browsing is described, that supports smoothly animated transitions, automatic camera framing, rotation of subtrees, and a novel interaction technique for expanding or collapsing subtrees to any depth with a single mouse drag",
                  "journal": "none",
                  "title": "Interactive visualization of genealogical graphs",
                  "tldr": "A graph theoretic analysis is given, which identifies why genealogical graphs can be difficult to draw, and motivates some novel graphical representations, including one based on a dual tree, a subgraph formed by the union of two trees.",
                  "url": "https://www.semanticscholar.org/paper/5aea8f3e229cbb9a8f1fd4746cec7a1c7e4fe4a9",
                  "venue": "IEEE Symposium on Information Visualization, 2005. INFOVIS 2005.",
                  "authors": "_3197167_1748870",
                  "publicationDate": "2005-10-23"
            },
            {
                  "layer": 1,
                  "paperId": "8ff4ff5af717049373cd9aa3f5a8b0ff95c7bc57",
                  "year": 2005,
                  "citationCount": 167,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 18,
                  "abstract": "The Wizard of Oz prototyping approach, widely used in human-computer interaction research, is particularly useful in exploring user interfaces for pervasive, ubiquitous, or mixed-reality systems that combine complex sensing and intelligent control logic. The vast design space for such nontraditional interfaces provides many possibilities for user interaction through one or more modalities and often requires challenging hardware and software implementations. The WOz method helps designers avoid getting locked into a particular design or working under an incorrect set of assumptions about user preferences, because it lets them explore and evaluate designs before investing the considerable development time needed to build a complete prototype.",
                  "journal": "none",
                  "title": "Wizard of Oz support throughout an iterative design process",
                  "tldr": "The WOz method helps designers avoid getting locked into a particular design or working under an incorrect set of assumptions about user preferences, because it lets them explore and evaluate designs before investing the considerable development time needed to build a complete prototype.",
                  "url": "https://www.semanticscholar.org/paper/8ff4ff5af717049373cd9aa3f5a8b0ff95c7bc57",
                  "venue": "IEEE pervasive computing",
                  "authors": "_48256159_145931052_2108479642_1752011_2393402_1874459",
                  "publicationDate": "2005-10-01"
            },
            {
                  "layer": 1,
                  "paperId": "21dcf2a158b05f24b48a3624fee46e8cea6d53c6",
                  "year": 2005,
                  "citationCount": 217,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 15,
                  "abstract": "Visualization research generates beautiful images and impressive interactive systems. Emphasis on evaluating visualizations is growing. Researchers have successfully used alternative evaluation techniques in human-computer interaction (HCI), including focus groups, field studies, and expert reviews. These methods tend to produce qualitative results and require fewer participants than controlled experiments. In this article, we focus on expert reviews that we used for the applications. We commonly use expert reviews to assess interface usability. Expert reviews can generate valuable feedback on visualization tools. We recommend i) including experts with experience in data display as well as usability, and ii) developing heuristics based on visualization guidelines as well as usability guidelines. Expert reviews should not be used exclusively, since experts might not hilly predict end-user actions. Furthermore, we encourage more experimentation with this technique, particularly to develop a good set of visualization heuristics and to compare it with other methods.",
                  "journal": "none",
                  "title": "Evaluating Visualizations: Do Expert Reviews Work?",
                  "tldr": "This article focuses on expert reviews that were used for the applications and encourages more experimentation with this technique, particularly to develop a good set of visualization heuristics and to compare it with other methods.",
                  "url": "https://www.semanticscholar.org/paper/21dcf2a158b05f24b48a3624fee46e8cea6d53c6",
                  "venue": "IEEE Computer Graphics and Applications",
                  "authors": "_2441204_143670380",
                  "publicationDate": "2005-09-01"
            },
            {
                  "layer": 1,
                  "paperId": "b450dedf0079b80c490e57fd9a20464351e5cbf3",
                  "year": 2005,
                  "citationCount": 380,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 43,
                  "abstract": "High-throughput experiments, such as gene expression microarrays in the life sciences, result in very large data sets. In response, a wide variety of visualization tools have been created to facilitate data analysis. A primary purpose of these tools is to provide biologically relevant insight into the data. Typically, visualizations are evaluated in controlled studies that measure user performance on predetermined tasks or using heuristics and expert reviews. To evaluate and rank bioinformatics visualizations based on real-world data analysis scenarios, we developed a more relevant evaluation method that focuses on data insight. This paper presents several characteristics of insight that enabled us to recognize and quantify it in open-ended user tests. Using these characteristics, we evaluated five microarray visualization tools on the amount and types of insight they provide and the time it takes to acquire it. The results of the study guide biologists in selecting a visualization tool based on the type of their microarray data, visualization designers on the key role of user interaction techniques, and evaluators on a new approach for evaluating the effectiveness of visualizations for providing insight. Though we used the method to analyze bioinformatics visualizations, it can be applied to other domains.",
                  "journal": "none",
                  "title": "An insight-based methodology for evaluating bioinformatics visualizations",
                  "tldr": "This paper presents several characteristics of insight that enabled us to recognize and quantify it in open-ended user tests and evaluated five microarray visualization tools on the amount and types of insight they provide and the time it takes to acquire it.",
                  "url": "https://www.semanticscholar.org/paper/b450dedf0079b80c490e57fd9a20464351e5cbf3",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1804600_144305975_1792197",
                  "publicationDate": "2005-07-01"
            },
            {
                  "layer": 1,
                  "paperId": "23a317ae53e70094e849f836f9ec21e025903073",
                  "year": 2004,
                  "citationCount": 273,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 22,
                  "abstract": "We present the novel high-level visualization taxonomy. Our taxonomy classifies visualization algorithms rather than data. Algorithms are categorized based on the assumptions they make about the data being visualized; we call this set of assumptions the design model. Because our taxonomy is based on design models, it is more flexible than existing taxonomies and considers the users conceptual model, emphasizing the human aspect of visualization. Design models are classified according to whether they are discrete or continuous and by how much the algorithm designer chooses display attributes such as spatialization, timing, colour, and transparency. This novel approach provides an alternative view of the visualization field that helps explain how traditional divisions (e.g., information and scientific visualization) relates and overlap, and that may inspire research ideas in hybrid visualization areas",
                  "journal": "none",
                  "title": "Rethinking Visualization: A High-Level Taxonomy",
                  "tldr": "This novel approach provides an alternative view of the visualization field that helps explain how traditional divisions relates and overlap, and that may inspire research ideas in hybrid visualization areas.",
                  "url": "https://www.semanticscholar.org/paper/23a317ae53e70094e849f836f9ec21e025903073",
                  "venue": "IEEE Information Visualization Conference",
                  "authors": "_2441204_143670380",
                  "publicationDate": "2004-10-10"
            },
            {
                  "layer": 1,
                  "paperId": "63938bfa8147f17265ec20073bc07f9eee371d5a",
                  "year": 2004,
                  "citationCount": 711,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 35,
                  "abstract": "As the field of information visualization matures, the tools and ideas described in our research publications are reaching users. The reports of usability studies and controlled experiments are helpful to understand the potential and limitations of our tools, but we need to consider other evaluation approaches that take into account the long exploratory nature of users tasks, the value of potential discoveries or the benefits of overall awareness. We need better metrics and benchmark repositories to compare tools, and we should also seek reports of successful adoption and demonstrated utility.",
                  "journal": "none",
                  "title": "The challenge of information visualization evaluation",
                  "tldr": "As the field of information visualization matures, the tools and ideas described in research publications are reaching users but evaluation approaches need to take into account the long exploratory nature of users tasks, the value of potential discoveries or the benefits of overall awareness.",
                  "url": "https://www.semanticscholar.org/paper/63938bfa8147f17265ec20073bc07f9eee371d5a",
                  "venue": "International Working Conference on Advanced Visual Interfaces",
                  "authors": "_1764846",
                  "publicationDate": "2004-05-25"
            },
            {
                  "layer": 1,
                  "paperId": "df2bbe74a7d66e4ac488c444a42428dc288ac569",
                  "year": 2004,
                  "citationCount": 450,
                  "publicationTypes": "Review",
                  "referenceCount": 85,
                  "abstract": "Visualization can provide valuable assistance for data analysis and decision making tasks. However, how people perceive and interact with a visualization tool can strongly influence their understanding of the data as well as the systems usefulness. Human factors therefore contribute significantly to the visualization process and should play an important role in the design and evaluation of visualization tools. Several research initiatives have begun to explore human factors in visualization, particularly in perception-based design. Nonetheless, visualization work involving human factors is in its infancy, and many potentially promising areas have yet to be explored. Therefore, we aim to 1) review known methodology for doing human factors research, with specific emphasis on visualization, 2) review current human factors research in visualization to provide a basis for future investigation, and 3) identify promising areas for future research.",
                  "journal": "none",
                  "title": "Human factors in visualization research",
                  "tldr": "This work aims to review known methodology for doing human factors research, with specific emphasis on visualization, and review current human factor research in visualization to provide a basis for future investigation, and identify promising areas for future research.",
                  "url": "https://www.semanticscholar.org/paper/df2bbe74a7d66e4ac488c444a42428dc288ac569",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_2441204_143670380"
            },
            {
                  "layer": 1,
                  "paperId": "2b389276f61582e66adae329f9997b1a4d78e3d7",
                  "year": 2003,
                  "citationCount": 180,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 31,
                  "journal": "none",
                  "title": "An Energy Model for Visual Graph Clustering",
                  "tldr": "An energy model whose minimum energy drawings reveal the clusters of the drawn graph is introduced, and this characterization shows in what sense the drawings separate clusters, and how the distance of separated clusters to the other nodes can be interpreted.",
                  "url": "https://www.semanticscholar.org/paper/2b389276f61582e66adae329f9997b1a4d78e3d7",
                  "venue": "International Symposium Graph Drawing and Network Visualization",
                  "authors": "_1943843",
                  "publicationDate": "2003-09-21"
            },
            {
                  "layer": 1,
                  "paperId": "4ad76bc6be0ca9fe26520195346ed67233433be9",
                  "year": 2003,
                  "citationCount": 161,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 8,
                  "abstract": "User studies offer a scientifically sound method to measure a visualizations performance. Reasons abound for pursuing user studies, particularly when evaluating the strengths and weaknesses of different visualization techniques. A good starting point in any study is the scientific or visual design question to be examined. This drives the process of experimental design. A poorly designed experiment will yield results of only limited value. Although a comprehensive discussion of experimental design is beyond the scope of the article, we offer suggestions and lessons learned. We also describe how we designed experiments to answer important questions from our own research.",
                  "journal": "none",
                  "title": "User Studies: Why, How, and When?",
                  "tldr": "This article describes how the authors designed experiments to answer important questions from their own research and offers suggestions and lessons learned about experimental design.",
                  "url": "https://www.semanticscholar.org/paper/4ad76bc6be0ca9fe26520195346ed67233433be9",
                  "venue": "IEEE Computer Graphics and Applications",
                  "authors": "_1774937_1748811_1785908_145514676_145457561",
                  "publicationDate": "2003-07-01"
            },
            {
                  "layer": 1,
                  "paperId": "972e31f47c9efb8a1e7bdff296ff5ba9213fdf78",
                  "year": 2003,
                  "citationCount": 47,
                  "referenceCount": 6,
                  "abstract": "This paper reports an ongoing longitudinal study of the adoption of information visualization systems by administrative data analysts. Participants were initially excited about the anticipated potential of visual data analysis for their work, but gradually discovered difficulties that eventually precluded a true integration of the visualization system into their daily work practices. These difficulties are unrelated to the specific visualization system used. We conclude that data analysts can take much better advantage of the benefits of information visualization systems when these systems are redesigned to be complementary products of current data analysis and workflow systems, rather than being stand-alone products as is currently the case. Our study offers some insights about how this complementarity can be achieved.",
                  "journal": "none",
                  "title": "A Workplace Study of the Adoption of Information Visualization Systems. Proceedings of I-KNOW03: 3rd International Conference on Knowledge Management, Graz, Austria",
                  "tldr": "Data analysts can take much better advantage of the benefits of information visualization systems when these systems are redesigned to be complementary products of current data analysis and workflow systems, rather than being stand-alone products as is currently the case.",
                  "url": "https://www.semanticscholar.org/paper/972e31f47c9efb8a1e7bdff296ff5ba9213fdf78",
                  "authors": "_145558396_1715227"
            },
            {
                  "layer": 1,
                  "paperId": "fd14fd782fdb99522263f9db701831e8178b0dc5",
                  "year": 2002,
                  "citationCount": 378,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 16,
                  "journal": "none",
                  "title": "Cognitive Measurements of Graph Aesthetics",
                  "tldr": "It is argued that human pattern perception can tell us much that is relevant to the study of graph aesthetics including providing a more detailed understanding of aesthetics and suggesting new ones, and a methodology for evaluating the cognitive cost of aesthetics is introduced.",
                  "url": "https://www.semanticscholar.org/paper/fd14fd782fdb99522263f9db701831e8178b0dc5",
                  "venue": "Information Visualization",
                  "authors": "_145457561_32489306_2012200_2065960109",
                  "publicationDate": "2002-06-01"
            },
            {
                  "layer": 1,
                  "paperId": "bf81aff7e1b1294e9ed53c991fbcfed2d4c7c5e0",
                  "year": 1999,
                  "citationCount": 4706,
                  "referenceCount": 12,
                  "abstract": "1. Information Visualization 2. Space 3. Interaction 4. Focus + Context 5. Data Mapping: Text 6. Higher-Level Visualization 7. Using Vision to Think 8. Applications and Innovations 9. Conclusion Bibliography Index",
                  "journal": "none",
                  "title": "Readings in information visualization - using vision to think",
                  "tldr": "This paper presents a meta-anatomy of human interaction in the context of data mapping, which aims to provide a scaffolding for future generations to think and act in a more holistic way.",
                  "url": "https://www.semanticscholar.org/paper/bf81aff7e1b1294e9ed53c991fbcfed2d4c7c5e0",
                  "authors": "_1720492_1777393_1740403"
            },
            {
                  "layer": 1,
                  "paperId": "a7031cd14ba08f096674f0629cef65a2f6809545",
                  "year": 1998,
                  "citationCount": 262,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 34,
                  "abstract": "Information visualization encounters a wide variety of different data domains. The visualization community has developed representation methods and interactive techniques. As a community, we have realized that the requirements in each domain are often dramatically different. In order to easily apply existing methods, researchers have developed a semiology of graphic representations. We have extended this research into a framework that includes operators and interactions in visualization systems, such as a visualization spreadsheet. We discuss properties of this framework and use it to characterize operations spanning a variety of different visualization techniques. The framework developed in the paper enables a new way of exploring and evaluating the design space of visualization operators, and helps end users in their analysis tasks.",
                  "journal": "none",
                  "title": "An operator interaction framework for visualization systems",
                  "tldr": "The framework developed in the paper enables a new way of exploring and evaluating the design space of visualization operators, and helps end users in their analysis tasks.",
                  "url": "https://www.semanticscholar.org/paper/a7031cd14ba08f096674f0629cef65a2f6809545",
                  "venue": "Proceedings IEEE Symposium on Information Visualization (Cat. No.98TB100258)",
                  "authors": "_2226805_2579342",
                  "publicationDate": "1998-10-19"
            },
            {
                  "layer": 1,
                  "paperId": "ff7cd57be96c4ce2d8e62bbe67a33a33eece1b9a",
                  "year": 1998,
                  "citationCount": 57,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 17,
                  "abstract": "This paper describes by example a strategy for plotting and interacting with data in multiple metric spaces. The example system was designed for use with time-varying computational fluid dynamics (CFD) data sets, but the methodology is directly applicable to other types of field data. The central objects embodied by the tool are portraits, which show the data in various coordinate systems, while preserving their spatial connectivity and temporal variability. The coordinates are derived in various ways from the field data, and an important feature is that new and derived portraits can be created interactively. The primary operations supported by the tool are brushing and linking: the user can select a subset of a given portrait, and this subset is highlighted in all portraits. The user can combine highlighted subsets from an arbitrary number of portraits with the usual logical operators, thereby indicating where an arbitrarily complex set of conditions holds. The system is useful for exploratory visualization and feature detection in multivariate data.",
                  "journal": "none",
                  "title": "Feature detection in linked derived spaces",
                  "tldr": "This paper describes by example a strategy for plotting and interacting with data in multiple metric spaces, designed for use with time-varying computational fluid dynamics data sets, but the methodology is directly applicable to other types of field data.",
                  "url": "https://www.semanticscholar.org/paper/ff7cd57be96c4ce2d8e62bbe67a33a33eece1b9a",
                  "venue": "Proceedings Visualization 98 (Cat. No.98CB36276)",
                  "authors": "_2405399",
                  "publicationDate": "1998-10-18"
            },
            {
                  "layer": 1,
                  "paperId": "be57c79fa1d8391a0545cf04f25c6c874ab65fd1",
                  "year": 1997,
                  "citationCount": 420,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 26,
                  "abstract": "Research on information visualization has reached the point where a number of successful point designs have been proposed and a variety of techniques have been discovered. It is now appropriate to describe and analyze portions of the design space so as to understand the differences among designs and to suggest new possibilities. This paper proposes an organization of the information visualization literature and illustrates it with a series of examples. The result is a framework for designing new visualizations and augmenting existing designs.",
                  "journal": "none",
                  "title": "The structure of the information visualization design space",
                  "tldr": "This paper proposes an organization of the information visualization literature and illustrates it with a series of examples, resulting in a framework for designing new visualizations and augmenting existing designs.",
                  "url": "https://www.semanticscholar.org/paper/be57c79fa1d8391a0545cf04f25c6c874ab65fd1",
                  "venue": "Proceedings of VIZ 97: Visualization Conference, Information Visualization Symposium and Parallel Rendering Symposium",
                  "authors": "_1720492_1777393",
                  "publicationDate": "1997-10-18"
            },
            {
                  "layer": 1,
                  "paperId": "1ca641a3ec2cb3445fd62a4350a73401485603fb",
                  "year": 1996,
                  "citationCount": 5582,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 73,
                  "abstract": "A useful starting point for designing advanced graphical user interfaces is the visual information seeking Mantra: overview first, zoom and filter, then details on demand. But this is only a starting point in trying to understand the rich and varied set of information visualizations that have been proposed in recent years. The paper offers a task by data type taxonomy with seven data types (one, two, three dimensional data, temporal and multi dimensional data, and tree and network data) and seven tasks (overview, zoom, filter, details-on-demand, relate, history, and extracts).",
                  "journal": "none",
                  "title": "The eyes have it: a task by data type taxonomy for information visualizations",
                  "tldr": "A task by data type taxonomy with seven data types and seven tasks (overview, zoom, filter, details-on-demand, relate, history, and extracts) is offered.",
                  "url": "https://www.semanticscholar.org/paper/1ca641a3ec2cb3445fd62a4350a73401485603fb",
                  "venue": "Proceedings 1996 IEEE Symposium on Visual Languages",
                  "authors": "_1740403",
                  "publicationDate": "1996-09-03"
            },
            {
                  "layer": 1,
                  "paperId": "6b55c1f575570b916cdf0b9d6e2129b7a66128bd",
                  "year": 1995,
                  "citationCount": 245,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 11,
                  "abstract": "We visualize the structure of sections of the World Wide Web by constructing graphical representations in 3D hyperbolic space. The felicitous property that hyperbolic space has more room than Euclidean space allows more information to be seen amid less clutter, and motion by hyperbolic isometries provides for mathematically elegant navigation. The 3D graphical representations, available in the WebOOGL or VRML file formats, contain link anchors which point to the original pages on the Web itself. We use the Geomview/WebOOGL 3D Web browser as an interface between the 3D representation and the actual documents on the Web. The Web is just one example of a hierarchical tree structure with links back up the tree i.e. a directed graph which contains cycles. Our information visualization techniques are appropriate for other types of directed graphs with cycles, such as filesystems with symbolic links.",
                  "journal": "none",
                  "title": "Visualizing the structure of the World Wide Web in 3D hyperbolic space",
                  "tldr": "This work visualize the structure of sections of the World Wide Web by constructing graphical representations in 3D hyperbolic space and uses the Geomview/WebOOGL 3D Web browser as an interface between the 3D representation and the actual documents on the Web.",
                  "url": "https://www.semanticscholar.org/paper/6b55c1f575570b916cdf0b9d6e2129b7a66128bd",
                  "venue": "Virtual Reality Modeling Language Symposium",
                  "authors": "_1732016_47137853"
            },
            {
                  "layer": 1,
                  "paperId": "d39bf307f99188ff66404d2cda78590f3b24127c",
                  "year": 1993,
                  "citationCount": 100,
                  "referenceCount": 3,
                  "abstract": "Visualization as currently practiced is mostly a craft. Methods are often designed and evaluated by presenting results informally to potential users. No matter how efficient a visualization technique may be, or how well motivated from theory, if it does not convey information effectively, it is of little use. User studies offer a scientifically sound method to measure a visualizations performance. Although their use has become more widespread, we believe they have the potential for a much broader impact. This article describes our experiences with user studies. We offer some examples of our own studies, talk about the pitfalls and problems we encountered, and show how the results were applied to produce successful visualizations. Although our main goal is to encourage the use of studies in visualization, we recognize that other disciplines also offer important insights into visualization design, for example, the areas of visual design or the visual arts. We conclude by discussing when knowledge from these areas might be preferable to a traditional user study.",
                  "journal": "none",
                  "title": "Thoughts on User Studies: Why, How and When",
                  "tldr": "The main goal is to encourage the use of studies in visualization, but it is recognized that other disciplines also offer important insights into visualization design, for example, the areas of visual design or the visual arts.",
                  "url": "https://www.semanticscholar.org/paper/d39bf307f99188ff66404d2cda78590f3b24127c",
                  "authors": "_1774937_1748811_122566859_145514676_145457561"
            },
            {
                  "layer": 1,
                  "paperId": "f35f1c75dddf26d0cda6820b0cc4461ec1b656a0",
                  "year": 1992,
                  "citationCount": 135,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 15,
                  "abstract": "It is shown how data visualization fits into the broader process of scientific data analysis. Scientists from several disciplines were observed while they analyzed their own data. Examination of the observations exposed process elements outside conventional image viewing. For example, analysts queried for quantitative information, made a variety of comparisons, applied math, managed data, and kept records. The characterization of scientific data analysis reveals activity beyond that traditionally supported by computer. It offers an understanding which has the potential to be applied to many future designs, and suggests specific recommendations for improving the support of this important aspect of scientific computing.>",
                  "journal": "none",
                  "title": "A characterization of the scientific data analysis process",
                  "tldr": "The characterization of scientific data analysis reveals activity beyond that traditionally supported by computer that offers an understanding which has the potential to be applied to many future designs and suggests specific recommendations for improving the support of this important aspect of scientific computing.",
                  "url": "https://www.semanticscholar.org/paper/f35f1c75dddf26d0cda6820b0cc4461ec1b656a0",
                  "venue": "Proceedings Visualization 92",
                  "authors": "_67308527_31991614_1744909",
                  "publicationDate": "1992-07-01"
            },
            {
                  "layer": 1,
                  "paperId": "6d7a058a1be288de36a2c462b902506b320f5034",
                  "year": 1990,
                  "citationCount": 362,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 7,
                  "abstract": "Progress in scientific visualization could be accelerated if workers could more readily find visualization techniques relevant to a given problem. The authors describe an approach to this problem, based on a classification of visualization techniques, that is independent of particular application domains. A user breaks up a problem into subproblems, describes these subproblems in terms of the objects to be represented and the operations to be supported by a representation, locates applicable visualization techniques in a catalog, and combines these representations into a composite representation for the original problem. The catalog and its underlying classification provide a way for workers in different application disciplines to share methods.>",
                  "journal": "none",
                  "title": "A problem-oriented classification of visualization techniques",
                  "tldr": "An approach is described, based on a classification of visualization techniques, that is independent of particular application domains and provides a way for workers in different application disciplines to share methods.",
                  "url": "https://www.semanticscholar.org/paper/6d7a058a1be288de36a2c462b902506b320f5034",
                  "venue": "Proceedings of the First IEEE Conference on Visualization: Visualization `90",
                  "authors": "_1890288_145961032",
                  "publicationDate": "1990-10-23"
            },
            {
                  "layer": 1,
                  "paperId": "0b77e12759fb914b7f6ad51e5bfac3d799df141b",
                  "year": 1990,
                  "citationCount": 180,
                  "publicationTypes": "JournalArticle",
                  "journal": "none",
                  "title": "Bridging the gaps.",
                  "url": "https://www.semanticscholar.org/paper/0b77e12759fb914b7f6ad51e5bfac3d799df141b",
                  "venue": "Hospital trustee",
                  "authors": "_119536801"
            },
            {
                  "layer": 1,
                  "paperId": "f03eb469a1c83d97559960f8c4509423e4481b68",
                  "year": 1986,
                  "citationCount": 1824,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 22,
                  "abstract": "The goal of the research described in this paper is to develop an application-independent presentation tool that automatically designs effective graphical presentations (such as bar charts, scatter plots, and connected graphs) of relational information. Two problems are raised by this goal: The codification of graphic design criteria in a form that can be used by the presentation tool, and the generation of a wide variety of designs so that the presentation tool can accommodate a wide variety of information. The approach described in this paper is based on the view that graphical presentations are sentences of graphical languages. The graphic design issues are codified as expressiveness and effectiveness criteria for graphical languages. Expressiveness criteria determine whether a graphical language can express the desired information. Effectiveness criteria determine whether a graphical language exploits the capabilities of the output medium and the human visual system. A wide variety of designs can be systematically generated by using a composition algebra that composes a small set of primitive graphical languages. Artificial intelligence techniques are used to implement a prototype presentation tool called APT (A Presentation Tool), which is based on the composition algebra and the graphic design criteria.",
                  "journal": "none",
                  "title": "Automating the design of graphical presentations of relational information",
                  "tldr": "The goal of the research described in this paper is to develop an application-independent presentation tool that automatically designs effective graphical presentations (such as bar charts, scatter plots, and connected graphs) of relational information.",
                  "url": "https://www.semanticscholar.org/paper/f03eb469a1c83d97559960f8c4509423e4481b68",
                  "venue": "TOGS",
                  "authors": "_1777393",
                  "publicationDate": "1986-04-01"
            },
            {
                  "layer": 1,
                  "paperId": "34c4e6af91b25f426fde84d1c4556256f07e6e81",
                  "year": 1981,
                  "citationCount": 1291,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 6,
                  "abstract": "Two kinds of new methods are developed to obtain effective representations of hierarchies automatically: theoretical and heuristic methods. The methods determine the positions of vertices in two steps. First the order of the vertices in each level is determined to reduce the number of crossings of edges. Then horizontal positions of the vertices are determined to improve further the readability of drawings. The theoretical methods are useful in recognizing the nature of the problem, and the heuristic methods make it possible to enlarge the size of hierarchies with which we can deal. Performance tests of the heuristic methods and several applications are presented.",
                  "journal": "none",
                  "title": "Methods for Visual Understanding of Hierarchical System Structures",
                  "tldr": "Two kinds of new methods are developed to obtain effective representations of hierarchies automatically: theoretical and heuristic methods that determine the positions of vertices in two steps to improve the readability of drawings.",
                  "url": "https://www.semanticscholar.org/paper/34c4e6af91b25f426fde84d1c4556256f07e6e81",
                  "venue": "IEEE Transactions on Systems, Man and Cybernetics",
                  "authors": "_1824399_2174156_3221661",
                  "publicationDate": "1981-02-01"
            },
            {
                  "layer": 1,
                  "paperId": "19997e93c85b7f69b2ea131f67d585c22210eb0d",
                  "year": 2013,
                  "citationCount": 356,
                  "abstract": "As a whole, this book delivers what it sets out to deliver: a solid, comprehensive guide for practitioners of user research. The second edition has responded to the rapid pace of contemporary business by thoroughly revising chapters and adding new ones that reflect best practices in recent user research. In addition, the book comes with a website that extends the texts offerings to include reference materials, additional best practices and tools for user research, and items such as user consent forms and checklists. Quite possibly, this text and accompanying website might not be all that attractive to the specialist who has conducted years of advanced study into the user experience. To be fair, though, the authors of Observing the User Experience did not set out to write a manual for specialists. Their goal was to create a guide for those who are relatively new to user research or who find that their positions now require knowledge of user research. For this audience, Goodman, Kuniavsky, and Moeds book succeeds, and fulfilling the authors prediction, these readers will likely pull this book from the shelf when they must observe the user experience.",
                  "journal": "none",
                  "title": "Observing the User Experience: A Practitioners Guide to User Research (Second Edition)",
                  "tldr": "The second edition of Observing the User Experience has responded to the rapid pace of contemporary business by thoroughly revising chapters and adding new ones that reflect best practices in recent user research.",
                  "url": "https://www.semanticscholar.org/paper/19997e93c85b7f69b2ea131f67d585c22210eb0d",
                  "venue": "IEEE Transactions on Professional Communication",
                  "authors": "_3344134_2487645_143669157",
                  "publicationDate": "2013-08-14"
            },
            {
                  "layer": 1,
                  "paperId": "6916a69fcd47a97e861c8ff8309cf5f61f68ee88",
                  "year": 2012,
                  "citationCount": 578,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 100,
                  "abstract": "We take a new, scenario-based look at evaluation in information visualization. Our seven scenarios, evaluating visual data analysis and reasoning, evaluating user performance, evaluating user experience, evaluating environments and work practices, evaluating communication through visualization, evaluating visualization algorithms, and evaluating collaborative data analysis were derived through an extensive literature review of over 800 visualization publications. These scenarios distinguish different study goals and types of research questions and are illustrated through example studies. Through this broad survey and the distillation of these scenarios, we make two contributions. One, we encapsulate the current practices in the information visualization research community and, two, we provide a different approach to reaching decisions about what might be the most effective evaluation of a given information visualization. Scenarios can be used to choose appropriate research questions and goals and the provided examples can be consulted for guidance on how to design ones own study.",
                  "journal": "none",
                  "title": "Empirical Studies in Information Visualization: Seven Scenarios",
                  "tldr": "The current practices in the information visualization research community are encapsulated and a different approach is provided to reaching decisions about what might be the most effective evaluation of a given information visualization.",
                  "url": "https://www.semanticscholar.org/paper/6916a69fcd47a97e861c8ff8309cf5f61f68ee88",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_8358143_1519978914_1767660_1764846_144189259",
                  "publicationDate": "2012-09-01"
            },
            {
                  "layer": 1,
                  "paperId": "7fe7e80bf59a112386211b38ef2ea0b71ae76345",
                  "year": 2012,
                  "citationCount": 255,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 19,
                  "abstract": "Much of current machine learning (ML) research has lost its connection to problems of import to the larger world of science and society. From this perspective, there exist glaring limitations in the data sets we investigate, the metrics we employ for evaluation, and the degree to which results are communicated back to their originating domains. What changes are needed to how we conduct research to increase the impact that ML has? We present six Impact Challenges to explicitly focus the fields energy and attention, and we discuss existing obstacles that must be addressed. We aim to inspire ongoing discussion and focus on ML that matters.",
                  "journal": "none",
                  "title": "Machine Learning that Matters",
                  "tldr": "This work presents six Impact Challenges to explicitly focus the field of machine learnings energy and attention, and discusses existing obstacles that must be addressed.",
                  "url": "https://www.semanticscholar.org/paper/7fe7e80bf59a112386211b38ef2ea0b71ae76345",
                  "venue": "International Conference on Machine Learning",
                  "authors": "_6541629",
                  "publicationDate": "2012-06-18"
            },
            {
                  "layer": 1,
                  "paperId": "3907cab797bab11cee1c42902525f85914eba3c3",
                  "year": 2012,
                  "citationCount": 83,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 46,
                  "abstract": "In this design study, we present an analysis and abstraction of the data and task in the domain of fisheries management, and the design and implementation of the Vismon tool to address the identified requirements. Vismon was designed to support sophisticated data analysis of simulation results by managers who are highly knowledgeable about the fisheries domain but not experts in simulation software and statistical data analysis. The previous workflow required the scientists who built the models to spearhead the analysis process. The features of Vismon include sensitivity analysis, comprehensive and global tradeoffs analysis, and a staged approach to the visualization of the uncertainty of the underlying simulation model. The tool was iteratively refined through a multiyear engagement with fisheries scientists with a twophase approach, where an initial diverging experimentation phase to test many alternatives was followed by a converging phase where the set of multiple linked views that proved effective were integrated together in a useable way. Several fisheries scientists have used Vismon to communicate with policy makers, and it is scheduled for deployment to policy makers in Alaska.",
                  "journal": "none",
                  "title": "Vismon: Facilitating Analysis of TradeOffs, Uncertainty, and Sensitivity In Fisheries Management Decision Making",
                  "tldr": "This design study presents an analysis and abstraction of the data and task in the domain of fisheries management, and the design and implementation of the Vismon tool to address the identified requirements.",
                  "url": "https://www.semanticscholar.org/paper/3907cab797bab11cee1c42902525f85914eba3c3",
                  "venue": "Computer graphics forum (Print)",
                  "authors": "_1727304_2052742202_1724643_1732016",
                  "publicationDate": "2012-06-01"
            },
            {
                  "layer": 1,
                  "paperId": "89e434fd07177eb3ceba3b9f461b2f1be57462ee",
                  "year": 2011,
                  "citationCount": 33,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 44,
                  "abstract": "As people continue to author and share increasing amounts of information in social media, the opportunity to leverage such information for relationship discovery tasks increases. In this paper, we describe a set of systems that mine, aggregate, and infer a social graph from social media inside an enterprise, resulting in over 73 million relationships between 450,000 people. We then describe SaNDVis, a novel visual analytics tool that supports people-centric tasks like expertise location, team building, and team coordination in the enterprise. We also provide details of a 12-month-long, large-scale deployment to almost 1,800 users from which we extract dominant use cases from log and interview data. By integrating social position, evidence, and facets into SaNDVis, we demonstrate how users can use a visual analytics tool to reflect on existing relationships as well as build new relationships in an enterprise setting.",
                  "journal": "none",
                  "title": "Visual social network analytics for relationship discovery in the enterprise",
                  "tldr": "A set of systems that mine, aggregate, and infer a social graph from social media inside an enterprise, resulting in over 73 million relationships between 450,000 people are described, and SaNDVis, a novel visual analytics tool that supports people-centric tasks like expertise location, team building, and team coordination in the enterprise is described.",
                  "url": "https://www.semanticscholar.org/paper/89e434fd07177eb3ceba3b9f461b2f1be57462ee",
                  "venue": "IEEE Conference on Visual Analytics Science and Technology",
                  "authors": "_2912842_1750703_3296232_32103099_2697312",
                  "publicationDate": "2011-12-15"
            },
            {
                  "layer": 1,
                  "paperId": "1ab66b0c74aa363da498bd0780226c2f94843d10",
                  "year": 2011,
                  "citationCount": 152,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 52,
                  "abstract": "Heart disease is the number one killer in the United States, and finding indicators of the disease at an early stage is critical for treatment and prevention. In this paper we evaluate visualization techniques that enable the diagnosis of coronary artery disease. A key physical quantity of medical interest is endothelial shear stress (ESS). Low ESS has been associated with sites of lesion formation and rapid progression of disease in the coronary arteries. Having effective visualizations of a patients ESS data is vital for the quick and thorough non-invasive evaluation by a cardiologist. We present a task taxonomy for hemodynamics based on a formative user study with domain experts. Based on the results of this study we developed HemoVis, an interactive visualization application for heart disease diagnosis that uses a novel 2D tree diagram representation of coronary artery trees. We present the results of a formal quantitative user study with domain experts that evaluates the effect of 2D versus 3D artery representations and of color maps on identifying regions of low ESS. We show statistically significant results demonstrating that our 2D visualizations are more accurate and efficient than 3D representations, and that a perceptually appropriate color map leads to fewer diagnostic mistakes than a rainbow color map.",
                  "journal": "none",
                  "title": "Evaluation of Artery Visualizations for Heart Disease Diagnosis",
                  "tldr": "HemoVis is developed, an interactive visualization application for heart disease diagnosis that uses a novel 2D tree diagram representation of coronary artery trees and shows statistically significant results demonstrating that 2D visualizations are more accurate and efficient than 3D representations, and that a perceptually appropriate color map leads to fewer diagnostic mistakes than a rainbow color map.",
                  "url": "https://www.semanticscholar.org/paper/1ab66b0c74aa363da498bd0780226c2f94843d10",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_2203252_1770992_1685509_21297586_2530621_1946106_10055136_143758236",
                  "publicationDate": "2011-12-01"
            },
            {
                  "layer": 1,
                  "paperId": "1f80a8df3ff79e63f6924da5b3a1ed6aec8a0e57",
                  "year": 2011,
                  "citationCount": 45,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 32,
                  "abstract": "The relationship between candidates position on a ballot paper and vote rank is explored in the case of 5000 candidates for the UK 2010 local government elections in the Greater London area. This design study uses hierarchical spatially arranged graphics to represent two locations that affect candidates at very different scales: the geographical areas for which they seek election and the spatial location of their names on the ballot paper. This approach allows the effect of position bias to be assessed; that is, the degree to which the position of a candidates name on the ballot paper influences the number of votes received by the candidate, and whether this varies geographically. Results show that position bias was significant enough to influence rank order of candidates, and in the case of many marginal electoral wards, to influence who was elected to government. Position bias was observed most strongly for Liberal Democrat candidates but present for all major political parties. Visual analysis of classification of candidate names by ethnicity suggests that this too had an effect on votes received by candidates, in some cases overcoming alphabetic name bias. The results found contradict some earlier research suggesting that alphabetic name bias was not sufficiently significant to affect electoral outcome and add new evidence for the geographic and ethnicity influences on voting behaviour. The visual approach proposed here can be applied to a wider range of electoral data and the patterns identified and hypotheses derived from them could have significant implications for the design of ballot papers and the conduct of fair elections.",
                  "journal": "none",
                  "title": "BallotMaps: Detecting Name Bias in Alphabetically Ordered Ballot Papers",
                  "tldr": "The results found contradict some earlier research suggesting that alphabetic name bias was not sufficiently significant to affect electoral outcome and add new evidence for the geographic and ethnicity influences on voting behaviour.",
                  "url": "https://www.semanticscholar.org/paper/1f80a8df3ff79e63f6924da5b3a1ed6aec8a0e57",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_143827393_3078348_144601540_1747005",
                  "publicationDate": "2011-12-01"
            },
            {
                  "layer": 1,
                  "paperId": "9b95908edba2e468968566b58b62d41d5d080f52",
                  "year": 2011,
                  "citationCount": 118,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 76,
                  "abstract": "Working with three domain specialists we investigate human-centered approaches to geovisualization following an ISO13407 taxonomy covering context of use, requirements and early stages of design. Our case study, undertaken over three years, draws attention to repeating trends: that generic approaches fail to elicit adequate requirements for geovis application design; that the use of real data is key to understanding needs and possibilities; that trust and knowledge must be built and developed with collaborators. These processes take time but modified human-centred approaches can be effective. A scenario developed through contextual inquiry but supplemented with domain data and graphics is useful to geovis designers. Wireframe, paper and digital prototypes enable successful communication between specialist and geovis domains when incorporating real and interesting data, prompting exploratory behaviour and eliciting previously unconsidered requirements. Paper prototypes are particularly successful at eliciting suggestions, especially for novel visualization. Enabling specialists to explore their data freely with a digital prototype is as effective as using a structured task protocol and is easier to administer. Autoethnography has potential for framing the design process. We conclude that a common understanding of context of use, domain data and visualization possibilities are essential to successful geovis design and develop as this progresses. HC approaches can make a significant contribution here. However, modified approaches, applied with flexibility, are most promising. We advise early, collaborative engagement with data - through simple, transient visual artefacts supported by data sketches and existing designs - before moving to successively more sophisticated data wireframes and data prototypes.",
                  "journal": "none",
                  "title": "Human-Centered Approaches in Geovisualization Design: Investigating Multiple Methods Through a Long-Term Case Study",
                  "tldr": "It is concluded that a common understanding of context of use, domain data and visualization possibilities are essential to successful geovis design and develop as this progresses.",
                  "url": "https://www.semanticscholar.org/paper/9b95908edba2e468968566b58b62d41d5d080f52",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_2052580035_144601540",
                  "publicationDate": "2011-12-01"
            },
            {
                  "layer": 1,
                  "paperId": "87623af4ede6d5c6aeb828534eac80c5176f63d2",
                  "year": 2011,
                  "citationCount": 349,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 94,
                  "abstract": "Alongside the growing interest within HCI, and arguably computing more generally, in conducting research that has substantial societal benefits, there is a need for new ways to think about and to articulate the challenges of these engaged research projects as well as their results. Action Research (AR) is a class of methods and approaches for conducting democratic and collaborative research with community partners. AR has evolved over the last several decades and offers HCI researchers theoretical lenses, methodological approaches, and pragmatic guidance for conducting socially relevant, collaborative, and engaged research. In this article, I describe the historical context and origins of AR, the scientifically rigorous practice of conducting and evaluating AR projects, and the ways in which AR might meaningfully be applied to HCI research.",
                  "journal": "none",
                  "title": "The relationship of action research to human-computer interaction",
                  "tldr": "The historical context and origins of AR, the scientifically rigorous practice of conducting and evaluating AR projects, and the ways in which AR might meaningfully be applied to HCI research are described.",
                  "url": "https://www.semanticscholar.org/paper/87623af4ede6d5c6aeb828534eac80c5176f63d2",
                  "venue": "TCHI",
                  "authors": "_144150258",
                  "publicationDate": "2011-07-01"
            },
            {
                  "layer": 1,
                  "paperId": "cf74a9948d26c2e4c9423c668130c6736353e57f",
                  "year": 2011,
                  "citationCount": 58,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 66,
                  "abstract": "We examine the implications of evaluating data analysis processes and information visualization tools in a large company setting. While several researchers have addressed the difficulties of evaluating information visualizations with regards to changing data, tasks, and visual encodings, considerably less work has been published on the difficulties of evaluation within specific work contexts. We specifically focus on the challenges, which arise in the context of large companies with several thousand employees. Based on our own experience from a 3.5-year collaboration within a large automotive company, we first present a collection of nine information visualization evaluation challenges. We then discuss these challenges by means of two concrete visualization case studies from our own work. We finally derive a set of 16 recommendations for planning and conducting evaluations in large company settings. The set of challenges and recommendations and the discussion of our experience are meant to provide practical guidance to other researchers and practitioners, who plan to study information visualization in large company settings.",
                  "journal": "none",
                  "title": "Information visualization evaluation in large companies: Challenges, experiences and recommendations",
                  "tldr": "The implications of evaluating data analysis processes and information visualization tools in a large company setting and a set of 16 recommendations for planning and conducting evaluations in large company settings are examined.",
                  "url": "https://www.semanticscholar.org/paper/cf74a9948d26c2e4c9423c668130c6736353e57f",
                  "venue": "Information Visualization",
                  "authors": "_3020591_1767660_1774225_145422330",
                  "publicationDate": "2011-07-01"
            },
            {
                  "layer": 1,
                  "paperId": "04c671b9fec766f898dca2bca0e0da342bdd82af",
                  "year": 2011,
                  "citationCount": 88,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 53,
                  "abstract": "Grounded Theory (GT) is used within HCI research, but nuances and more modern interpretations of the method are rarely discussed. This paper has two intentions: to offer guidance on practical issues when applying GT, and to clarify the space of methodological possibilities. We describe an extended GT study on understanding why practitioners choose particular usability evaluation methods. We describe five stages in this study to highlight our experiences and choices made. We draw out seven practical and methodological considerations in applying GT in a CHI context. This challenges the more traditional inductive and objective positions on GT use; it sensitizes novices of GT to these issues; and through the extended case study it provides substance for debate on issues that affect those that use qualitative methods more broadly.",
                  "journal": "none",
                  "title": "Confessions from a grounded theory PhD: experiences and lessons learnt",
                  "tldr": "An extended GT study on understanding why practitioners choose particular usability evaluation methods is described, and seven practical and methodological considerations in applying GT in a CHI context are drawn out.",
                  "url": "https://www.semanticscholar.org/paper/04c671b9fec766f898dca2bca0e0da342bdd82af",
                  "venue": "International Conference on Human Factors in Computing Systems",
                  "authors": "_1678860_67184210_1731477",
                  "publicationDate": "2011-05-07"
            },
            {
                  "layer": 1,
                  "paperId": "67fbacfa99690644329cda993fc729f6be5a3c32",
                  "year": 2011,
                  "citationCount": 235,
                  "publicationTypes": "Book",
                  "referenceCount": 31,
                  "abstract": "Field trials of experimental systems in the wild have developed into a standard method within HCI - testing new systems with groups of users in relatively unconstrained settings outside of the laboratory. In this paper we discuss methodological challenges in running user trials. Using a trial of trials we examined the practices of investigators and participants - documenting demand characteristics, where users adjust their behaviour to fit the expectations of those running the trial, the interdependence of how trials are run and the result they produce, and how trial results can be dependent on the insights of a subset of trial participants. We develop three strategies that researchers can use to leverage these challenges to run better trials.",
                  "journal": "none",
                  "title": "Into the wild: challenges and opportunities for field trial methods",
                  "tldr": "Using a trial of trials, the practices of investigators and participants were examined - documenting demand characteristics, the interdependence of how trials are run and the result they produce, and how trial results can be dependent on the insights of a subset of trial participants.",
                  "url": "https://www.semanticscholar.org/paper/67fbacfa99690644329cda993fc729f6be5a3c32",
                  "venue": "International Conference on Human Factors in Computing Systems",
                  "authors": "_144623110_145142464_34671276",
                  "publicationDate": "2011-05-07"
            },
            {
                  "layer": 1,
                  "paperId": "399f59b4d636980d02dac29096089e6d00b27d94",
                  "year": 2011,
                  "citationCount": 109,
                  "publicationTypes": "Book",
                  "referenceCount": 54,
                  "abstract": "There are a variety of forms of ethnography inside and outside HCI each with valid complementary contributions. This paper looks at the practices of digital anthropology and how it contributes to reflexive design in HCI. The paper overviews key aspects its use in HCI, as well as in the anthropological approach. In doing so it relates these practices to participatory design and the socio-technical gap, and the ways ethnography can address them.",
                  "journal": "none",
                  "title": "Reflexivity in digital anthropology",
                  "tldr": "This paper looks at the practices of digital anthropology and how it contributes to reflexive design in HCI and relates these practices to participatory design and the socio-technical gap, and the ways ethnography can address them.",
                  "url": "https://www.semanticscholar.org/paper/399f59b4d636980d02dac29096089e6d00b27d94",
                  "venue": "International Conference on Human Factors in Computing Systems",
                  "authors": "_33257159",
                  "publicationDate": "2011-05-07"
            },
            {
                  "layer": 1,
                  "paperId": "52e6beef7687f38584ea1e37355a61c8705031ee",
                  "year": 2011,
                  "citationCount": 45,
                  "publicationTypes": "Book",
                  "referenceCount": 43,
                  "abstract": "We present Cardiogram, a visual analytics system that supports automotive engineers in debugging masses of traces each consisting of millions of recorded messages from in-car communication networks. With their increasing complexity, ensuring these safety-critical networks to be error-free has become a major task and challenge for automotive engineers. To overcome shortcomings of current analysis tools, Cardiogram combines visualization techniques with a data preprocessing approach to automatically reduce complexity based on engineers domain knowledge. In this paper, we provide the findings from an exploratory, three-year field study within a large automotive company, studying current practices of engineers, the challenges they meet and the characteristics for integrating novel visual analytics tools into their work practices. We then introduce Cardiogram, discuss how our field analysis influenced our design decisions, and present a qualitative, long-term, in-depth evaluation. Results of this study showed that our participants successfully used Cardiogram to increase the amount of analyzable information, to externalize domain knowledge, and to provide new insights into trace data. Our design approach finally led to the adoption of Cardiogram into engineers daily practices.",
                  "journal": "none",
                  "title": "Cardiogram: visual analytics for automotive engineers",
                  "tldr": "Results of this study showed that participants successfully used Cardiogram to increase the amount of analyzable information, to externalize domain knowledge, and to provide new insights into trace data.",
                  "url": "https://www.semanticscholar.org/paper/52e6beef7687f38584ea1e37355a61c8705031ee",
                  "venue": "International Conference on Human Factors in Computing Systems",
                  "authors": "_3020591_1767660_1774225_3302424_1902141_145422330",
                  "publicationDate": "2011-05-07"
            },
            {
                  "layer": 1,
                  "paperId": "6924e291837efd61ef835e7ea2a61e56fb2e3017",
                  "year": 2011,
                  "citationCount": 158,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 39,
                  "abstract": "How to identify, instantiate, and evaluate domain-specific design principles for creating more effective visualizations.",
                  "journal": "none",
                  "title": "Design principles for visual communication",
                  "tldr": "This paper explains how to identify, instantiate, and evaluate domain-specific design principles for creating more effective visualizations in the rapidly changing environment.",
                  "url": "https://www.semanticscholar.org/paper/6924e291837efd61ef835e7ea2a61e56fb2e3017",
                  "venue": "Communications of the ACM",
                  "authors": "_1820412_2108638905_2842099",
                  "publicationDate": "2011-04-01"
            },
            {
                  "layer": 1,
                  "paperId": "da324ee0f9ae45da9e162f26a5e900da918d6cb9",
                  "year": 2011,
                  "citationCount": 311,
                  "referenceCount": 1,
                  "journal": "none",
                  "title": "A very short, fairly interesting and reasonably cheap book about qualitative research",
                  "url": "https://www.semanticscholar.org/paper/da324ee0f9ae45da9e162f26a5e900da918d6cb9",
                  "authors": "_50708496",
                  "publicationDate": "2011-03-01"
            },
            {
                  "layer": 1,
                  "paperId": "d4d7370670ffa790900ff05f96c208c9eda7d58b",
                  "year": 2009,
                  "citationCount": 239,
                  "referenceCount": 57,
                  "abstract": "Graph theory models the Internet mathematically, and a number of plausible mathematically intersecting network models for the Internet have been developed and studied. Simultaneously, Internet researchers have developed methodology to use real data to validate, or invalidate, proposed Internet models. The authors look at these parallel developments, particularly as they apply to scale-free network models of the preferential attachment type.",
                  "journal": "none",
                  "title": "Mathematics and the Internet: A Source of Enormous Confusion and Great Potential",
                  "tldr": "The authors look at parallel developments in graph theory and methodology to use real data to validate, or invalidate, proposed Internet models, particularly as they apply to scale-free network models of the preferential attachment type.",
                  "url": "https://www.semanticscholar.org/paper/d4d7370670ffa790900ff05f96c208c9eda7d58b",
                  "venue": "The Best Writing on Mathematics 2010",
                  "authors": "_1744426_3293014_145838187",
                  "publicationDate": "2009-05-01"
            },
            {
                  "layer": 1,
                  "paperId": "c0f3196caaf47c417aed179d47b79cb8e6edc7bf",
                  "year": 2011,
                  "citationCount": 19,
                  "publicationTypes": "Review",
                  "referenceCount": 23,
                  "abstract": "We present lessons learned from the iterative design of QuestVis, a visualization interface for the QUEST environmental sustainability model. The QUEST model predicts the effects of policy choices in the present using scenarios of future outcomes that consist of several hundred indicators. QuestVis treats this information as a high-dimensional dataset, and shows the relationship between input choices and output indicators using linked views and a compact multilevel browser for indicator values. A first prototype also featured an overview of the space of all possible scenarios based on dimensionality reduction, but this representation was deemed to be be inappropriate for a target audience of people unfamiliar with data analysis. A second prototype with a considerably simplified and streamlined interface was created that supported comparison between multiple scenarios using a flexible approach to aggregation. However, QuestVis was not deployed because of a mismatch between the design goals of the project and the true needs of the target user community, who did not need to carry out detailed analysis of the high-dimensional dataset. We discuss this breakdown in the context of a nested model for visualization design and evaluation.",
                  "journal": "none",
                  "title": "Reflections on QuestVis: A Visualization System for an Environmental Sustainability Model",
                  "url": "https://www.semanticscholar.org/paper/c0f3196caaf47c417aed179d47b79cb8e6edc7bf",
                  "venue": "Scientific Visualization",
                  "authors": "_1732016_40553755_2116743917"
            },
            {
                  "layer": 1,
                  "paperId": "f2fcd6bfb53310076873fb5e7148604919b306f1",
                  "year": 2010,
                  "citationCount": 322,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 68,
                  "abstract": "Iteration can help people improve ideas. It can also give rise to fixation, continuously refining one option without considering others. Does creating and receiving feedback on multiple prototypes in parallel, as opposed to serially, affect learning, self-efficacy, and design exploration? An experiment manipulated whether independent novice designers created graphic Web advertisements in parallel or in series. Serial participants received descriptive critique directly after each prototype. Parallel participants created multiple prototypes before receiving feedback. As measured by click-through data and expert ratings, ads created in the Parallel condition significantly outperformed those from the Serial condition. Moreover, independent raters found Parallel prototypes to be more diverse. Parallel participants also reported a larger increase in task-specific self-confidence. This article outlines a theoretical foundation for why parallel prototyping produces better design results and discusses the implications for design education.",
                  "journal": "none",
                  "title": "Parallel prototyping leads to better design results, more divergence, and increased self-efficacy",
                  "tldr": "A theoretical foundation for why parallel prototyping produces better design results is outlined and the implications for design education are discussed.",
                  "url": "https://www.semanticscholar.org/paper/f2fcd6bfb53310076873fb5e7148604919b306f1",
                  "venue": "TCHI",
                  "authors": "_48256159_48847102_50279029_2069709701_1686695_21520403",
                  "publicationDate": "2010-12-01"
            },
            {
                  "layer": 1,
                  "paperId": "b56f337e3378dc3c91476ac324ebba9e377bed16",
                  "year": 2010,
                  "citationCount": 70,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 25,
                  "abstract": "Cells in an organism share the same genetic information in their DNA, but have very different forms and behavior because of the selective expression of subsets of their genes. The widely used approach of measuring gene expression over time from a tissue sample using techniques such as microarrays or sequencing do not provide information about the spatial position with in the tissue where these genes are expressed. In contrast, we are working with biologists who use techniques that measure gene expression in every individual cell of entire fruitfly embryos over an hour of their development, and do so for multiple closely-related subspecies of Drosophila. These scientists are faced with the challenge of integrating temporal gene expression data with the spatial location of cells and, moreover, comparing this data across multiple related species. We have worked with these biologists over the past two years to develop MulteeSum, a visualization system that supports inspection and curation of data sets showing gene expression over time, in conjunction with the spatial location of the cells where the genes are expressed - it is the first tool to support comparisons across multiple such data sets. MulteeSum is part of a general and flexible framework we developed with our collaborators that is built around multiple summaries for each cell, allowing the biologists to explore the results of computations that mix spatial information, gene expression measurements over time, and data from multiple related species or organisms. We justify our design decisions based on specific descriptions of the analysis needs of our collaborators, and provide anecdotal evidence of the efficacy of MulteeSum through a series of case studies.",
                  "journal": "none",
                  "title": "MulteeSum: A Tool for Comparative Spatial and Temporal Gene Expression Data",
                  "tldr": "MulteeSum is a visualization system that supports inspection and curation of data sets showing gene expression over time, in conjunction with the spatial location of the cells where the genes are expressed, and is the first tool to support comparisons across multiple such data sets.",
                  "url": "https://www.semanticscholar.org/paper/b56f337e3378dc3c91476ac324ebba9e377bed16",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_145976609_1732016_2334204_143758236",
                  "publicationDate": "2010-11-01"
            },
            {
                  "layer": 1,
                  "paperId": "953581661ba232833cc68891253f53e075593710",
                  "year": 2010,
                  "citationCount": 75,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 29,
                  "abstract": "Electronic test and measurement systems are becoming increasingly sophisticated in order to match the increased complexity and ultra-high speed of the devices under test. A key feature in many such instruments is a vastly increased capacity for storage of digital signals. Storage of 109 time points or more is now possible. At the same time, the typical screens on such measurement devices are relatively small. Therefore, these instruments can only render an extremely small fraction of the complete signal at any time. SignalLens uses a Focus+Context approach to provide a means of navigating to and inspecting low-level signal details in the context of the entire signal trace. This approach provides a compact visualization suitable for embedding into the small displays typically provided by electronic measurement instruments. We further augment this display with computed tracks which display time-aligned computed properties of the signal. By combining and filtering these computed tracks it is possible to easily and quickly find computationally detected features in the data which are often obscured by the visual compression required to render the large data sets on a small screen. Further, these tracks can be viewed in the context of the entire signal trace as well as visible high-level signal features. Several examples using real-world electronic measurement data are presented, which demonstrate typical use cases and the effectiveness of the design.",
                  "journal": "none",
                  "title": "SignalLens: Focus+Context Applied to Electronic Time Series",
                  "tldr": "SignalLens uses a Focus+Context approach to provide a means of navigating to and inspecting low-level signal details in the context of the entire signal trace that provides a compact visualization suitable for embedding into the small displays typically provided by electronic measurement instruments.",
                  "url": "https://www.semanticscholar.org/paper/953581661ba232833cc68891253f53e075593710",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_144183077",
                  "publicationDate": "2010-11-01"
            },
            {
                  "layer": 1,
                  "paperId": "e529680057ed5bfdc45a217dd038dd215d450861",
                  "year": 2010,
                  "citationCount": 61,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 37,
                  "abstract": "The choices we take when listening to music are expressions of our personal taste and character. Storing and accessing our listening histories is trivial due to services like Last.fm, but learning from them and understanding them is not. Existing solutions operate at a very abstract level and only produce statistics. By applying techniques from information visualization to this problem, we were able to provide average people with a detailed and powerful tool for accessing their own musical past. LastHistory is an interactive visualization for displaying music listening histories, along with contextual information from personal photos and calendar entries. Its two main user tasks are (1) analysis, with an emphasis on temporal patterns and hypotheses related to musical genre and sequences, and (2) reminiscing, where listening histories and context represent part of ones past. In this design study paper we give an overview of the field of music listening histories and explain their unique characteristics as a type of personal data. We then describe the design rationale, data and view transformations of LastHistory and present the results from both a laband a large-scale online study. We also put listening histories in contrast to other lifelogging data. The resonant and enthusiastic feedback that we received from average users shows a need for making their personal data accessible. We hope to stimulate such developments through this research.",
                  "journal": "none",
                  "title": "The Streams of Our Lives: Visualizing Listening Histories in Context",
                  "tldr": "This design study paper describes the design rationale, data and view transformations of LastHistory, an interactive visualization for displaying music listening histories, along with contextual information from personal photos and calendar entries, and presents the results from both a lab and a large-scale online study.",
                  "url": "https://www.semanticscholar.org/paper/e529680057ed5bfdc45a217dd038dd215d450861",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1774225_2969873_3020591_1741219",
                  "publicationDate": "2010-11-01"
            },
            {
                  "layer": 1,
                  "paperId": "cc69f1b5ac23db56d7bfe0aa8af03fce3422459e",
                  "year": 2010,
                  "citationCount": 83,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 32,
                  "abstract": "Biologists pioneering the new field of comparative functional genomics attempt to infer the mechanisms of gene regulation by looking for similarities and differences of gene activity over time across multiple species. They use three kinds of data: functional data such as gene activity measurements, pathway data that represent a series of reactions within a cellular process, and phylogenetic relationship data that describe the relatedness of species. No existing visualization tool can visually encode the biologically interesting relationships between multiple pathways, multiple genes, and multiple species. We tackle the challenge of visualizing all aspects of this comparative functional genomics dataset with a new interactive tool called Pathline. In addition to the overall characterization of the problem and design of Pathline, our contributions include two new visual encoding techniques. One is a new method for linearizing metabolic pathways that provides appropriate topological information and supports the comparison of quantitative data along the pathway. The second is the curvemap view, a depiction of time series data for comparison of gene activity and metabolite levels across multiple species. Pathline was developed in close collaboration with a team of genomic scientists. We validate our approach with case studies of the biologists use of Pathline and report on how they use the tool to confirm existing findings and to discover new scientific insights.",
                  "journal": "none",
                  "title": "Pathline: A Tool For Comparative Functional Genomics",
                  "tldr": "This work tackles the challenge of visualizing all aspects of this comparative functional genomics dataset with a new interactive tool called Pathline and includes two new visual encoding techniques, including a new method for linearizing metabolic pathways that provides appropriate topological information and supports the comparison of quantitative data along the pathway.",
                  "url": "https://www.semanticscholar.org/paper/cc69f1b5ac23db56d7bfe0aa8af03fce3422459e",
                  "venue": "Computer graphics forum (Print)",
                  "authors": "_145976609_2052266094_2610247_1732016_143758236",
                  "publicationDate": "2010-06-01"
            },
            {
                  "layer": 1,
                  "paperId": "af4665412e98bf02408743912427c944e2811655",
                  "year": 2009,
                  "citationCount": 177,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 20,
                  "abstract": "In the field of comparative genomics, scientists seek to answer questions about evolution and genomic function by comparing the genomes of species to find regions of shared sequences. Conserve dsyntenic blocks are an important biological data abstraction for indicating regions of shared sequences. The goal of this work is to show multiple types of relationships at multiple scales in a way that is visually comprehensible in accordance with known perceptual principles. We present a task analysis for this domain where the fundamental questions asked by biologists can be understood by a characterization of relationships into the four types of proximity/location, size, orientation, and similarity/strength, and the four scales of genome, chromosome, block, and genomic feature. We also propose a new taxonomy of the design space for visually encoding conservation data. We present MizBee, a multiscale synteny browser with the unique property of providing interactive side-by-side views of the data across the range of scales supporting exploration of all of these relationship types. We conclude with case studies from two biologists who used MizBee to augment their previous automatic analysis work flow, providing anecdotal evidence about the efficacy of the system for the visualization of syntenic data, the analysis of conservation relationships, and the communication of scientific insights.",
                  "journal": "none",
                  "title": "MizBee: A Multiscale Synteny Browser",
                  "tldr": "MizBee is presented, a multiscale synteny browser with the unique property of providing interactive side-by-side views of the data across the range of scales supporting exploration of all of these relationship types.",
                  "url": "https://www.semanticscholar.org/paper/af4665412e98bf02408743912427c944e2811655",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_145976609_1732016_143758236",
                  "publicationDate": "2009-11-01"
            },
            {
                  "layer": 1,
                  "paperId": "6f43843e9c4121bbcf64ff50f0a4f164fc1c9e7f",
                  "year": 2009,
                  "citationCount": 68,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 33,
                  "abstract": "We present an interactive framework for exploring space-time and form-function relationships in experimentally collected high-resolution biomechanical data sets. These data describe complex 3D motions (e.g. chewing, walking, flying) performed by animals and humans and captured via high-speed imaging technologies, such as biplane fluoroscopy. In analyzing these 3D biomechanical motions, interactive 3D visualizations are important, in particular, for supporting spatial analysis. However, as researchers in information visualization have pointed out, 2D visualizations can also be effective tools for multi-dimensional data analysis, especially for identifying trends over time. Our approach, therefore, combines techniques from both 3D and 2D visualizations. Specifically, it utilizes a multi-view visualization strategy including a small multiples view of motion sequences, a parallel coordinates view, and detailed 3D inspection views. The resulting framework follows an overview first, zoom and filter, then details-on-demand style of analysis, and it explicitly targets a limitation of current tools, namely, supporting analysis and comparison at the level of a collection of motions rather than sequential analysis of a single or small number of motions. Scientific motion collections appropriate for this style of analysis exist in clinical work in orthopedics and physical rehabilitation, in the study of functional morphology within evolutionary biology, and in other contexts. An application is described based on a collaboration with evolutionary biologists studying the mechanics of chewing motions in pigs. Interactive exploration of data describing a collection of more than one hundred experimentally captured pig chewing cycles is described.",
                  "journal": "none",
                  "title": "Interactive Coordinated Multiple-View Visualization of Biomechanical Motion Data",
                  "tldr": "An interactive framework for exploring space-time and form-function relationships in experimentally collected high-resolution biomechanical data sets and utilizes a multi-view visualization strategy including a small multiples view of motion sequences, a parallel coordinates view, and detailed 3D inspection views.",
                  "url": "https://www.semanticscholar.org/paper/6f43843e9c4121bbcf64ff50f0a4f164fc1c9e7f",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_145735309_40406972_49907592_145635842",
                  "publicationDate": "2009-11-01"
            },
            {
                  "layer": 1,
                  "paperId": "768d4cb5a2546e0f233b43ad747091ba93ed24a8",
                  "year": 2009,
                  "citationCount": 78,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 27,
                  "abstract": "One bottleneck in large-scale genome sequencing projects is reconstructing the full genome sequence from the short subsequences produced by current technologies. The final stages of the genome assembly process inevitably require manual inspection of data inconsistencies and could be greatly aided by visualization. This paper presents our design decisions in translating key data features identified through discussions with analysts into a concise visual encoding. Current visualization tools in this domain focus on local sequence errors making high-level inspection of the assembly difficult if not impossible. We present a novel interactive graph display, ABySS-Explorer, that emphasizes the global assembly structure while also integrating salient data features such as sequence length. Our tool replaces manual and in some cases pen-and-paper based analysis tasks, and we discuss how user feedback was incorporated into iterative design refinements. Finally, we touch on applications of this representation not initially considered in our design phase, suggesting the generality of this encoding for DNA sequence data.",
                  "journal": "none",
                  "title": "ABySS-Explorer: Visualizing Genome Sequence Assemblies",
                  "tldr": "A novel interactive graph display, ABySS-Explorer, is presented that emphasizes the global assembly structure while also integrating salient data features such as sequence length, suggesting the generality of this encoding for DNA sequence data.",
                  "url": "https://www.semanticscholar.org/paper/768d4cb5a2546e0f233b43ad747091ba93ed24a8",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_145252762_2245152_144831170_143622307",
                  "publicationDate": "2009-11-01"
            },
            {
                  "layer": 1,
                  "paperId": "f82f32b7c1d469e7c8b69e5b16fad57607b812ab",
                  "year": 2009,
                  "citationCount": 91,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 38,
                  "abstract": "We explore the effects of selecting alternative layouts in hierarchical displays that show multiple aspects of large multivariate datasets, including spatial and temporal characteristics. Hierarchical displays of this type condition a dataset by multiple discrete variable values, creating nested graphical summaries of the resulting subsets in which size, shape and colour can be used to show subset properties. These small multiples are ordered by the conditioning variable values and are laid out hierarchically using dimensional stacking. Crucially, we consider the use of different layouts at different hierarchical levels, so that the coordinates of the plane can be used more effectively to draw attention to trends and anomalies in the data. We argue that these layouts should be informed by the type of conditioning variable and by the research question being explored. We focus on space-filling rectangular layouts that provide data-dense and rich overviews of data to address research questions posed in our exploratory analysis of spatial and temporal aspects of property sales in London. We develop a notation (HiVE) that describes visualisation and layout states and provides reconfiguration operators, demonstrate its use for reconfiguring layouts to pursue research questions and provide guidelines for this process. We demonstrate how layouts can be related through animated transitions to reduce the cognitive load associated with their reconfiguration whilst supporting the exploratory process.",
                  "journal": "none",
                  "title": "Configuring Hierarchical Layouts to Address Research Questions",
                  "tldr": "A notation that describes visualisation and layout states and provides reconfiguration operators is developed and demonstrated its use for reconfiguring layouts to pursue research questions and guidelines for this process are provided.",
                  "url": "https://www.semanticscholar.org/paper/f82f32b7c1d469e7c8b69e5b16fad57607b812ab",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1747005_144601540_143827393",
                  "publicationDate": "2009-11-01"
            },
            {
                  "layer": 1,
                  "paperId": "615aac6f5dfea3b93bfd601f53ddefec0bcf27f4",
                  "year": 2009,
                  "citationCount": 76,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 42,
                  "abstract": "Grounded Theory is growing in popularity as a research method in ICT research areas such as Information Systems and Software Engineering. Although there are two distinct methods, namely the Glaserian and the Straussian versions, a substantial number of research articles tend to ignore the difference and just claim that they are using grounded theory. To a researcher new to the grounded theory method, the two methods look very similar. Because the Straussian method is more prescriptive, most opt to follow this method, without investigating the Glaserian version. The few who try to use a hybrid of the two methods (not appreciating that the two methods are substantially different), only realize after a significant investment in time that the methods are not reconcilable and that either the one or the other should be followed. To contribute towards eliminating the confusion, this paper investigates the differences between the two methods. This will, hopefully, enable ICT researchers to make a more informed decision on which method to follow.",
                  "journal": "none",
                  "title": "Glaserian and Straussian grounded theory: similar or completely different?",
                  "tldr": "This paper investigates the differences between the Glaserian and Straussian methods to enable ICT researchers to make a more informed decision on which method to follow.",
                  "url": "https://www.semanticscholar.org/paper/615aac6f5dfea3b93bfd601f53ddefec0bcf27f4",
                  "venue": "Research Conference of the South African Institute of Computer Scientists and Information Technologists",
                  "authors": "_2253503_144010634",
                  "publicationDate": "2009-10-12"
            },
            {
                  "layer": 1,
                  "paperId": "15d48e2e5a166fa24fb4b7a29762babf61e1d838",
                  "year": 2009,
                  "citationCount": 23,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 25,
                  "abstract": "The MOST bus is a current bus technology for connecting multimedia components in cars, such as radios, navigation systems, or media players. The bus functionality is described in a large hierarchically structured catalog of some 4000 entries. Browsing this catalog has become infeasible on paper as well as with currently used textual database interfaces. An observation of current work practices has revealed many problems and inefciencies. We describe the (iteratively developed) design of MostVis, a visual tool for exploring MOST function catalogs, as well as an evaluation of our implemented prototype. Our design carefully adapts existing visualization techniques and combines them in a multiple coordinated view (MCV) approach to satisfy the specic needs of our target group. With this paper, we hope to provide a living example of how existing general-purpose techniques can be successfully trimmed and tailored for a very specic audience.",
                  "journal": "none",
                  "title": "MostVis: An Interactive Visualization Supporting Automotive Engineers in MOST Catalog Exploration",
                  "tldr": "The (iteratively developed) design of MostVis is described, a visual tool for exploring MOST function catalogs, as well as an evaluation of the implemented prototype.",
                  "url": "https://www.semanticscholar.org/paper/15d48e2e5a166fa24fb4b7a29762babf61e1d838",
                  "venue": "2009 13th International Conference Information Visualisation",
                  "authors": "_3020591_1945972_2753690_1741219_145422330",
                  "publicationDate": "2009-07-15"
            },
            {
                  "layer": 1,
                  "paperId": "d129968a805213abf8065cb6821a9d3865a61f0b",
                  "year": 2009,
                  "citationCount": 11,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 24,
                  "journal": "none",
                  "title": "User-Centered Development of a Visual Exploration System for In-Car Communication",
                  "tldr": "This work followed a user-centered approach to design several visualizations for in-car communication processes, each with a clear purpose and application scenario, and revealed the emergence of a novel mental model for thinking about and discussing in- car communication processes.",
                  "url": "https://www.semanticscholar.org/paper/d129968a805213abf8065cb6821a9d3865a61f0b",
                  "venue": "International Symposium on Smart Graphics",
                  "authors": "_3020591_21762379_1764447_145422330",
                  "publicationDate": "2009-05-22"
            },
            {
                  "layer": 1,
                  "paperId": "8fce25caddce972a933f2768b189593fbcdf5a0a",
                  "year": 2009,
                  "citationCount": 153,
                  "publicationTypes": "Book",
                  "referenceCount": 44,
                  "abstract": "We review the current status of ethnography in systems design. We focus particularly on new approaches to and understandings of ethnography that have emerged as the computer has moved out of the workplace. These seek to implement a different order of ethnographic study to that which has largely been employed in design to date. In doing so they reconfigure the relationship ethnography has to systems design, replacing detailed empirical studies of situated action with studies that provide cultural interpretations of action and critiques of the design process itself. We hold these new approaches to and understandings of ethnography in design up to scrutiny, with the purpose of enabling designers to appreciate the differences between new and existing approaches to ethnography in systems design and the practical implications this might have for design.",
                  "journal": "none",
                  "title": "Ethnography considered harmful",
                  "tldr": "New approaches to and understandings of ethnography that have emerged as the computer has moved out of the workplace are focused on, enabling designers to appreciate the differences between new and existing approaches to ethnography in systems design and the practical implications this might have for design.",
                  "url": "https://www.semanticscholar.org/paper/8fce25caddce972a933f2768b189593fbcdf5a0a",
                  "venue": "International Conference on Human Factors in Computing Systems",
                  "authors": "_1713085_145282573_1834641_145218181",
                  "publicationDate": "2009-04-04"
            },
            {
                  "layer": 1,
                  "paperId": "a56250a2d8daf1dde5d0322b9ab36b4ee49eb6de",
                  "year": 2009,
                  "citationCount": 4,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 36,
                  "abstract": "The Old Library of Trinity College Dublin, built in 1732, is an internationally renowned research library. In recent decades it has also become a major tourist attraction in Dublin, with the display of the Book of Kells within the Old Library now drawing over half a million visitors per year. The Preservation and Conservation Department of the Library has raised concerns about the impact of the environment on the collection. The location of the building in the city centre, large visitor numbers, and the conditions within the building are putting the collection at risk. In developing a strategic plan to find solutions to these problems, the department has been assessing and documenting the current situation. This paper introduces ongoing work on a system to visualise the collected data, which includes: dust levels and dispersion, internal and external temperature and relative humidity levels, and visitor numbers in the Old Library. We are developing a user interface for which the data, originally stored in various file formats, is consolidated in a database which can be explored using a 3D virtual reconstruction of the Old Library. With this novel technique, it is also possible to compare and assess the relationships between the various datasets in context.",
                  "journal": "none",
                  "title": "LibViz: Data Visualisation of the Old Library",
                  "tldr": "This paper introduces ongoing work on a system to visualise the collected data, which includes: dust levels and dispersion, internal and external temperature and relative humidity levels, and visitor numbers in the Old Library, and develops a user interface for which the data is consolidated in a database.",
                  "url": "https://www.semanticscholar.org/paper/a56250a2d8daf1dde5d0322b9ab36b4ee49eb6de",
                  "authors": "_38592832_1401754697_3007818_3020591",
                  "publicationDate": "2009-01-01"
            },
            {
                  "layer": 1,
                  "paperId": "8520ad5025d4bc50d9db59c267d3a38ea1fab242",
                  "year": 2008,
                  "citationCount": 17,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 18,
                  "abstract": "With the increasing complexity of in-car communication architectures, their diagnostics have become essential for automotive development and maintenance. In order to help engineers to detect and analyze the potential sources and consequences of errors, it is crucial to provide both comprehensive and detailed insight into the communication processes and their contexts. Two important aspects of these are the dependencies and correlations between onboard functions. In this paper we present a dual-view visualization for exploring the functional dependency chains of in-car communication processes. One view presents the dependencies of hardware components using a space filling approach similar to a treemap, whereas the other view displays the functional correlations as an interactive sequence chart. The views are coupled via color coding and show the dependencies of an interactively selectable functional unit. In an expert evaluation, we assessed the benefits of using this visualization technique for in-car communication diagnostics with very positive results.",
                  "journal": "none",
                  "title": "A Dual-View Visualization of In-Car Communication Processes",
                  "tldr": "A dual-view visualization for exploring the functional dependency chains of in-car communication processes and shows the dependencies of hardware components using a space filling approach similar to a treemap and the functional correlations as an interactive sequence chart.",
                  "url": "https://www.semanticscholar.org/paper/8520ad5025d4bc50d9db59c267d3a38ea1fab242",
                  "venue": "2008 12th International Conference Information Visualisation",
                  "authors": "_3020591_1764447_2094885960_3210728_145422330",
                  "publicationDate": "2008-07-09"
            },
            {
                  "layer": 1,
                  "paperId": "ad3fe16611312d4e58f7a7f90a21a7230f5ec6f6",
                  "year": 2008,
                  "citationCount": 578,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 46,
                  "abstract": "Current practice in Human Computer Interaction as encouraged by educational institutes, academic review processes, and institutions with usability groups advocate usability evaluation as a critical part of every design process. This is for good reason: usability evaluation has a significant role to play when conditions warrant it. Yet evaluation can be ineffective and even harmful if naively done by rule rather than by thought. If done during early stage design, it can mute creative ideas that do not conform to current interface norms. If done to test radical innovations, the many interface issues that would likely arise from an immature technology can quash what could have been an inspired vision. If done to validate an academic prototype, it may incorrectly suggest a designs scientific worthiness rather than offer a meaningful critique of how it would be adopted and used in everyday practice. If done without regard to how cultures adopt technology over time, then todays reluctant reactions by users will forestall tomorrows eager acceptance. The choice of evaluation methodology - if any - must arise from and be appropriate for the actual problem or research question under consideration.",
                  "journal": "none",
                  "title": "Usability evaluation considered harmful (some of the time)",
                  "tldr": "Current practice in Human Computer Interaction as encouraged by educational institutes, academic review processes, and institutions with usability groups advocate usability evaluation as a critical part of every design process.",
                  "url": "https://www.semanticscholar.org/paper/ad3fe16611312d4e58f7a7f90a21a7230f5ec6f6",
                  "venue": "International Conference on Human Factors in Computing Systems",
                  "authors": "_144343609_145884449",
                  "publicationDate": "2008-04-06"
            },
            {
                  "layer": 1,
                  "paperId": "785e3bcd1dcc286ad3216621acf56f7c28f65eec",
                  "year": 2008,
                  "citationCount": 135,
                  "referenceCount": 54,
                  "journal": "none",
                  "title": "Process and Pitfalls in Writing Information Visualization Research Papers",
                  "tldr": "The goal of this chapter is to help authors recognize and avoid a set of pitfalls that recur in many rejected information visualization papers, using a chronological model of the research process.",
                  "url": "https://www.semanticscholar.org/paper/785e3bcd1dcc286ad3216621acf56f7c28f65eec",
                  "venue": "Information Visualization",
                  "authors": "_1732016",
                  "publicationDate": "2008-03-01"
            },
            {
                  "layer": 1,
                  "paperId": "e759f0bdcbb26a1f895de136b4dd94eb20c05124",
                  "year": 2008,
                  "citationCount": 18,
                  "referenceCount": 11,
                  "journal": "none",
                  "title": "Theoretical analysis and theory creation",
                  "url": "https://www.semanticscholar.org/paper/e759f0bdcbb26a1f895de136b4dd94eb20c05124",
                  "authors": "_144978737_145753642_1707941"
            },
            {
                  "layer": 1,
                  "paperId": "2c9e07829d6096121236addb48004f9b4f66b897",
                  "year": 2007,
                  "citationCount": 84,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 24,
                  "abstract": "Many researchers and practitioners in user experience design have turned towards social sciences to find ways to understand the social contexts in which both users and technologies are embedded. Ethnographic approaches are increasingly prominent as means by which this might be accomplished. However, a very wide range of forms of social investigation travel under the ethnography banner in HCI, suggesting that there is still considerable debate over what ethnography is and how it can best be employed in design contexts. Building on earlier discussions and debates around ethnography and its implications, this paper explores how ethnographic methods might be consequential for design. In particular, it illustrates the implications for design that might be derived from classical ethnographic material and shows that these may not be of the form that HCI research normally imagines or expects.",
                  "journal": "none",
                  "title": "Responsibilities and implications: further thoughts on ethnography and design",
                  "tldr": "This paper illustrates the implications for design that might be derived from classical ethnographic material and shows that these may not be of the form that HCI research normally imagines or expects.",
                  "url": "https://www.semanticscholar.org/paper/2c9e07829d6096121236addb48004f9b4f66b897",
                  "venue": "Conference on Designing for User eXperiences",
                  "authors": "_1762952",
                  "publicationDate": "2007-11-05"
            },
            {
                  "layer": 1,
                  "paperId": "264a649b3ccaa1fda5b912e5a614265b23fc5c02",
                  "year": 2007,
                  "citationCount": 212,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 39,
                  "journal": "none",
                  "title": "Why Its Worth the Hassle: The Value of In-Situ Studies When Designing Ubicomp",
                  "tldr": "It is shown how in-situ studies can play an important role in the design and evaluation of Ubicomp applications and user experiences.",
                  "url": "https://www.semanticscholar.org/paper/264a649b3ccaa1fda5b912e5a614265b23fc5c02",
                  "venue": "Ubiquitous Computing",
                  "authors": "_1685816_31963703_37415569_1747754_48676530_2069315301_1703615_1688145",
                  "publicationDate": "2007-09-16"
            },
            {
                  "layer": 1,
                  "paperId": "09e0eaf1a4f2468606eabff027704fce2e6d5037",
                  "year": 2006,
                  "citationCount": 154,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 42,
                  "abstract": "Visualization tools are typically evaluated in controlled studies that observe the short-term usage of these tools by participants on preselected data sets and benchmark tasks. Though such studies provide useful suggestions, they miss the long-term usage of the tools. A longitudinal study of a bioinformatics data set analysis is reported here. The main focus of this work is to capture the entire analysts process that an analyst goes through from a raw data set to the insights sought from the data. The study provides interesting observations about the use of visual representations and interaction mechanisms provided by the tools, and also about the process of insight generation in general. This deepens our understanding of visual analytics, guides visualization developers in creating more effective visualization tools in terms of user requirements, and guides evaluators in designing future studies that are more representative of insights sought by users from their data sets",
                  "journal": "none",
                  "title": "An Insight-Based Longitudinal Study of Visual Analytics",
                  "tldr": "The main focus of this work is to capture the entire analysts process that an analyst goes through from a raw data set to the insights sought from the data.",
                  "url": "https://www.semanticscholar.org/paper/09e0eaf1a4f2468606eabff027704fce2e6d5037",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1804600_144305975_46699176_1792197",
                  "publicationDate": "2006-11-01"
            },
            {
                  "layer": 1,
                  "paperId": "1a9def6f2fa632d4385c90e6efb3afcbb66db5a5",
                  "year": 2006,
                  "citationCount": 783,
                  "publicationTypes": "Book",
                  "referenceCount": 47,
                  "abstract": "Although ethnography has become a common approach in HCI research and design, considerable confusion still attends both ethnographic practice and the criteria by which it should be evaluated in HCI. Often, ethnography is seen as an approach to field investigation that can generate requirements for systems development; by that token, the major evaluative criterion for an ethnographic study is the implications it can provide for design. Exploring the nature of ethnographic inquiry, this paper suggests that implications for design may not be the best metric for evaluation and may, indeed, fail to capture the value of ethnographic investigations.",
                  "journal": "none",
                  "title": "Implications for design",
                  "tldr": "It is suggested that implications for design may not be the best metric for evaluation and may, indeed, fail to capture the value of ethnographic investigations.",
                  "url": "https://www.semanticscholar.org/paper/1a9def6f2fa632d4385c90e6efb3afcbb66db5a5",
                  "venue": "International Conference on Human Factors in Computing Systems",
                  "authors": "_1762952",
                  "publicationDate": "2006-04-22"
            },
            {
                  "layer": 1,
                  "paperId": "0d6cf3cd3794bc31a4e5a8ded4d4ba83bb20f9b0",
                  "year": 2006,
                  "citationCount": 13509,
                  "publicationTypes": "Review",
                  "abstract": "BOOK REVIEW: Constructing grounded theory. A practical guide through qualitative analysis Kathy Charmaz, 2006, 208 pp. London: Sage. ISBN 2005928035",
                  "journal": "none",
                  "title": "Constructing Grounded Theory. A Practical Guide Through Qualitative Analysis",
                  "url": "https://www.semanticscholar.org/paper/0d6cf3cd3794bc31a4e5a8ded4d4ba83bb20f9b0",
                  "venue": "QMiP bulletin",
                  "authors": "_143750360_4112577_9021417_37418783_5238020_47157491",
                  "publicationDate": "2006-01-09"
            },
            {
                  "layer": 1,
                  "paperId": "57b89240ec2ba1eb867eaca6367262b6ab7c65d2",
                  "year": 2005,
                  "citationCount": 333,
                  "abstract": "This book concerns the process of designing IT systems for large, complex purposes. It is structured as a textbook-style introduction to the processes required for use in university teaching and for self-study purposes by people working in the field of IT system development. The content of the book is the fruit of a decade of research by the authors in their pursuit of a method to plan and design IT projects that will provide sustainable, useful solutions to the needs of the companies for which they are commissioned.",
                  "journal": "none",
                  "title": "Participatory IT Design: Designing for Business and Workplace Realities",
                  "url": "https://www.semanticscholar.org/paper/57b89240ec2ba1eb867eaca6367262b6ab7c65d2",
                  "venue": "IEEE Transactions on Professional Communication",
                  "authors": "_2102964344",
                  "publicationDate": "2005-09-01"
            },
            {
                  "layer": 1,
                  "paperId": "a36e10546866fc8da83f1e308442cb3a8f7d5d68",
                  "year": 2005,
                  "citationCount": 151,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 30,
                  "abstract": "The design and evaluation of most current information visualization systems descend from an emphasis on a users ability to unpack the representations of data of interest and operate on them independently. Too often, successful decision-making and analysis are more a matter of serendipity and user experience than of intentional design and specific support for such tasks; although humans have considerable abilities in analyzing relationships from data, the utility of visualizations remains relatively variable across users, data sets, and domains. In this paper, we discuss the notion of analytic gaps, which represent obstacles faced by visualizations in facilitating higher-level analytic tasks, such as decision-making and learning. We discuss support for bridging these gaps, propose a framework for the design and evaluation of information visualization systems, and demonstrate its use.",
                  "journal": "none",
                  "title": "Knowledge precepts for design and evaluation of information visualizations",
                  "tldr": "The notion of analytic gaps, which represent obstacles faced by visualizations in facilitating higher-level analytic tasks, are discussed, a framework for the design and evaluation of information visualization systems is proposed, and its use is demonstrated.",
                  "url": "https://www.semanticscholar.org/paper/a36e10546866fc8da83f1e308442cb3a8f7d5d68",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1909986_1691661",
                  "publicationDate": "2005-07-01"
            },
            {
                  "layer": 1,
                  "paperId": "f2ab3f41938c9f4ada95104c6b8a19b3c585dfcf",
                  "year": 2005,
                  "citationCount": 21,
                  "referenceCount": 25,
                  "abstract": "We present the PowerSetViewer visualization system for the lattice-based mining of power sets. Searching for itemsets within the power set of a universe occurs in many large dataset knowledge discovery contexts. Using a spatial layout based on a power set provides a unified visual framework at three different levels: data mining on the filtered dataset, browsing the entire dataset, and comparing multiple datasets sharing the same alphabet. The features of our system allow users to find appropriate parameter settings for data mining algorithms through lightweight visual experimentation showing partial results. We use dynamic constrained frequent set mining as a concrete case study to showcase the utility of the system. The key challenge for spatial layouts based on power set structure is handling large alphabets, because the size of the power set grows exponentially with the size of the alphabet. We present scalable algorithms for enumerating and displaying datasets containing between 1.5 and 7 million itemsets, and alphabet sizes of over 40,000.",
                  "journal": "none",
                  "title": "Visual mining of power sets with large alphabets",
                  "tldr": "This work uses dynamic constrained frequent set mining as a concrete case study to showcase the utility of the PowerSetViewer visualization system and presents scalable algorithms for enumerating and displaying datasets containing between 1.5 and 7 million itemsets, and alphabet sizes of over 40,000.",
                  "url": "https://www.semanticscholar.org/paper/f2ab3f41938c9f4ada95104c6b8a19b3c585dfcf",
                  "authors": "_1732016_47093714_1736021_2061498545_2762881_39306444_1726081"
            },
            {
                  "layer": 1,
                  "paperId": "e0d3ea6f33a2712b9f33707fd33443c1df354ecc",
                  "year": 2005,
                  "citationCount": 2201,
                  "referenceCount": 3,
                  "abstract": "This is the book form of the Research and Development Agenda for Visual Analytics to be published by IEEE in 2005.",
                  "journal": "none",
                  "title": "Illuminating the Path: The Research and Development Agenda for Visual Analytics",
                  "tldr": "This is the book form of the Research and Development Agenda for Visual Analytics to be published by IEEE in 2005.",
                  "url": "https://www.semanticscholar.org/paper/e0d3ea6f33a2712b9f33707fd33443c1df354ecc",
                  "authors": "_2157867977_2927414"
            },
            {
                  "layer": 1,
                  "paperId": "a822ce93fa4d83f55929504115a7ef10eb7d2453",
                  "year": 2004,
                  "citationCount": 144,
                  "referenceCount": 147,
                  "abstract": "The field of human-computer interaction is rapidly expanding. Alongside the extensive technological developments that are currently taking place, is the emergence of a cottage industry culture, where a polyphony of new theories, methods and concerns have been imported into the field from a diversity of disciplines and backgrounds. An extensive critique of recent theoretical developments is presented together with what practitioners currently use. A significant development of importing new theories into the field has been much insightful explication of HCI phenomena, together with extending the fields discourse. However, at the same time, the theoretically-based approaches have had a limited impact on the practice of interaction design. This chapter discusses why this is so and suggests that different kinds of mechanisms are needed that will enable both designers and researchers to better articulate and theoretically ground the hard challenges facing them today.",
                  "journal": "none",
                  "title": "NEW THEORETICAL APPROACHES FOR HCI",
                  "url": "https://www.semanticscholar.org/paper/a822ce93fa4d83f55929504115a7ef10eb7d2453",
                  "authors": "_1685816"
            },
            {
                  "layer": 1,
                  "paperId": "4131bc7e8cc20607e38edc61d44e90d427b02f1a",
                  "year": 2003,
                  "citationCount": 27,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 26,
                  "abstract": "Microarrays are relatively new, high-throughput data acquisition technology for investigating biological phenomena at the micro-level. One of the more common procedures for microarray experimentation is that of the microarray time-course experiment. The product of microarray time-course experiment is time-series data, which subject to proper analysis has the potential to have significant impact on the diagnosis, treatment, and prevention of diseases. While existing information visualization techniques go some way to making microarray time-series data more manageable, requirements analysis has revealed significant limitations. The main finding was that users were unable to uncover and quantify common changes in value over a specified time-period. This paper describes a novel technique that provides this functionality by allowing the user to visually formulate and modify measurable queries with separate time-period and condition components. These visual queries are supported by the combination of a traditional value against time graph representation of the data with a complementary scatter-plot representation of a specified time-period. The multiple views of the visualization are coordinated so that the user can formulate and modify queries with rapid reversible display of query results in the traditional value against time graph format.",
                  "journal": "none",
                  "title": "Coordinated graph and scatter-plot views for the visual exploration of microarray time-series data",
                  "tldr": "A novel technique is described that provides functionality by allowing the user to visually formulate and modify measurable queries with separate time-period and condition components, supported by the combination of a traditional value against time graph representation of the data with a complementary scatter-plot representation of a specified time- period.",
                  "url": "https://www.semanticscholar.org/paper/4131bc7e8cc20607e38edc61d44e90d427b02f1a",
                  "venue": "IEEE Information Visualization Conference",
                  "authors": "_33993929_1977511",
                  "publicationDate": "2003-10-19"
            },
            {
                  "layer": 1,
                  "paperId": "f9b3ca89c69bacfade039c8be40762c6857bda11",
                  "year": 2003,
                  "citationCount": 1290,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 50,
                  "abstract": "Although many view iterative and incremental development as a modern practice, its application dates as far back as the mid-1950s. Prominent software-engineering thought leaders from each succeeding decade supported IID practices, and many large projects used them successfully. These practices may have differed in their details, but all had a common theme-to avoid a single-pass sequential, document-driven, gated-step approach.",
                  "journal": "none",
                  "title": "Iterative and incremental developments. a brief history",
                  "tldr": "Although many view iterative and incremental development as a modern practice, its application dates as far back as the mid-1950s, with prominent software-engineering thought leaders from each succeeding decade supporting IID practices.",
                  "url": "https://www.semanticscholar.org/paper/f9b3ca89c69bacfade039c8be40762c6857bda11",
                  "venue": "Computer",
                  "authors": "_3199023_1678713",
                  "publicationDate": "2003-06-01"
            },
            {
                  "layer": 1,
                  "paperId": "4f185156374677a03df874d34bbb60bd72bbc6d0",
                  "year": 2003,
                  "citationCount": 1360,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 25,
                  "abstract": "We describe a new method for use in the process of co-designing technologies with users called technology probes. Technology probes are simple, flexible, adaptable technologies with three interdisciplinary goals: the social science goal of understanding the needs and desires of users in a real-world setting, the engineering goal of field-testing the technology, and the design goal of inspiring users and researchers to think about new technologies. We present the results of designing and deploying two technology probes, the messageProbe and the videoProbe, with diverse families in France, Sweden, and the U.S. We conclude with our plans for creating new technologies for and with families based on our experiences.",
                  "journal": "none",
                  "title": "Technology probes: inspiring design for and with families",
                  "tldr": "A new method for use in the process of co-designing technologies with users called technology probes, which are simple, flexible, adaptable technologies with three interdisciplinary goals: the social science goal of understanding the needs and desires of users in a real-world setting, the engineering goal of field-testing the technology, and the design goal of inspiring users and researchers to think about new technologies.",
                  "url": "https://www.semanticscholar.org/paper/4f185156374677a03df874d34bbb60bd72bbc6d0",
                  "venue": "International Conference on Human Factors in Computing Systems",
                  "authors": "_143624502_1732917_143633214_1799187_145957514_1764846_1401678555_1783132_93506637_2052583658_144784319_2496336",
                  "publicationDate": "2003-04-05"
            },
            {
                  "layer": 1,
                  "paperId": "bf79183344c7bb01205aa07798cd1080f48e70f6",
                  "year": 2002,
                  "citationCount": 4457,
                  "publicationTypes": "JournalArticle",
                  "abstract": "Theres Not an App for ThatOptimizing Human-Computer Interaction With Emerging TechnologiesAffect and Emotion in Human-Computer InteractionCross-disciplinary Advances in Human Computer InteractionInteraction DesignHuman-Computer InteractionInterdisciplinary Interaction DesignInteraction DesignAbout FaceDesigning the User InterfaceFuture Interaction DesignDesign for How People ThinkThoughtful Interaction DesignHuman-Computer Interaction. Interaction Design and UsabilityInteraction DesignDesigning Interactive SystemsInteraction DesignDesigning with BlendsFundamentals of Human-Computer InteractionDesigning InteractionsThe Encyclopaedia BritannicaInteraction DesignEncyclopedia of Human Computer InteractionBeing HumanINTERACTION DESIGNInteraction DesignHuman-Computer Interaction. Design and User Experience Case StudiesHuman-Computer InteractionInternationalization, Design and Global DevelopmentResearch Methods in Human-Computer InteractionHuman-Computer InteractionDesigning User ExperienceThe Materiality of InteractionHCI TheoryThe UX BookInteraction Design: Beyond Human-Computer Interaction, 2Nd EdHuman-Computer Interaction and Beyond: Advances Towards Smart and Interconnected Environments (Part I)Learn Human-Computer InteractionEnhancing Learning Through Human Computer InteractionHuman-Computer Interaction. Design and User Experience Case Studies",
                  "journal": "none",
                  "title": "Interaction design: beyond human-computer interaction",
                  "tldr": "Theres Not an App for ThatOptimizing Human-Computer Interaction With Emerging TechnologiesCross-disciplinary Advances in Human Computer InteractionInteraction Design human-computer Interaction interdisciplinary Interaction Design interaction designAbout FaceDesigning the User InterfaceFuture InteractiondesignDesign for How People ThinkThoughtful Interaction design human-Computer interaction.",
                  "url": "https://www.semanticscholar.org/paper/bf79183344c7bb01205aa07798cd1080f48e70f6",
                  "venue": "UBIQ",
                  "authors": "_145624592",
                  "publicationDate": "2002-03-01"
            },
            {
                  "layer": 1,
                  "paperId": "16745a8d0f353337a212e8a71405b0c4de32959e",
                  "year": 2000,
                  "citationCount": 550,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 33,
                  "abstract": "Field research methods are useful in the many aspects of Human-Computer Interaction research, including gathering user requirements, understanding and developing user models, and new product evaluation and iterative design. Due to increasingly short product realization cycles, there has been growing interestth in more time efficient methods, including rapid prototyping methods and various usability inspection techniques. This paper will introduce rapid ethnography, which is a collection of field methods intended to provide a reasonable understanding of users and their activities given significant time pressures and limited time in the field.. The core elements include limiting or constraining the research focus and scope, using key informants, capturing rich field data by using multiple observers and interactive observation techniques, and collaborative qualitative data analysis. A short case study illustrating the important characteristics of rapid ethnography will also be presented.",
                  "journal": "none",
                  "title": "Rapid ethnography: time deepening strategies for HCI field research",
                  "tldr": "This paper will introduce rapid ethnography, which is a collection of field methods intended to provide a reasonable understanding of users and their activities given significant time pressures and limited time in the field.",
                  "url": "https://www.semanticscholar.org/paper/16745a8d0f353337a212e8a71405b0c4de32959e",
                  "venue": "Symposium on Designing Interactive Systems",
                  "authors": "_2673368",
                  "publicationDate": "2000-08-01"
            },
            {
                  "layer": 1,
                  "paperId": "631b8ecb91442fecb78cb12f620cbe38d981eac8",
                  "year": 2000,
                  "citationCount": 820,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 31,
                  "abstract": "A multiple view system uses two or more distinct views to support the investigation of a single conceptual entity. Many such systems exist, ranging from computer-aided design (CAD) systems for chip design that display both the logical structure and the actual geometry of the integrated circuit to overview-plus-detail systems that show both an overview for context and a zoomed-in-view for detail. Designers of these systems must make a variety of design decisions, ranging from determining layout to constructing sophisticated coordination mechanisms. Surprisingly, little work has been done to characterize these systems or to express guidelines for their design. Based on a workshop discussion of multiple views, and based on our own design and implementation experience with these systems, we present eight guidelines for the design of multiple view systems.",
                  "journal": "none",
                  "title": "Guidelines for using multiple views in information visualization",
                  "tldr": "Based on a workshop discussion of multiple views, and based on the authors own design and implementation experience with these systems, eight guidelines for the design of multiple view systems are presented.",
                  "url": "https://www.semanticscholar.org/paper/631b8ecb91442fecb78cb12f620cbe38d981eac8",
                  "venue": "International Working Conference on Advanced Visual Interfaces",
                  "authors": "_1868844_123531930_3288397",
                  "publicationDate": "2000-05-01"
            },
            {
                  "layer": 1,
                  "paperId": "b989b192be547648594e5d7f8474f6da99ca4840",
                  "year": 2000,
                  "citationCount": 4223,
                  "abstract": "Most designers know that yellow text presented against a blue background reads clearly and easily, but how many can explain why, and what really are the best ways to help others and ourselves clearly see key patterns in a bunch of data? When we use software, access a website, or view business or scientific graphics, our understanding is greatly enhanced or impeded by the way the information is presented.  This book explores the art and science of why we see objects the way we do. Based on the science of perception and vision, the author presents the key principles at work for a wide range of applications--resulting in visualization of improved clarity, utility, and persuasiveness. The book offers practical guidelines that can be applied by anyone: interaction designers, graphic designers of all kinds (including web designers), data miners, and financial analysts.    Complete update of the recognized source in industry, research, and academic for applicable guidance on information visualizing.  Includes the latest research and state of the art information on multimedia presentation.  More than 160 explicit design guidelines based on vision science.  A new final chapter that explains the process of visual thinking and how visualizations help us to think about problems.  Packed with over 400 informative full color illustrations, which are key to understanding of the subject.  Table of Contents   Chapter 1. Foundations for an Applied Science of Data Visualization  Chapter 2. The Environment, Optics, Resolution, and the Display  Chapter 3. Lightness, Brightness, Contrast and Constancy  Chapter 4. Color  Chapter 5. Visual Salience and Finding Information  Chapter 6. Static and Moving Patterns  Chapter 7. Space Perception  Chapter 8. Visual Objects and Data Objects  Chapter 9. Images, Narrative, and Gestures for Explanation  Chapter 10. Interacting with Visualizations  Chapter 11. Visual Thinking Processes",
                  "journal": "none",
                  "title": "Information Visualization: Perception for Design",
                  "tldr": "The art and science of why the authors see objects the way they do are explored, and the author presents the key principles at work for a wide range of applications--resulting in visualization of improved clarity, utility, and persuasiveness.",
                  "url": "https://www.semanticscholar.org/paper/b989b192be547648594e5d7f8474f6da99ca4840",
                  "authors": "_145457561",
                  "publicationDate": "2000-02-04"
            },
            {
                  "layer": 1,
                  "paperId": "0d0c27078aecc568823041d902316e6db546cf95",
                  "year": 2000,
                  "citationCount": 133,
                  "referenceCount": 146,
                  "abstract": "Many real-world domains can be represented as large node-link graphs: backbone Internet routers connect with 70,000 other hosts, mid-sized Web servers handle between 20,000 and 200,000 hyperlinked documents, and dictionaries contain millions of words defined in terms of each other. Computational manipulation of such large graphs is common, but previous tools for graph visualization have been limited to datasets of a few thousand nodes. Visual depictions of graphs and networks are external representations that exploit human visual processing to reduce the cognitive load of many tasks that require understanding of global or local structure. We assert that the two key advantages of computer-based systems for information visualization over traditional paper-based visual exposition are interactivity and scalability. We also argue that designing visualization software by taking the characteristics of a target users task domain into account leads to systems that are more effective and scale to larger datasets than previous work. This thesis contains a detailed analysis of three specialized systems for the interactive exploration of large graphs, relating the intended tasks to the spatial layout and visual encoding choices. We present two novel algorithms for specialized layout and drawing that use quite different visual metaphors. The H3 system for visualizing the hyperlink structures of web sites scales to datasets of over 100,000 nodes by using a carefully chosen spanning tree as the layout backbone, 3D hyperbolic geometry for a Focus+Context view, and provides a fluid interactive experience through guaranteed frame rate drawing. The Constellation system features a highly specialized 2D layout intended to spatially encode domain-specific information for computational linguists checking the plausibility of a large semantic network created from dictionaries. The Planet Multicast system for displaying the tunnel topology of the Internets multicast backbone provides a literal 3D geographic layout of arcs on a globe to help MBone maintainers find misconfigured long-distance tunnels. Each of these three systems provides a very different view of the graph structure, and we evaluate their efficacy for the intended task. We generalize these findings in our analysis of the importance of interactivity and specialization for graph visualization systems that are effective and scalable.",
                  "journal": "none",
                  "title": "Interactive visualization of large graphs and networks",
                  "tldr": "It is asserted that the two key advantages of computer-based systems for information visualization over traditional paper-based visual exposition are interactivity and scalability and that designing visualization software by taking the characteristics of a target users task domain leads to systems that are more effective and scale to larger datasets than previous work.",
                  "url": "https://www.semanticscholar.org/paper/0d0c27078aecc568823041d902316e6db546cf95",
                  "authors": "_1732016"
            },
            {
                  "layer": 1,
                  "paperId": "f2c80eef3585e0569e93ace0b9770cf76c8ebabc",
                  "year": 1999,
                  "citationCount": 5396,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 65,
                  "abstract": "People tend to hold overly favorable views of their abilities in many social and intellectual domains. The authors suggest that this overestimation occurs, in part, because people who are unskilled in these domains suffer a dual burden: Not only do these people reach erroneous conclusions and make unfortunate choices, but their incompetence robs them of the metacognitive ability to realize it. Across 4 studies, the authors found that participants scoring in the bottom quartile on tests of humor, grammar, and logic grossly overestimated their test performance and ability. Although their test scores put them in the 12th percentile, they estimated themselves to be in the 62nd. Several analyses linked this miscalibration to deficits in metacognitive skill, or the capacity to distinguish accuracy from error. Paradoxically, improving the skills of participants, and thus increasing their metacognitive competence, helped them recognize the limitations of their abilities.",
                  "journal": "none",
                  "title": "Unskilled and unaware of it: how difficulties in recognizing ones own incompetence lead to inflated self-assessments.",
                  "tldr": "Across 4 studies, the authors found that participants scoring in the bottom quartile on tests of humor, grammar, and logic grossly overestimated their test performance and ability.",
                  "url": "https://www.semanticscholar.org/paper/f2c80eef3585e0569e93ace0b9770cf76c8ebabc",
                  "venue": "Journal of Personality and Social Psychology",
                  "authors": "_2071404894_103054059",
                  "publicationDate": "1999-11-30"
            },
            {
                  "layer": 1,
                  "paperId": "15af208227934b34ecf5dc99c6d2b6128d6271ad",
                  "year": 1999,
                  "citationCount": 36,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 14,
                  "abstract": "Constellation is a visualization system for the results of queries from the MindNet natural language semantic network. Constellation is targeted at helping MindNets creators and users refine their algorithms, as opposed to understanding the structure of language. We designed a special-purpose graph layout algorithm which exploits higher-level structure in addition to the basic node and edge connectivity. Our layout prioritizes the creation of a semantic space to encode plausibility instead of traditional graph drawing metrics like minimizing edge crossings. We make careful use of several perceptual channels both to minimize the visual impact of edge crossings and to emphasize highlighted constellations of nodes and edges.",
                  "journal": "none",
                  "title": "Constellation: a visualization tool for linguistic queries from MindNet",
                  "tldr": "A special-purpose graph layout algorithm which exploits higher-level structure in addition to the basic node and edge connectivity, which prioritizes the creation of a semantic space to encode plausibility instead of traditional graph drawing metrics like minimizing edge crossings.",
                  "url": "https://www.semanticscholar.org/paper/15af208227934b34ecf5dc99c6d2b6128d6271ad",
                  "venue": "IEEE Information Visualization Conference",
                  "authors": "_1732016_2539134_1699184",
                  "publicationDate": "1999-10-24"
            },
            {
                  "layer": 1,
                  "paperId": "a8bf7029f2c6282b7cec5f90c0a246abbfd0aba4",
                  "year": 1998,
                  "citationCount": 10844,
                  "referenceCount": 6,
                  "abstract": "Preface..1 Introduction: the research process..2 Positivism: the march of science..3 Constructionism: the making of meaning..4 Interpretivism: for and against culture..5 Interpretivism: the way of hermeneutics..6 Critical inquiry: the Marxist heritage..7 Critical inquiry: contemporary critics and contemporary critique..8 Feminism: re-visioning the man-made world..9 Postmodernism: crisis of confidence or moment of truth?..10 Conclusion..Notes..Bibliography..Index",
                  "journal": "none",
                  "title": "The Foundations of Social Research: Meaning and Perspective in the Research Process",
                  "url": "https://www.semanticscholar.org/paper/a8bf7029f2c6282b7cec5f90c0a246abbfd0aba4",
                  "authors": "_101412702"
            },
            {
                  "layer": 1,
                  "paperId": "57a045404334ee367a4d13be4ef6baa2bfad764b",
                  "year": 1997,
                  "citationCount": 141,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 12,
                  "abstract": "Despite the growing number of ethnographic studies of work their use in design remains a matter of some debate. Acknowledging the problems designers face in utiiising ethnographies, and etlmographers face in meeting commercial demands, this paper outlines a framework for the presentation of fieldstudies organised around three main dimensions; distributed coordination, plans and procedures and awareness of work; thereby facilitating effective communication and collaboration between designers and ethnographers.",
                  "journal": "none",
                  "title": "Designing with ethnography: a presentation framework for design",
                  "tldr": "A framework for the presentation of fieldstudies organised around three main dimensions; distributed coordination, plans and procedures and awareness of work is outlined, thereby facilitating effective communication and collaboration between designers and ethnographers.",
                  "url": "https://www.semanticscholar.org/paper/57a045404334ee367a4d13be4ef6baa2bfad764b",
                  "venue": "Symposium on Designing Interactive Systems",
                  "authors": "_144426202_1402693446_145282573_2089073_3225556",
                  "publicationDate": "1997-08-01"
            },
            {
                  "layer": 1,
                  "paperId": "8f5cad134d44f04bbcf4e0e9204f0c2156bf5e6b",
                  "year": 1997,
                  "citationCount": 3203,
                  "referenceCount": 61,
                  "abstract": "This book introduces a customer-centered approach to business by showing how data gathered from people while they work can drive the definition of a product or process while supporting the needs of teams and their organizations. This is a practical, hands-on guide for anyone trying to design systems that reflect the way customers want to do their work. The authors developed Contextual Design, the method discussed here, through their work with teams struggling to design products and internal systems. In this book, youll find the underlying principles of the method and how to apply them to different problems, constraints, and organizational situations.  Contextual Design enables you to + gather detailed data about how people work and use systems + develop a coherent picture of a whole customer population + generate systems designs from a knowledge of customer work + diagram a set of existing systems, showing their relationships, inconsistencies, redundancies, and omissions  Table of Contents  Chapter 1 Introduction Chapter 2 Gathering Customer Data Chapter 3 Principles of Contextual Inquiry Chapter 4 Contextual Inquiry in Practice Chapter 5 A Language of Work Chapter 6 Work Models Chapter 7 The Interpretation Session Chapter 8 Consolidation Chapter 9 Creating One View of the Customer Chapter 10 Communicating to the Organization Chapter 11 Work Redesign Chapter 12 Using Data to Drive Design Chapter 13 Design from Data Chapter 14 System Design Chapter 15 The User Environment Design Chapter 16 Project Planning and Strategy Chapter 17 Prototyping as a Design Tool Chapter 18 From Structure to User Interface Chapter 19 Iterating with a Prototype Chapter 20 Putting It into Practice",
                  "journal": "none",
                  "title": "Contextual design - defining customer-centered systems",
                  "tldr": "This book introduces a customer-centered approach to business by showing how data gathered from people while they work can drive the definition of a product or process while supporting the needs of teams and their organizations.",
                  "url": "https://www.semanticscholar.org/paper/8f5cad134d44f04bbcf4e0e9204f0c2156bf5e6b",
                  "authors": "_3083365_2691746",
                  "publicationDate": "1997-07-01"
            },
            {
                  "layer": 1,
                  "paperId": "0ecd7a7434819715b2cbe00b5e22c16b20ada6b5",
                  "year": 1996,
                  "citationCount": 98,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 7,
                  "abstract": "We present a case study of visualizing the global topology of the Internet MBone. The MBone is the Internets multicast backbone. Multicast is the most efficient way of distributing data from one sender to multiple receivers with minimal packet duplication. Developed and initially deployed by researchers within the Internet community, the MBone has been extremely popular for efficient transmission across the Internet of real-time video and audio streams such as conferences, meetings, congressional sessions, and NASA shuttle launches. The MBone, like the Internet itself grew exponentially with no central authority. The resulting suboptimal topology is of growing concern to network providers and the multicast research community. We create a geographic representation of the tunnel structure as arcs on a globe by resolving the latitude and longitude of MBone routers. The interactive 3D maps permit an immediate understanding of the global structure unavailable from the data in its original form as lines of text with only hostnames and IP addresses. Data visualization techniques such as grouping and thresholding allow further analysis of specific aspects of the MBone topology. We distribute the interactive 3D maps through the World-Wide Web using the VRML file format thus allowing network maintainers throughout the world to analyze the structure move effectively than would be possible with still pictures or pre-made videos.",
                  "journal": "none",
                  "title": "Visualizing the global topology of the MBone",
                  "tldr": "A geographic representation of the tunnel structure as arcs on a globe is created by resolving the latitude and longitude of MBone routers and distributed through the World-Wide Web using the VRML file format thus allowing network maintainers throughout the world to analyze the structure move effectively than would be possible with still pictures or pre-made videos.",
                  "url": "https://www.semanticscholar.org/paper/0ecd7a7434819715b2cbe00b5e22c16b20ada6b5",
                  "venue": "Proceedings IEEE Symposium on Information Visualization 96",
                  "authors": "_1732016_2052863582_10179735_2194815",
                  "publicationDate": "1996-10-28"
            },
            {
                  "layer": 1,
                  "paperId": "058e2e38420b61d8d870590d971d4e7d1cd078c2",
                  "year": 1996,
                  "citationCount": 204,
                  "referenceCount": 11,
                  "abstract": "How data are represented visually has a powerful effect on how the structure in those data is perceived. For example, in Figure 1, four representations of an MRI scan of a human head are shown. The only difference between these images is the mapping of color to data values, yet, the four representations look very different. Furthermore, the inferences an analyst would draw from these representations would vary considerably. That is, variations in the method of representing the data can significantly influence the users perception and interpretation of the data. How NOT to Lie with Visualization http://www.research.ibm.com/dx/proceedings/pravda/truevis.htm",
                  "journal": "none",
                  "title": "How not to lie with visualization",
                  "tldr": "Variations in the method of representing the data can significantly influence the users perception and interpretation of the data.",
                  "url": "https://www.semanticscholar.org/paper/058e2e38420b61d8d870590d971d4e7d1cd078c2",
                  "authors": "_3112585_1687140_144716899",
                  "publicationDate": "1996-06-01"
            },
            {
                  "layer": 1,
                  "paperId": "516028c46eb88b524f2d64ce8637b756a332cbf9",
                  "year": 1994,
                  "citationCount": 710,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 50,
                  "abstract": "Ethnography has gained considerable prominence as a technique for informing CSCW systems development of the nature of work. Experiences of ethnography reported to date have focused on the use of prolonged on-going enthnography to inform systems design. A considerable number of these studies have taken place within constrained and focused work domain. This paper reflects more generally on the experiences of using ethnography across a number of different projects and in a variety of domains of study. We identify a number of ways in which we have used ethnography to inform design and consider the benefits and problems of each.",
                  "journal": "none",
                  "title": "Moving out from the control room: ethnography in system design",
                  "tldr": "A number of ways in which ethnography has been used to inform design are identified and the benefits and problems of each are considered.",
                  "url": "https://www.semanticscholar.org/paper/516028c46eb88b524f2d64ce8637b756a332cbf9",
                  "venue": "Conference on Computer Supported Cooperative Work",
                  "authors": "_144426202_31459595_145282573_2068824154",
                  "publicationDate": "1994-10-22"
            },
            {
                  "layer": 1,
                  "paperId": "d9aee15a9c8422df84d0bef2d182e44ef766277d",
                  "year": 1994,
                  "citationCount": 5507,
                  "journal": "none",
                  "title": "Writing: A method of inquiry.",
                  "url": "https://www.semanticscholar.org/paper/d9aee15a9c8422df84d0bef2d182e44ef766277d",
                  "authors": "_33536203_88064794"
            },
            {
                  "layer": 1,
                  "paperId": "fcad136957270b779d6f058eb7d9dd56f87f138d",
                  "year": 1994,
                  "citationCount": 466,
                  "referenceCount": 38,
                  "abstract": "When asking how many usability specialists it takes to change a light bulb, the answer might well be four: Two to conduct a field study and task analysis to determine whether people really need light, one to observe the user who actually screws in the light bulb, and one to control the video camera filming the event. It is certainly true that one should study user needs before implementing supposed solutions to those problems. Even so, the perception that anybody touching usability will come down with a bad case of budget overruns is keeping many software projects from achieving the level of usability their users deserve.",
                  "journal": "none",
                  "title": "Guerrilla HCI: using discount usability engineering to penetrate the intimidation barrier",
                  "tldr": "The perception that anybody touching usability will come down with a bad case of budget overruns is keeping many software projects from achieving the level of usability their users deserve.",
                  "url": "https://www.semanticscholar.org/paper/fcad136957270b779d6f058eb7d9dd56f87f138d",
                  "authors": "_145414906"
            },
            {
                  "layer": 1,
                  "paperId": "20163950cf24bb799bed89fdf725585a18dc5920",
                  "year": 1990,
                  "citationCount": 1017,
                  "journal": "none",
                  "title": "Ethnography: Step By Step",
                  "url": "https://www.semanticscholar.org/paper/20163950cf24bb799bed89fdf725585a18dc5920",
                  "authors": "_145786373",
                  "publicationDate": "1990-07-01"
            },
            {
                  "layer": 1,
                  "paperId": "4016c3516275a0b301259f086414e60474e3e406",
                  "year": 1990,
                  "citationCount": 1992,
                  "publicationTypes": "Review",
                  "abstract": "PART I 1. Introduction Writing Versus Ought-to-be-Writing Looking Ahead Jump Start 2. Getting Going How to Begin Following a Writing Plan When to Begin Where to Begin Analysis and Interpretation The Problem of Focus Problems of Sorting and Organizing Data Recap Putting Ideas to Test 3. Keeping Going Stay With It The Expanding Hanging File Approach Keeping Up the Momentum When Its Time for Details, Get Them Right the First Time Keeping Track of References Keeping Track of Bits and Pieces Getting Feedback Checklist 4. Linking Up The Lit Review Making the Link to Theory Linking Up Through Method Research Techniques in Qualitative Inquiry Finding Ways to Represent Qualitative Approaches Graphically Conceptualizing Qualitative Approaches as a Tree Method, Your (Data Collection) Methods, and Methodology Method or Theory as Narrative Summary Forging Links Applications PART II 5. Tightening Up Reviewing for Content and Style Revising and Editing Honing Your Editorial Skills Formal Editorial Skills How Do You Conclude a Qualitative Study? Alternatives to Concluding a Study Running out of Space Crowding More In Cutting More Out In Short 6. Finishing Up Title The Front Matter The Body of the Text The Back Matter End Game 7. Getting Published Alternative Ways to Get Into Print On Not Getting Published Final Thoughts References and Select Bibliography Name Index Subject Index About the Author/About the Book",
                  "journal": "none",
                  "title": "Writing Up Qualitative Research",
                  "tldr": "This book discusses writing versus Ought-to-be-Writing, how to begin following a Writing Plan, and Alternatives to Concluding a Qualitative Study.",
                  "url": "https://www.semanticscholar.org/paper/4016c3516275a0b301259f086414e60474e3e406",
                  "authors": "_46474103"
            },
            {
                  "layer": 1,
                  "paperId": "ca7566005dad480b735e27beba6b798e4a25583b",
                  "year": 1988,
                  "citationCount": 6076,
                  "abstract": "Chapter 1. Anthropology and the Social Sciences Chapter 2. The Foundations of Social Research Chapter 3. Preparing for Research Chapter 4. Research Design: Experiments and Experimental Thinking Chapter 5. Sampling I: The Basics Chapter 6. Sampling II: Theory Chapter 7. Sampling III: Nonprobability Samples and Choosing Informants Chapter 8. Interviewing I: Unstructured and Semistructured Chapter 9. Interviewing II: Questionnaires Chapter 10. Interviewing III: Cultural Domains Chapter 11. Scales and Scaling Chapter 12. Participant Observation Chapter 13. Field Notes and Database Management Chapter 14. Direct and Indirect Observation Chapter 15. Introduction to Qualitative and Quantitative Analysis Chapter 16. Cognitive Anthropology I: Analyzing Cultural Domains Chapter 17. Cognitive Anthropology II: Decision Modeling, Taxonomies, and Componential Analysis Chapter 18. Text Analysis I: Interpretive Analysis, Narrative Analysis, Performance Analysis, and Conversation Analysis Chapter 19. Text Analysis II: Schema Analysis, Grounded Theory, Content Analysis, and Analytic Induction Chapter 20. Univariate Analysis Chapter 21. Bivariate Analysis Chapter 22. Multivariate Analysis",
                  "journal": "none",
                  "title": "Research Methods in Anthropology: Qualitative and Quantitative Approaches",
                  "tldr": "This book discusses the foundations of social research, as well as some of the techniques used in qualitative and quantitative analysis, which have been used in quantitative and Quantitative Analysis.",
                  "url": "https://www.semanticscholar.org/paper/ca7566005dad480b735e27beba6b798e4a25583b",
                  "authors": "_2013947833"
            },
            {
                  "layer": 1,
                  "paperId": "18c50dc7ca4b426828d4ec1e04e596bc10e0744f",
                  "year": 1983,
                  "citationCount": 135,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 29,
                  "abstract": "The effects of experimenters expectations on subjects responses in imagery paradigms were investigated by leading some experimenters to believe that performance based on the use of imagery would be superior to performance based on perception. Other experimenters were led to expect perceptual superiority. Three paradigms are tested. Experiment 1 considered imaginal and perceptual acuity as functions of the size and relative brightness of the stimulus patterns; Experiment 2 compared imaginal and perceptual scanning of maps; and Experiments 3 and 4 studied the identification of rotated hands after imaginal or perceptual priming. In all the experiments, subjects performances varied with the experimenters beliefs, suggesting that these paradigms are sensitive to subtle influences from experimenters tacit, unintentional cues. Experiment 4 probed the ability of observers to identify both tacit cues and the experimenters expectations. The observers accurately assigned the experimenters beliefs but were unable to systematically detect distinguishing and differential characteristics of the experimenters presentations of the instructions. Analysis of taped transcriptions yielded some differences in temporal phrasing. Implications of these results are discussed.",
                  "journal": "none",
                  "title": "Imagery paradigms: how vulnerable are they to experimenters expectations?",
                  "tldr": "In all the experiments, subjects performances varied with the experimenters beliefs, suggesting that these paradigms are sensitive to subtle influences from experimenter tacit, unintentional cues.",
                  "url": "https://www.semanticscholar.org/paper/18c50dc7ca4b426828d4ec1e04e596bc10e0744f",
                  "venue": "Journal of Experimental Psychology: Human Perception and Performance",
                  "authors": "_1413767588",
                  "publicationDate": "1983-06-01"
            },
            {
                  "layer": 1,
                  "paperId": "d54a2327555b776309d9e5e7a1be21f70e653be4",
                  "year": 1980,
                  "citationCount": 4366,
                  "referenceCount": 80,
                  "journal": "none",
                  "title": "Verbal reports as data.",
                  "url": "https://www.semanticscholar.org/paper/d54a2327555b776309d9e5e7a1be21f70e653be4",
                  "authors": "_144006592_94059053",
                  "publicationDate": "1980-05-01"
            },
            {
                  "layer": 1,
                  "paperId": "855e2d9a955497c9f8c2526f39cdf9aa98666f38",
                  "year": 1999,
                  "citationCount": 259,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 17,
                  "abstract": "A new method is presented for the visualization of hierarchical information, such as directory structures and organization structures. Cushion treemaps inherit the elegance of standard treemaps: compact, space-filling displays of hierarchical information, based on recursive subdivision of a rectangular image space. Intuitive shading is used to provide insight in the hierarchical structure. During the subdivision, ridges are added per rectangle, which are rendered with a simple shading model. The result is a surface that consists of recursive cushions. The method is efficient, effective, easy to use and implement, and has a wide applicability.",
                  "journal": "none",
                  "title": "Cushion Treemaps: Visualization of Hierarchical Information",
                  "tldr": "A new method is presented for the visualization of hierarchical information, such as directory structures and organization structures, based on recursive subdivision of a rectangular image space, which consists of recursive cushions.",
                  "url": "https://www.semanticscholar.org/paper/855e2d9a955497c9f8c2526f39cdf9aa98666f38",
                  "venue": "IEEE Information Visualization Conference",
                  "authors": "_143693813_1685989",
                  "publicationDate": "1999-10-24"
            },
            {
                  "layer": 1,
                  "paperId": "a44d218e48693f7ddea0e82f6482ea1c157a4004",
                  "year": 2011,
                  "citationCount": 32,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 44,
                  "abstract": "Visualization applications routinely map quantitative attributes to color using color scales. Although color is an effective visualization channel, it is limited by both display hardware and the human visual system. We propose a new interaction technique that overcomes these limitations by dynamically optimizing color scales based on a set of sampling lenses. The technique inspects the lens contents in data space, optimizes the initial color scale, and then renders the contents of the lens to the screen using the modified color scale. We present two prototype implementations of this pipeline and describe several case studies involving both information visualization and image inspection applications. We validate our approach with two mutually linked and complementary user studies comparing the Color Lens with explicit contrast control for visual search.",
                  "journal": "none",
                  "title": "Color Lens: Adaptive Color Scale Optimization for Visual Exploration",
                  "tldr": "This work proposes a new interaction technique that overcomes limitations by dynamically optimizing color scales based on a set of sampling lenses by inspecting the lens contents in data space, optimizes the initial color scale, and then renders the contents of the lens to the screen using the modified color scale.",
                  "url": "https://www.semanticscholar.org/paper/a44d218e48693f7ddea0e82f6482ea1c157a4004",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1722415_3297322_144381703",
                  "publicationDate": "2011-06-01"
            },
            {
                  "layer": 1,
                  "paperId": "c1d68f9753a7541bd37bf0b1adeaef0ee3c4470b",
                  "year": 2008,
                  "citationCount": 324,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 23,
                  "abstract": "Graphs have been widely used to model relationships among data. For large graphs, excessive edge crossings make the display visually cluttered and thus difficult to explore. In this paper, we propose a novel geometry-based edge-clustering framework that can group edges into bundles to reduce the overall edge crossings. Our method uses a control mesh to guide the edge-clustering process; edge bundles can be formed by forcing all edges to pass through some control points on the mesh. The control mesh can be generated at different levels of detail either manually or automatically based on underlying graph patterns. Users can further interact with the edge-clustering results through several advanced visualization techniques such as color and opacity enhancement. Compared with other edge-clustering methods, our approach is intuitive, flexible, and efficient. The experiments on some large graphs demonstrate the effectiveness of our method.",
                  "journal": "none",
                  "title": "Geometry-Based Edge Clustering for Graph Visualization",
                  "tldr": "A novel geometry-based edge-clustering framework that can group edges into bundles to reduce the overall edge crossings is proposed, which is intuitive, flexible, and efficient.",
                  "url": "https://www.semanticscholar.org/paper/c1d68f9753a7541bd37bf0b1adeaef0ee3c4470b",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1684136_2157472628_145506027_9881377_48568427",
                  "publicationDate": "2008-11-01"
            }
      ]
}