{
      "papers": [
            {
                  "layer": 0,
                  "paperId": "5d5eb3ea5e9847ec3947f1afebc3706d3f440388",
                  "citationCount": 1,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 58,
                  "year": 2022,
                  "abstract": "Temporal networks can naturally model realworld complex phenomena such as contact networks, information dissemination and physical proximity. However, nodes and edges bear realtime coordinates, making it difficult to organize them into discrete timeslices, without a loss of temporal information due to projection. Eventbased dynamic graph drawing rejects the notion of a timeslice and allows each node and edge to retain its own realvalued time coordinate. While existing work has demonstrated clear advantages for this approach, they come at a running time cost. We investigate the problem of accelerating eventbased layout to make it more competitive with existing layout techniques. In this paper, we describe the design, implementation and experimental evaluation of MultiDynNoS, the first multilevel eventbased graph layout algorithm. We consider three operators for coarsening and placement, inspired by Walshaw, GRIP and FM3, which we couple with an eventbased graph drawing algorithm. We also propose two extensions to the core algorithm: AutoTau and Bend Transfer. We perform two experiments: first, we compare MultiDynNoS variants to existing stateoftheart dynamic graph layout approaches; second, we investigate the impact of each of the proposed algorithm extensions. MultiDynNoS proves to be competitive with existing approaches, and the proposed extensions achieve their design goals and contribute in opening new research directions.",
                  "journal": "",
                  "title": "Eventbased Dynamic Graph Drawing without the Agonizing Pain",
                  "tldr": "The design, implementation and experimental evaluation of MultiDynNoS, the first multilevel eventbased graph layout algorithm, are described and two extensions to the core algorithm are proposed: AutoTau and Bend Transfer.",
                  "url": "https://www.semanticscholar.org/paper/5d5eb3ea5e9847ec3947f1afebc3706d3f440388",
                  "venue": "Computer graphics forum (Print)",
                  "authors": "_34611540_1692521_2065552432",
                  "publicationDate": "2022-07-27"
            },
            {
                  "layer": 1,
                  "paperId": "a57728366f7a9f86d11ebc10b243e0909e7569cc",
                  "citationCount": 4,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 67,
                  "year": 2020,
                  "abstract": "Dynamic networks can be challenging to analyze visually, especially if they span a large time range during which new nodes and edges can appear and disappear. Although it is straightforward to provide interfaces for visualization that represent multiple states of the network (i.e., multiple timeslices) either simultaneously (e.g., through small multiples) or interactively (e.g., through interactive animation), these interfaces might not support tasks in which disjoint timeslices need to be compared. Since these tasks are key for understanding the dynamic aspects of the network, understanding which interactive visualizations best support these tasks is important. We present the results of a series of laboratory experiments comparing two traditional approaches (small multiples and interactive animation), with a more recent approach based on interactive timeslicing. The tasks were performed on a large display through a touch interface. Participants completed 24 trials of three tasks with all techniques. The results show that interactive timeslicing brings benefit when comparing distant points in time, but less benefits when analyzing contiguous intervals of time.",
                  "journal": "",
                  "title": "The Effectiveness of Interactive Visualization Techniques for Time Navigation of Dynamic Graphs on Large Displays",
                  "tldr": "The results show that interactive timeslicing brings benefit when comparing distant points in time, but less benefits when analyzing contiguous intervals of time.",
                  "url": "https://www.semanticscholar.org/paper/a57728366f7a9f86d11ebc10b243e0909e7569cc",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_2132498713_2065552432_2930601",
                  "publicationDate": "2020-08-28"
            },
            {
                  "layer": 1,
                  "paperId": "d5dbc19e7f148926e409786ddfcfd21684c47489",
                  "citationCount": 4,
                  "referenceCount": 41,
                  "year": 2021,
                  "abstract": "The timeslice is the predominant method for drawing and visualizing dynamic graphs. However, when nodes and edges have real coordinates along the time axis, it becomes difficult to organize them into discrete timeslices, without a loss of temporal information due to projection. Event-based dynamic graph drawing rejects the notion of a timeslice and allows each node and edge to have its own real-valued time coordinate. Nodes are represented as trajectories of adaptive complexity that are drawn directly in the three-dimensional space-time cube (2D + t). Existing work has demonstrated clear advantages for this approach, but these advantages come at a running time cost. In response to this scalability issue, we present MultiDynNoS, the first multilevel approach for event-based dynamic graph drawing. We consider three operators for coarsening and placement, inspired by Walshaw, GRIP, and FM3, which we couple with an event-based graph drawing algorithm. We evaluate our approach on a selection of real graphs, showing that it outperforms timeslice-based and existing event-based techniques.",
                  "journal": "",
                  "title": "A Multilevel Approach for Event-Based Dynamic Graph Drawing",
                  "tldr": "MultiDynNoS is presented, the first multilevel approach for event-based dynamic graph drawing, which considers three operators for coarsening and placement, inspired by Walshaw, GRIP, and FM3, and is evaluated on a selection of real graphs showing that it outperforms timeslice-based and existing event- based techniques.",
                  "url": "https://www.semanticscholar.org/paper/d5dbc19e7f148926e409786ddfcfd21684c47489",
                  "authors": "_34611540_1692521_2503181"
            },
            {
                  "layer": 1,
                  "paperId": "6a541e251aef5ba97c68a65bd377336a73a87750",
                  "citationCount": 15,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 76,
                  "year": 2020,
                  "abstract": "Dynamic graph drawing algorithms take as input a series of timeslices that standard, force-directed algorithms can exploit to compute a layout. However, often dynamic graphs are expressed as a series of events where the nodes and edges have real coordinates along the time dimension that are not confined to discrete timeslices. Current techniques for dynamic graph drawing impose a set of timeslices on this event-based data in order to draw the dynamic graph, but it is unclear how many timeslices should be selected: too many timeslices slows the computation of the layout, while too few timeslices obscures important temporal features, such as causality. To address these limitations, we introduce a novel model for drawing event-based dynamic graphs and the first dynamic graph drawing algorithm, DynNoSlice, that is capable of drawing dynamic graphs in this model. DynNoSlice is an offline, force-directed algorithm that draws event-based, dynamic graphs in the space-time cube (2D+time). We also present a method to extract representative small multiples from the space-time cube. To demonstrate the advantages of our approach, DynNoSlice is compared with state-of-the-art timeslicing methods using a metrics-based experiment. Finally, we present case studies of event-based dynamic data visualised with the new model and algorithm.",
                  "journal": "",
                  "title": "Event-Based Dynamic Graph Visualisation",
                  "tldr": "A novel model for drawing event-based dynamic graphs and the first dynamic graph drawing algorithm that is capable of drawing dynamic graphs in this model are introduced and compared with state-of-the-art timeslicing methods.",
                  "url": "https://www.semanticscholar.org/paper/6a541e251aef5ba97c68a65bd377336a73a87750",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_2124080_2065552432_9374807",
                  "publicationDate": "2020-07-01"
            },
            {
                  "layer": 1,
                  "paperId": "d00d41d206325b394ef6ce73c72e425d47aac375",
                  "citationCount": 9,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 22,
                  "year": 2020,
                  "abstract": "In many applications, membership of set elements changes over time. Since each element can be present in multiple sets, the sets also overlap. As a result, it becomes challenging to visualize the temporal change in set membership of elements across several timesteps while showing individual set intersections. We propose Set Streams, a visualization technique that represents changing set structures on a timeline as branching and merging streams. The streams encode the changing membership of elements with set intersections. A querybased selection mechanism supports a flexible comparison of selected groups of elements across the temporal evolution. The main timeline view is complemented with additional panels to provide details about the elements. While the proposed visualization is an applicationindependent visualization technique for dynamic sets, we demonstrate its effectiveness and applicability through three diverse application examples and expert feedback.",
                  "journal": "",
                  "title": "Set Streams: Visual Exploration of Dynamic Overlapping Sets",
                  "tldr": "This work proposes Set Streams, a visualization technique that represents changing set structures on a timeline as branching and merging streams that encode the changing membership of elements with set intersections.",
                  "url": "https://www.semanticscholar.org/paper/d00d41d206325b394ef6ce73c72e425d47aac375",
                  "venue": "Computer graphics forum (Print)",
                  "authors": "_2146851807_46905197",
                  "publicationDate": "2020-06-01"
            },
            {
                  "layer": 1,
                  "paperId": "5ebcc54f28edb7d04ae1ffd822b5dde4e1636e8c",
                  "citationCount": 9,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 39,
                  "year": 2019,
                  "journal": "",
                  "title": "HOTVis: Higher-Order Time-Aware Visualisation of Dynamic Graphs",
                  "tldr": "A novel dynamic graph visualisation algorithm that utilises higher-order graphical models of causal paths in time series data to compute time-aware static graph visualisations that combine the simplicity and interpretability of static graphs with a time- aware layout algorithm that highlights patterns in the causal topology that result from the temporal dynamics of edges.",
                  "url": "https://www.semanticscholar.org/paper/5ebcc54f28edb7d04ae1ffd822b5dde4e1636e8c",
                  "venue": "International Symposium Graph Drawing and Network Visualization",
                  "authors": "_1835615_50790523",
                  "publicationDate": "2019-08-16"
            },
            {
                  "layer": 1,
                  "paperId": "92c4e97b67309b88b8e4deeac392c2f53be1f04b",
                  "citationCount": 15,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 38,
                  "year": 2019,
                  "abstract": "Uniform timeslicing of dynamic graphs has been used due to its convenience and uniformity across the time dimension. However, uniform timeslicing does not take the data set into account, which can generate cluttered timeslices with edge bursts and empty times-lices with few interactions. The graph mining filed has explored nonuniform timeslicing methods specifically designed to preserve graph features for mining tasks. In this paper, we propose a nonuniform timeslicing approach for dynamic graph visualization. Our goal is to create timeslices of equal visual complexity. To this end, we adapt histogram equalization to create timeslices with a similar number of events, balancing the visual complexity across timeslices and conveying more important details of timeslices with bursting edges. A case study has been conducted, in comparison with uniform timeslicing, to demonstrate the effectiveness of our approach.",
                  "journal": "",
                  "title": "Nonuniform Timeslicing of Dynamic Graphs Based on Visual Complexity",
                  "tldr": "This paper proposes a nonuniform timeslicing approach for dynamic graph visualization that adapts histogram equalization to create timeslices with a similar number of events, balancing the visual complexity across timeslice and conveying more important details of times Lices with bursting edges.",
                  "url": "https://www.semanticscholar.org/paper/92c4e97b67309b88b8e4deeac392c2f53be1f04b",
                  "venue": "Visual ..",
                  "authors": "_2153953618_2065552432_9124317_143670380_1684996712_145506027",
                  "publicationDate": "2019-07-28"
            },
            {
                  "layer": 1,
                  "paperId": "d584d87b5a4c51c4ec231c692421dd17dd1e64be",
                  "citationCount": 256,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 53,
                  "year": 2019,
                  "abstract": "Modeling sequential interactions between users and items/products is crucial in domains such as e-commerce, social networking, and education. Representation learning presents an attractive opportunity to model the dynamic evolution of users and items, where each user/item can be embedded in a Euclidean space and its evolution can be modeled by an embedding trajectory in this space. However, existing dynamic embedding methods generate embeddings only when users take actions and do not explicitly model the future trajectory of the user/item in the embedding space. Here we propose JODIE, a coupled recurrent neural network model that learns the embedding trajectories of users and items. JODIE employs two recurrent neural networks to update the embedding of a user and an item at every interaction. Crucially, JODIE also models the future embedding trajectory of a user/item. To this end, it introduces a novel projection operator that learns to estimate the embedding of the user at any time in the future. These estimated embeddings are then used to predict future user-item interactions. To make the method scalable, we develop a t-Batch algorithm that creates time-consistent batches and leads to 9x faster training. We conduct six experiments to validate JODIE on two prediction tasks---future interaction prediction and state change prediction---using four real-world datasets. We show that JODIE outperforms six state-of-the-art algorithms in these tasks by at least 20% in predicting future interactions and 12% in state change prediction.",
                  "journal": "",
                  "title": "Predicting Dynamic Embedding Trajectory in Temporal Interaction Networks",
                  "tldr": "JODIE is proposed, a coupled recurrent neural network model that learns the embedding trajectories of users and items that outperforms six state-of-the-art algorithms in predicting future interactions and 12% in state change prediction.",
                  "url": "https://www.semanticscholar.org/paper/d584d87b5a4c51c4ec231c692421dd17dd1e64be",
                  "venue": "Knowledge Discovery and Data Mining",
                  "authors": "_39703734_88342435_1702139",
                  "publicationDate": "2019-07-25"
            }
      ]
}