{
      "papers": [
            {
                  "paperId": "d132c90d28b8067a1e4026c5c86ac85a922bf95f",
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 62,
                  "year": 2022,
                  "abstract": "In social networks, individuals’ decisions are strongly influenced by recommendations from their friends, acquaintances, and favorite renowned personalities. The popularity of online social networking platforms makes them the prime venues to advertise products and promote opinions. The Influence Maximization (IM) problem entails selecting a seed set of users that maximizes the influence spread, i.e., the expected number of users positively influenced by a stochastic diffusion process triggered by the seeds. Engineering and analyzing IM algorithms remains a difficult and demanding task due to the NP-hardness of the problem and the stochastic nature of the diffusion processes. Despite several heuristics being introduced, they often fail in providing enough information on how the network topology affects the diffusion process, precious insights that could help researchers improve their seed set selection. In this paper, we present VAIM, a visual analytics system that supports users in analyzing, evaluating, and comparing information diffusion processes determined by different IM algorithms. Furthermore, VAIM provides useful insights that the analyst can use to modify the seed set of an IM algorithm, so to improve its influence spread. We assess our system by: (i)(i) a qualitative evaluation based on a guided experiment with two domain experts on two different data sets; (ii)(ii) a quantitative estimation of the value of the proposed visualization through the ICE-T methodology by Wall et al. (IEEE TVCG - 2018). The twofold assessment indicates that VAIM effectively supports our target users in the visual analysis of the performance of IM algorithms.",
                  "journal": "",
                  "title": "Influence Maximization With Visual Analytics",
                  "tldr": "VAIM is presented, a visual analytics system that supports users in analyzing, evaluating, and comparing information diffusion processes determined by different IM algorithms and provides useful insights that the analyst can use to modify the seed set of an IM algorithm, so to improve its influence spread.",
                  "url": "https://www.semanticscholar.org/paper/d132c90d28b8067a1e4026c5c86ac85a922bf95f",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_34611540_1713172_1716384_1692521_3291006",
                  "publicationDate": "2022-07-13"
            },
            {
                  "paperId": "4192a5dd9ad2e81e8e570c9ee6d64e1f6d573c7f",
                  "citationCount": 3,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 60,
                  "year": 2020,
                  "abstract": "Many real-world networks are globally sparse but locally dense. Typical examples are social networks, biological networks, and information networks. This double structural nature makes it difficult to adopt a homogeneous visualization model that clearly conveys both an overview of the network and the internal structure of its communities at the same time. As a consequence, the use of hybrid visualizations has been proposed. For instance, NodeTrix combines node-link and matrix-based representations (Henry et al., 2007). In this article we describe ChordLink, a hybrid visualization model that embeds chord diagrams, used to represent dense subgraphs, into a node-link diagram, which shows the global network structure. The visualization makes it possible to interactively highlight the structure of a community while keeping the rest of the layout stable. We discuss the intriguing algorithmic challenges behind the ChordLink model, present a prototype system that implements it, and illustrate case studies on real-world networks.",
                  "journal": "",
                  "title": "Hybrid Graph Visualizations With ChordLink: Algorithms, Experiments, and Applications",
                  "tldr": "ChordLink is described, a hybrid visualization model that embeds chord diagrams, used to represent dense subgraphs, into a node-link diagram, which shows the global network structure and makes it possible to interactively highlight the structure of a community while keeping the rest of the layout stable.",
                  "url": "https://www.semanticscholar.org/paper/4192a5dd9ad2e81e8e570c9ee6d64e1f6d573c7f",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1388409482_1713172_3291006_46194830_7539016",
                  "publicationDate": "2020-08-12"
            },
            {
                  "paperId": "e4061cc4301cb3779134c6c81cf0fed3287406df",
                  "citationCount": 6,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 66,
                  "year": 2020,
                  "journal": "",
                  "title": "On visualization techniques comparison for large social networks overview: A user experiment",
                  "tldr": "Jasper can be seen as an all-encompassing solution for quickly producing legible and compact overviews of large social networks on a single modern computer.",
                  "url": "https://www.semanticscholar.org/paper/e4061cc4301cb3779134c6c81cf0fed3287406df",
                  "venue": "Vis. Informatics",
                  "authors": "_2100834_48362356_2482136",
                  "publicationDate": "2020-12-01"
            },
            {
                  "paperId": "b43256127cd372563291b980a1862f7df8ecaba2",
                  "citationCount": 13,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 33,
                  "year": 2020,
                  "abstract": "Public health officials dealing with pandemics like COVID-19 have to evaluate and prepare response plans. This planning phase requires not only looking into the spatiotemporal dynamics and impact of the pandemic using simulation models, but they also need to plan and ensure the availability of resources under different spread scenarios. To this end, we have developed a visual analytics environment that enables public health officials to model, simulate, and explore the spread of COVID-19 by supplying county-level information such as population, demographics, and hospital beds. This environment facilitates users to explore spatiotemporal model simulation data relevant to COVID-19 through a geospatial map with linked statistical views, apply different decision measures at different points in time, and understand their potential impact. Users can drill-down to county-level details such as the number of sicknesses, deaths, needs for hospitalization, and variations in these statistics over time. We demonstrate the usefulness of this environment through a use case study and also provide feedback from domain experts. We also provide details about future extensions and potential applications of this work.",
                  "journal": "",
                  "title": "A Visual Analytics Based Decision Making Environment for COVID-19 Modeling and Visualization",
                  "tldr": "This work has developed a visual analytics environment that enables public health officials to model, simulate, and explore the spread of COVID-19 by supplying county-level information such as population, demographics, and hospital beds through a geospatial map with linked statistical views.",
                  "url": "https://www.semanticscholar.org/paper/b43256127cd372563291b980a1862f7df8ecaba2",
                  "venue": "Visual ..",
                  "authors": "_2194062_2635216_1400826283_145906801_1761518_48004695",
                  "publicationDate": "2020-10-01"
            },
            {
                  "paperId": "41acfad7b0136859c77687dcc43f801daeecc0f3",
                  "citationCount": 2,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 24,
                  "year": 2020,
                  "journal": "",
                  "title": "VAIM: Visual Analytics for Influence Maximization",
                  "tldr": "VAIM is a visual analytics system that supports users in analyzing the information diffusion process determined by different IM algorithms and can simulate the information spread for a given seed set on a large network and modify the seed sets to improve the corresponding influence spread.",
                  "url": "https://www.semanticscholar.org/paper/41acfad7b0136859c77687dcc43f801daeecc0f3",
                  "venue": "GD",
                  "authors": "_34611540_1713172_1716384_1692521_3291006",
                  "publicationDate": "2020-08-20"
            },
            {
                  "paperId": "22edc9d8bb18253cdbb7905492c73387b4aee8c4",
                  "citationCount": 25,
                  "referenceCount": 10,
                  "year": 2020,
                  "abstract": "The COVID-19 (formerly, 2019-nCoV) epidemic has become a global health emergency, as such, WHO declared PHEIC. China has taken the most hit since the outbreak of the virus, which could be dated as far back as late November by some experts. It was not until January 23rd that the Wuhan government finally recognized the severity of the epidemic and took a drastic measure to curtain the virus spread by closing down all transportation connecting the outside world. In this study, we seek to answer a few questions: How did the virus get spread from the epicenter Wuhan city to the rest of the country? To what extent did the measures, such as, city closure and community quarantine, help controlling the situation? More importantly, can we forecast any significant future development of the event had some of the conditions changed? By collecting and visualizing publicly available data, we first show patterns and characteristics of the epidemic development; we then employ a mathematical model of disease transmission dynamics to evaluate the effectiveness of some epidemic control measures, and more importantly, to offer a few tips on preventive measures.",
                  "journal": "",
                  "title": "Visual Data Analysis and Simulation Prediction for COVID-19",
                  "tldr": "This study seeks to answer a few questions about how did the virus get spread from the epicenter Wuhan city to the rest of the country, and to evaluate the effectiveness of some epidemic control measures.",
                  "url": "https://www.semanticscholar.org/paper/22edc9d8bb18253cdbb7905492c73387b4aee8c4",
                  "venue": "International Journal of Educational Excellence",
                  "authors": "_2028246830_23461814_1492178041_1492179598_150123444_1492178134_2145361446_4525094_144188146_2070017295",
                  "publicationDate": "2020-02-14"
            },
            {
                  "paperId": "240654fdb653a39a4d3f9f6035c3f832f1effe85",
                  "citationCount": 36,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 36,
                  "year": 2019,
                  "abstract": "Recently, an approach for determining the value of a visualization was proposed, one moving beyond simple measurements of task accuracy and speed. The value equation contains components for the time savings a visualization provides, the insights and insightful questions it spurs, the overall essence of the data it conveys, and the confidence about the data and its domain it inspires. This articulation of value is purely descriptive, however, providing no actionable method of assessing a visualizations value. In this work, we create a heuristic-based evaluation methodology to accompany the value equation for assessing interactive visualizations. We refer to the methodology colloquially as ICE-T, based on an anagram of the four value components. Our approach breaks the four components down into guidelines, each of which is made up of a small set of low-level heuristics. Evaluators who have knowledge of visualization design principles then assess the visualization with respect to the heuristics. We conducted an initial trial of the methodology on three interactive visualizations of the same data set, each evaluated by 15 visualization experts. We found that the methodology showed promise, obtaining consistent ratings across the three visualizations and mirroring judgments of the utility of the visualizations by instructors of the course in which they were developed.",
                  "journal": "",
                  "title": "A Heuristic Approach to Value-Driven Evaluation of Visualizations",
                  "tldr": "A heuristic-based evaluation methodology to accompany the value equation for assessing interactive visualizations showed promise, obtaining consistent ratings across the three visualizations and mirroring judgments of the utility of the visualizations by instructors of the course in which they were developed.",
                  "url": "https://www.semanticscholar.org/paper/240654fdb653a39a4d3f9f6035c3f832f1effe85",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_2065740541_144867797_34636768_3424845_34560661_3200296_1691661",
                  "publicationDate": "2019-01-01"
            },
            {
                  "paperId": "10672e13dfcec206a78170f2dedb80515f999c6a",
                  "citationCount": 28,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 57,
                  "year": 2016,
                  "journal": "",
                  "title": "A Distributed Multilevel Force-Directed Algorithm",
                  "tldr": "Multi-GiLA is presented, the first multilevel force-directed graph visualization algorithm based on a vertex-centric computation paradigm and experiments show that it can be successfully applied to compute high quality layouts of very large graphs on inexpensive cloud computing platforms.",
                  "url": "https://www.semanticscholar.org/paper/10672e13dfcec206a78170f2dedb80515f999c6a",
                  "venue": "IEEE Transactions on Parallel and Distributed Systems",
                  "authors": "_34611540_1713172_1716384_3291006",
                  "publicationDate": "2016-08-30"
            },
            {
                  "paperId": "de5e4c789209dfed61d427675e20ccf7362b9375",
                  "citationCount": 310,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 120,
                  "year": 2018,
                  "abstract": "Influence Maximization (IM), which selects a set of k  users (called seed set) from a social network to maximize the expected number of influenced users (called influence spread), is a key algorithmic problem in social influence analysis. Due to its immense application potential and enormous technical challenges, IM has been extensively studied in the past decade. In this paper, we survey and synthesize a wide spectrum of existing studies on IM from an algorithmic perspective, with a special focus on the following key aspects: (1) a review of well-accepted diffusion models that capture the information diffusion process and build the foundation of the IM problem, (2) a fine-grained taxonomy to classify existing IM algorithms based on their design objectives, (3) a rigorous theoretical comparison of existing IM algorithms, and (4) a comprehensive study on the applications of IM techniques in combining with novel context features of social networks such as topic, location, and time. Based on this analysis, we then outline the key challenges and research directions to expand the boundary of IM research.",
                  "journal": "",
                  "title": "Influence Maximization on Social Graphs: A Survey",
                  "tldr": "This paper surveys and synthesizes a wide spectrum of existing studies on IM from an algorithmic perspective, with a special focus on a review of well-accepted diffusion models that capture the information diffusion process and build the foundation of the IM problem.",
                  "url": "https://www.semanticscholar.org/paper/de5e4c789209dfed61d427675e20ccf7362b9375",
                  "venue": "IEEE Transactions on Knowledge and Data Engineering",
                  "authors": "_1823512389_1704755170_2220456_145472073",
                  "publicationDate": "2018-10-01"
            },
            {
                  "paperId": "33b742794fe949b6b48cfa38a3dd8709aabbec5c",
                  "citationCount": 44,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 163,
                  "year": 2018,
                  "journal": "",
                  "title": "Exploring the Limits of Complexity: A Survey of Empirical Studies on Graph Visualisation",
                  "tldr": "This paper surveys the literature on human-centred experiments to understand how, in practice, different features and characteristics of node–link diagrams affect visual complexity.",
                  "url": "https://www.semanticscholar.org/paper/33b742794fe949b6b48cfa38a3dd8709aabbec5c",
                  "venue": "Vis. Informatics",
                  "authors": "_2279094_2503181_1680836_145835767_2056819537_32489306_2702080",
                  "publicationDate": "2018-09-02"
            },
            {
                  "paperId": "2a4aa00b2598071327c2cfdecdbe1ff37c788862",
                  "citationCount": 6,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 44,
                  "year": 2018,
                  "abstract": "Graph visualization finds wide applications in different areas. As the popularity of social network sites is increasing, it becomes particularly useful in visual analysis of these sites. A number of algorithms for graph visualization have been developed over the past decades. The issue on how to design and develop algorithms by taking into account the characteristics of real graphs such as scale-free and hierarchical structures, however, has not been well addressed. In this paper, we extend the concept of a node degree to a node global degree for a node in a graph, and present an algorithm that computes their scores of all nodes. By taking advantage of the common structure features of real networks, two scalable extensions of this algorithm are further provided that are able to approximate computation results. Based on node global degrees, a filtering approach is presented to reduce the visual complexity of a layout. Extensive experiments have demonstrated the performance of the proposed algorithms in terms of two common evaluation metrics, as well as visualization results. In addition, we have implemented the algorithms in a prototype system, which enable users to explore a graph at continuous levels of details in real time, as evidenced by several real examples.",
                  "journal": "",
                  "title": "NGD: Filtering Graphs for Visual Analysis",
                  "tldr": "The concept of a node degree to a node global degree for a node in a graph is extended and an algorithm that computes their scores of all nodes is presented, and two scalable extensions of this algorithm are further provided that are able to approximate computation results.",
                  "url": "https://www.semanticscholar.org/paper/2a4aa00b2598071327c2cfdecdbe1ff37c788862",
                  "venue": "IEEE Transactions on Big Data",
                  "authors": "_1680567_2087543",
                  "publicationDate": "2018-09-01"
            },
            {
                  "paperId": "7ed053062375927eb82e4925168f98fea6bc69a0",
                  "citationCount": 210,
                  "publicationTypes": "Book",
                  "referenceCount": 38,
                  "year": 2018,
                  "abstract": "Rating platforms enable large-scale collection of user opinion about items(e.g., products or other users). However, untrustworthy users give fraudulent ratings for excessive monetary gains. In this paper, we present REV2, a system to identify such fraudulent users. We propose three interdependent intrinsic quality metrics---fairness of a user, reliability of a rating and goodness of a product. The fairness and reliability quantify the trustworthiness of a user and rating, respectively, and goodness quantifies the quality of a product. Intuitively, a user is fair if it provides reliable scores that are close to the goodness of products. We propose six axioms to establish the interdependency between the scores, and then, formulate a mutually recursive definition that satisfies these axioms. We extend the formulation to address cold start problem and incorporate behavior properties. We develop the REV2 algorithm to calculate these intrinsic quality scores for all users, ratings, and products. We show that this algorithm is guaranteed to converge and has linear time complexity. By conducting extensive experiments on five rating datasets, we show that REV2 outperforms nine existing algorithms in detecting fair and unfair users. We reported the 150 most unfair users in the Flipkart network to their review fraud investigators, and 127 users were identified as being fraudulent(84.6% accuracy). The REV2 algorithm is being deployed at Flipkart.",
                  "journal": "",
                  "title": "REV2: Fraudulent User Prediction in Rating Platforms",
                  "tldr": "The REV2 algorithm is developed, a system to identify fraudulent users and outperforms nine existing algorithms in detecting fair and unfair users and is guaranteed to converge and has linear time complexity.",
                  "url": "https://www.semanticscholar.org/paper/7ed053062375927eb82e4925168f98fea6bc69a0",
                  "venue": "Web Search and Data Mining",
                  "authors": "_39703734_2019961_31422745_2145201165_1702392_1728462",
                  "publicationDate": "2018-02-02"
            },
            {
                  "paperId": "a1a2c0161d1333a1be0dcfa2937449376241f1c5",
                  "citationCount": 17,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 56,
                  "year": 2017,
                  "abstract": "Rapid advancement of social media tremendously facilitates and accelerates the information diffusion among users around the world. How and to what extent will the information on social media achieve widespread diffusion across the world? How can we quantify the interaction between users from different geolocations in the diffusion process? How will the spatial patterns of information diffusion change over time? To address these questions, a dynamic social gravity model (SGM) is proposed to quantify the dynamic spatial interaction behavior among social media users in information diffusion. The dynamic SGM includes three factors that are theoretically significant to the spatial diffusion of information: geographic distance, cultural proximity, and linguistic similarity. Temporal dimension is also taken into account to help detect recency effect, and ground-truth data is integrated into the model to help measure the diffusion power. Furthermore, SocialWave, a visual analytic system, is developed to support both spatial and temporal investigative tasks. SocialWave provides a temporal visualization that allows users to quickly identify the overall temporal diffusion patterns, which reflect the spatial characteristics of the diffusion network. When a meaningful temporal pattern is identified, SocialWave utilizes a new occlusion-free spatial visualization, which integrates a node-link diagram into a circular cartogram for further analysis. Moreover, we propose a set of rich user interactions that enable in-depth, multi-faceted analysis of the diffusion on social media. The effectiveness and efficiency of the mathematical model and visualization system are evaluated with two datasets on social media, namely, Ebola Epidemics and Ferguson Unrest.",
                  "journal": "",
                  "title": "SocialWave: Visual Analysis of Spatio-temporal Diffusion of Information on Social Media",
                  "tldr": "A dynamic social gravity model (SGM) is proposed to quantify the dynamic spatial interaction behavior among social media users in information diffusion and a set of rich user interactions that enable in-depth, multi-faceted analysis of the diffusion on social media are proposed.",
                  "url": "https://www.semanticscholar.org/paper/a1a2c0161d1333a1be0dcfa2937449376241f1c5",
                  "venue": "ACM Trans. Intell. Syst. Technol.",
                  "authors": "_47333988_3717358_5672274_4487395_121962020",
                  "publicationDate": "2017-10-25"
            },
            {
                  "paperId": "cf264d43597699afc6541a27514a75e7e72bc151",
                  "citationCount": 48,
                  "publicationTypes": "Book",
                  "referenceCount": 52,
                  "year": 2017,
                  "journal": "",
                  "title": "NDlib: a python library to model and analyze diffusion processes over complex networks",
                  "tldr": "A simulation server that allows remote execution of experiments as well as an online visualization tool that abstracts its programmatic interface and makes available the simulation platform to non-technicians are designed.",
                  "url": "https://www.semanticscholar.org/paper/cf264d43597699afc6541a27514a75e7e72bc151",
                  "venue": "International Journal of Data Science and Analytics",
                  "authors": "_37340414_2650673_2120595_39496312_1693341_1685102",
                  "publicationDate": "2017-12-15"
            },
            {
                  "paperId": "26ad9a738a7e4876a4d244d07600a4f13873fba3",
                  "citationCount": 87,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 121,
                  "year": 2017,
                  "abstract": "With the development of social media (e.g. Twitter, Flickr, Foursquare, Sina Weibo, etc.), a large number of people are now using them and post microblogs, messages and multi‐media information. The everyday usage of social media results in big open social media data. The data offer fruitful information and reflect social behaviors of people. There is much visualization and visual analytics research on such data. We collect state‐of‐the‐art research and put it into three main categories: social network, spatial temporal information and text analysis. We further summarize the visual analytics pipeline for the social media, combining the above categories and supporting complex tasks. With these techniques, social media analytics can apply to multiple disciplines. We summarize the applications and public tools to further investigate the challenges and trends.",
                  "journal": "",
                  "title": "Social Media Visual Analytics",
                  "tldr": "The visual analytics pipeline for the social media is summarized, combining the above categories and supporting complex tasks and with these techniques, social media analytics can apply to multiple disciplines.",
                  "url": "https://www.semanticscholar.org/paper/26ad9a738a7e4876a4d244d07600a4f13873fba3",
                  "venue": "Computer graphics forum (Print)",
                  "authors": "_1685793922_2110872801_35141605",
                  "publicationDate": "2017-06-01"
            },
            {
                  "paperId": "8476714438669d5703690d4bbee9bfe751f61144",
                  "citationCount": 116,
                  "publicationTypes": "Book",
                  "referenceCount": 32,
                  "year": 2017,
                  "abstract": "Influence maximization (IM) on social networks is one of the most active areas of research in computer science. While various IM techniques proposed over the last decade have definitely enriched the field, unfortunately, experimental reports on existing techniques fall short in validity and integrity since many comparisons are not based on a common platform or merely discussed in theory. In this paper, we perform an in-depth benchmarking study of IM techniques on social networks. Specifically, we design a benchmarking platform, which enables us to evaluate and compare the existing techniques systematically and thoroughly under identical experimental conditions. Our benchmarking results analyze and diagnose the inherent deficiencies of the existing approaches and surface the open challenges in IM even after a decade of research. More fundamentally, we unearth and debunk a series of myths and establish that there is no single state-of-the-art technique in IM. At best, a technique is the state of the art in only one aspect.",
                  "journal": "",
                  "title": "Debunking the Myths of Influence Maximization: An In-Depth Benchmarking Study",
                  "tldr": "An in-depth benchmarking study of IM techniques on social networks is performed, which unearth and debunk a series of myths and establishes that there is no single state-of-the-art technique in IM.",
                  "url": "https://www.semanticscholar.org/paper/8476714438669d5703690d4bbee9bfe751f61144",
                  "venue": "SIGMOD Conference",
                  "authors": "_2644814_2663974_1699732",
                  "publicationDate": "2017-05-09"
            },
            {
                  "paperId": "d98d8573cd9a69e384e50ef87b97c0426c59add6",
                  "citationCount": 22,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 63,
                  "year": 2017,
                  "journal": "",
                  "title": "Large graph visualizations using a distributed computing platform",
                  "tldr": "This work designs, implements, and experiment a force-directed algorithm in Giraph, a popular open source framework for distributed computing, based on a vertex-centric design paradigm, and shows the scalability and effectiveness of the technique when compared to a centralized implementation of the same force- directed model.",
                  "url": "https://www.semanticscholar.org/paper/d98d8573cd9a69e384e50ef87b97c0426c59add6",
                  "venue": "Inf. Sci.",
                  "authors": "_34611540_1713172_1716384_3291006",
                  "publicationDate": "2017-03-01"
            },
            {
                  "paperId": "a40d9c6746609236acca6fa284360a1f8d40bd50",
                  "citationCount": 2,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 15,
                  "year": 2016,
                  "abstract": "In this paper, we propose SpreadViz, a web tool for exploration and visualization of spreading processes in social networks. SpreadViz consists of three main modules, namely graph exploration and analytics, detection of influential nodes, and interactive visualization. More precisely, SpreadViz offers the following functionalities: (i) It computes and visualizes various centrality criteria towards understanding how the position of a node in the network affects its spreading properties, (ii) It offers a wide range of criteria for the detection of single and multiple influential nodes and comparison among them, (iii) It effectively visualizes the spread of influence in the network as well as the performance of each method. In our demonstration, we invite the audience to interact with SpreadViz, exploring, analyzing, and visualizing the spreading processes over various real-world social networks. The tool is available online.",
                  "journal": "",
                  "title": "SpreadViz: Analytics and Visualization of Spreading Processes in Social Networks",
                  "tldr": "SpreadViz computes and visualizes various centrality criteria towards understanding how the position of a node in the network affects its spreading properties, and offers a wide range of criteria for the detection of single and multiple influential nodes and comparison among them.",
                  "url": "https://www.semanticscholar.org/paper/a40d9c6746609236acca6fa284360a1f8d40bd50",
                  "venue": "2016 IEEE 16th International Conference on Data Mining Workshops (ICDMW)",
                  "authors": "_2641961_2840531_2817467_1690383",
                  "publicationDate": "2016-12-01"
            },
            {
                  "paperId": "29d0f0556502566f1615ff347b5f568bce46063a",
                  "citationCount": 287,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 36,
                  "year": 2016,
                  "abstract": "Weighted signed networks (WSNs) are networks in which edges are labeled with positive and negative weights. WSNs can capture like/dislike, trust/distrust, and other social relationships between people. In this paper, we consider the problem of predicting the weights of edges in such networks. We propose two novel measures of node behavior: the goodness of a node intuitively captures how much this node is liked/trusted by other nodes, while the fairness of a node captures how fair the node is in rating other nodes likeability or trust level. We provide axioms that these two notions need to satisfy and show that past work does not meet these requirements for WSNs. We provide a mutually recursive definition of these two concepts and prove that they converge to a unique solution in linear time. We use the two measures to predict the edge weight in WSNs. Furthermore, we show that when compared against several individual algorithms from both the signed and unsigned social network literature, our fairness and goodness metrics almost always have the best predictive power. We then use these as features in different multiple regression models and show that we can predict edge weights on 2 Bitcoin WSNs, an Epinions WSN, 2 WSNs derived from Wikipedia, and a WSN derived from Twitter with more accurate results than past work. Moreover, fairness and goodness metrics form the most significant feature for prediction in most (but not all) cases.",
                  "journal": "",
                  "title": "Edge Weight Prediction in Weighted Signed Networks",
                  "tldr": "This paper proposes two novel measures of node behavior: the goodness of a node intuitively captures how much this node is liked/trusted by other nodes, while the fairness of a nodes captures how fair the node is in rating other nodes likeability or trust level.",
                  "url": "https://www.semanticscholar.org/paper/29d0f0556502566f1615ff347b5f568bce46063a",
                  "venue": "Industrial Conference on Data Mining",
                  "authors": "_39703734_1794160_1728462_1702392",
                  "publicationDate": "2016-12-01"
            },
            {
                  "paperId": "4bfcde0a32efcb828d7c2bef5494a40c9f87ceb4",
                  "citationCount": 40,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 54,
                  "year": 2016,
                  "abstract": "Popular social media platforms could rapidly propagate vital information over social networks among a significant number of people. In this work we present D-Map (Diffusion Map), a novel visualization method to support exploration and analysis of social behaviors during such information diffusion and propagation on typical social media through a map metaphor. In D-Map, users who participated in reposting (i.e., resending a message initially posted by others) one central users posts (i.e., a series of original tweets) are collected and mapped to a hexagonal grid based on their behavior similarities and in chronological order of the repostings. With additional interaction and linking, D-Map is capable of providing visual portraits of the influential users and describing their social behaviors. A comprehensive visual analysis system is developed to support interactive exploration with D-Map. We evaluate our work with real world social media data and find interesting patterns among users. Key players, important information diffusion paths, and interactions among social communities can be identified.",
                  "journal": "",
                  "title": "D-Map: Visual analysis of ego-centric information diffusion patterns in social media",
                  "tldr": "D-Map (Diffusion Map), a novel visualization method to support exploration and analysis of social behaviors during such information diffusion and propagation on typical social media through a map metaphor, is presented.",
                  "url": "https://www.semanticscholar.org/paper/4bfcde0a32efcb828d7c2bef5494a40c9f87ceb4",
                  "venue": "2016 IEEE Conference on Visual Analytics Science and Technology (VAST)",
                  "authors": "_1685793922_2110790589_2641720_2118672100_35141605_144313415_2145016394",
                  "publicationDate": "2016-10-01"
            },
            {
                  "paperId": "79d1c35d7a507cda78aa98bbf3b9e20e452eae0b",
                  "citationCount": 23,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 47,
                  "year": 2015,
                  "abstract": "The Epidemic Simulation System (EpiSimS) is a scalable, complex modeling tool for analyzing disease within the United States. Due to its high input dimensionality, time requirements, and resource constraints, simulating over the entire parameter space is unfeasible. One solution is to take a granular sampling of the input space and use simpler predictive models (emulators) in between. The quality of the implemented emulator depends on many factors: robustness, sophistication, configuration, and suitability to the input data. Visual analytics can be leveraged to provide guidance and understanding of these things to the user. In this paper, we have implemented a novel interface and workflow for emulator building and use. We introduce a workflow to build emulators, make predictions, and then analyze the results. Our prediction process first predicts temporal time series, and uses these to derive predicted spatial densities. Integrated into the EpiSimS framework, we target users who are non-experts at statistical modeling. This approach allows for a high level of analysis into the state of the built emulators and their resultant predictions. We present our workflow, models, the associated system, and evaluate the overall utility with feedback from EpiSimS scientists.",
                  "journal": "",
                  "title": "Integrating predictive analytics into a spatiotemporal epidemic simulation",
                  "tldr": "A workflow to build emulators, make predictions, and then analyze the results is introduced, which allows for a high level of analysis into the state of the built emulators and their resultant predictions.",
                  "url": "https://www.semanticscholar.org/paper/79d1c35d7a507cda78aa98bbf3b9e20e452eae0b",
                  "venue": "IEEE Conference on Visual Analytics Science and Technology",
                  "authors": "_143922308_2117921606_8412011_1707383",
                  "publicationDate": "2015-12-07"
            },
            {
                  "paperId": "6c6cd9bfc4db18c3b18b1f1d8b3de7b544717747",
                  "citationCount": 112,
                  "publicationTypes": "Book",
                  "referenceCount": 36,
                  "year": 2015,
                  "abstract": "Event sequence data analysis is common in many domains, including web and software development, transportation, and medical care. Few have investigated visualization techniques for comparative analysis of multiple event sequence datasets. Grounded in the real-world characteristics of web clickstream data, we explore visualization techniques for comparison of two clickstream datasets collected on different days or from users with different demographics. Through iterative design with web analysts, we designed MatrixWave, a matrix-based representation that allows analysts to get an overview of differences in traffic patterns and interactively explore paths through the website. We use color to encode differences and size to offer context over traffic volume. User feedback on MatrixWave is positive. Our study participants made fewer errors with MatrixWave and preferred it over the more familiar Sankey diagram.",
                  "journal": "",
                  "title": "MatrixWave: Visual Comparison of Event Sequence Data",
                  "tldr": "Grounded in the real-world characteristics of web clickstream data, MatrixWave is designed, a matrix-based representation that allows analysts to get an overview of differences in traffic patterns and interactively explore paths through the website.",
                  "url": "https://www.semanticscholar.org/paper/6c6cd9bfc4db18c3b18b1f1d8b3de7b544717747",
                  "venue": "International Conference on Human Factors in Computing Systems",
                  "authors": "_2143572915_1666598447_2875493_1747779_2109846360",
                  "publicationDate": "2015-04-18"
            },
            {
                  "paperId": "4498cef11b5f7ea37fe02c6b184e39bb08417c3f",
                  "citationCount": 24,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 45,
                  "year": 2015,
                  "abstract": "Numerous propagation models describing social influence in social networks can be found in the literature. This makes the choice of an appropriate model in a given situation difficult. Selecting the most relevant model requires the ability to objectively compare them. This comparison can only be made at the cost of describing models based on a common formalism and yet independent from them. We propose to use graph rewriting to formally describe propagation mechanisms as local transformation rules applied according to a strategy. This approach makes sense when it is supported by a visual analytics framework dedicated to graph rewriting. The paper first presents our methodology to describe some propagation models as a graph rewriting problem. Then, we illustrate how our visual analytics framework allows to interactively manipulate models, and underline their differences based on measures computed on simulation traces.",
                  "journal": "",
                  "title": "A Visual Analytics Approach to Compare Propagation Models in Social Networks",
                  "tldr": "The paper first presents the methodology to describe some propagation models as a graph rewriting problem, and illustrates how the visual analytics framework allows to interactively manipulate models, and underline their differences based on measures computed on simulation traces.",
                  "url": "https://www.semanticscholar.org/paper/4498cef11b5f7ea37fe02c6b184e39bb08417c3f",
                  "venue": "GaM",
                  "authors": "_48362356_145490472_2100834_2482136",
                  "publicationDate": "2015-04-10"
            },
            {
                  "paperId": "9d8937f13802ca1651271def0130733017d1be1d",
                  "citationCount": 5,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 11,
                  "year": 2014,
                  "abstract": "The paper presents Visual-VM, a social network visualization tool, where the main focus is to provide utilities for viral marketing (e.g., Influence maximization). Besides, Visual-VM utilizes the location information of each user (which could be estimated from the users profile) for social network visualization, which is not used in existing social network visualization tools. Visual-VM also supports common utilities for social network exploration.",
                  "journal": "",
                  "title": "Visual-VM: A Social Network Visualization Tool for Viral Marketing",
                  "tldr": "The paper presents Visual-VM, a social network visualization tool, where the main focus is to provide utilities for viral marketing (e.g., Influence maximization) and utilizes the location information of each user for social network visuals, which is not used in existing social network visualize tools.",
                  "url": "https://www.semanticscholar.org/paper/9d8937f13802ca1651271def0130733017d1be1d",
                  "venue": "2014 IEEE International Conference on Data Mining Workshop",
                  "authors": "_143671461_1723745",
                  "publicationDate": "2014-12-01"
            },
            {
                  "paperId": "bf10c7c8f4e8b47e498fc67de3ad7fdf60f2fe20",
                  "citationCount": 47,
                  "publicationTypes": "Book",
                  "referenceCount": 41,
                  "year": 2014,
                  "abstract": "Existing evaluations of data visualizations often employ a series of low-level, detailed questions to be answered or benchmark tasks to be performed. While that methodology can be helpful to determine a visualizations usability, such evaluations overlook the key benefits that visualization uniquely provides over other data analysis methods. I propose a value-driven evaluation of visualizations in which a person illustrates a systems value through four important capabilities: minimizing the time to answer diverse questions, spurring the generation of insights and insightful questions, conveying the essence of the data, and generating confidence and knowledge about the datas domain and context. Additionally, I explain how interaction is instrumental in creating much of the value that can be found in visualizations.",
                  "journal": "",
                  "title": "Value-driven evaluation of visualizations",
                  "tldr": "A value-driven evaluation of visualizations is proposed in which a person illustrates a systems value through four important capabilities: minimizing the time to answer diverse questions, spurring the generation of insights and insightful questions, conveying the essence of the data, and generating confidence and knowledge about the datas domain and context.",
                  "url": "https://www.semanticscholar.org/paper/bf10c7c8f4e8b47e498fc67de3ad7fdf60f2fe20",
                  "venue": "Workshop on Beyond Time and Errors: Novel Evaluation Methods for Visualization",
                  "authors": "_1691661",
                  "publicationDate": "2014-11-10"
            },
            {
                  "paperId": "471a4247ab306675e5150b527b784addd38497e1",
                  "citationCount": 162,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 48,
                  "year": 2014,
                  "abstract": "It is important for many different applications such as government and business intelligence to analyze and explore the diffusion of public opinions on social media. However, the rapid propagation and great diversity of public opinions on social media pose great challenges to effective analysis of opinion diffusion. In this paper, we introduce a visual analysis system called OpinionFlow to empower analysts to detect opinion propagation patterns and glean insights. Inspired by the information diffusion model and the theory of selective exposure, we develop an opinion diffusion model to approximate opinion propagation among Twitter users. Accordingly, we design an opinion flow visualization that combines a Sankey graph with a tailored density map in one view to visually convey diffusion of opinions among many users. A stacked tree is used to allow analysts to select topics of interest at different levels. The stacked tree is synchronized with the opinion flow visualization to help users examine and compare diffusion patterns across topics. Experiments and case studies on Twitter data demonstrate the effectiveness and usability of OpinionFlow.",
                  "journal": "",
                  "title": "OpinionFlow: Visual Analysis of Opinion Diffusion on Social Media",
                  "tldr": "An opinion diffusion model to approximate opinion propagation among Twitter users is developed and an opinion flow visualization that combines a Sankey graph with a tailored density map in one view to visually convey diffusion of opinions among many users is designed.",
                  "url": "https://www.semanticscholar.org/paper/471a4247ab306675e5150b527b784addd38497e1",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_121962020_48641970_2054997102_145823303_2397264",
                  "publicationDate": "2014-11-06"
            },
            {
                  "paperId": "0287be7421722b2fb940370b7bdcfabcd46f5367",
                  "citationCount": 156,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 45,
                  "year": 2014,
                  "abstract": "We present FluxFlow, an interactive visual analysis system for revealing and analyzing anomalous information spreading in social media. Everyday, millions of messages are created, commented, and shared by people on social media websites, such as Twitter and Facebook. This provides valuable data for researchers and practitioners in many application domains, such as marketing, to inform decision-making. Distilling valuable social signals from the huge crowds messages, however, is challenging, due to the heterogeneous and dynamic crowd behaviors. The challenge is rooted in data analysts capability of discerning the anomalous information behaviors, such as the spreading of rumors or misinformation, from the rest that are more conventional patterns, such as popular topics and newsworthy events, in a timely fashion. FluxFlow incorporates advanced machine learning algorithms to detect anomalies, and offers a set of novel visualization designs for presenting the detected threads for deeper analysis. We evaluated FluxFlow with real datasets containing the Twitter feeds captured during significant events such as Hurricane Sandy. Through quantitative measurements of the algorithmic performance and qualitative interviews with domain experts, the results show that the back-end anomaly detection model is effective in identifying anomalous retweeting threads, and its front-end interactive visualizations are intuitive and useful for analysts to discover insights in data and comprehend the underlying analytical model.",
                  "journal": "",
                  "title": "#FluxFlow: Visual Analysis of Anomalous Information Spreading on Social Media",
                  "tldr": "The results show that the back-end anomaly detection model is effective in identifying anomalous retweeting threads, and its front-end interactive visualizations are intuitive and useful for analysts to discover insights in data and comprehend the underlying analytical model.",
                  "url": "https://www.semanticscholar.org/paper/0287be7421722b2fb940370b7bdcfabcd46f5367",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_49530796_144313415_144136791_2157997410_34821764_144406618",
                  "publicationDate": "2014-11-06"
            },
            {
                  "paperId": "d6adbafb07c7a5590516404208fe8776f1363eb3",
                  "citationCount": 996,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 41,
                  "year": 2014,
                  "abstract": "In pursuit of graph processing performance, the systems community has largely abandoned general-purpose distributed dataflow frameworks in favor of specialized graph processing systems that provide tailored programming abstractions and accelerate the execution of iterative graph algorithms. In this paper we argue that many of the advantages of specialized graph processing systems can be recovered in a modern general-purpose distributed dataflow system. We introduce GraphX, an embedded graph processing framework built on top of Apache Spark, a widely used distributed dataflow system. GraphX presents a familiar composable graph abstraction that is sufficient to express existing graph APIs, yet can be implemented using only a few basic dataflow operators (e.g., join, map, group-by). To achieve performance parity with specialized graph systems, GraphX recasts graph-specific optimizations as distributed join optimizations and materialized view maintenance. By leveraging advances in distributed dataflow frameworks, GraphX brings low-cost fault tolerance to graph processing. We evaluate GraphX on real workloads and demonstrate that GraphX achieves an order of magnitude performance gain over the base dataflow framework and matches the performance of specialized graph processing systems while enabling a wider range of computation.",
                  "journal": "",
                  "title": "GraphX: Graph Processing in a Distributed Dataflow Framework",
                  "tldr": "This paper introduces GraphX, an embedded graph processing framework built on top of Apache Spark, a widely used distributed dataflow system and demonstrates that GraphX achieves an order of magnitude performance gain over the base dataflow framework and matches the performance of specialized graph processing systems while enabling a wider range of computation.",
                  "url": "https://www.semanticscholar.org/paper/d6adbafb07c7a5590516404208fe8776f1363eb3",
                  "venue": "USENIX Symposium on Operating Systems Design and Implementation",
                  "authors": "_49988044_2066641_2959744_50564124_143666627_144467753",
                  "publicationDate": "2014-10-06"
            },
            {
                  "paperId": "7f2c2a95d87611ea3ea40d44d1be9715e38438ee",
                  "citationCount": 134,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 19,
                  "year": 2014,
                  "journal": "",
                  "title": "A matter of time: Applying a data-users-tasks design triangle to visual analytics of time-oriented data",
                  "tldr": "A design triangle is proposed, which considers three main aspects to ease the design: the characteristics of the data, the users, and the users tasks, and provides a high-level framework, which is simple and very effective for the design process as well as easily applicable for both, researchers and practitioners.",
                  "url": "https://www.semanticscholar.org/paper/7f2c2a95d87611ea3ea40d44d1be9715e38438ee",
                  "venue": "Computers & graphics",
                  "authors": "_1692521_1696098",
                  "publicationDate": "2014-02-01"
            },
            {
                  "paperId": "023c3f90110f342de17a6e2a46ceddd7f8396ad7",
                  "citationCount": 22,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 33,
                  "year": 2013,
                  "journal": "",
                  "title": "Understanding the spread of malicious mobile-phone programs and their damage potential",
                  "tldr": "The findings lead to a better understanding on how one could prevent the spread of mobile-phone viruses even in light of new behaviors such as scanning and the results show that given sufficient time, sophisticated viruses may infect a large fraction of susceptible phones without being detected.",
                  "url": "https://www.semanticscholar.org/paper/023c3f90110f342de17a6e2a46ceddd7f8396ad7",
                  "venue": "International Journal of Information Security",
                  "authors": "_2108269004_38451395_145351935_1745069",
                  "publicationDate": "2013-06-01"
            },
            {
                  "paperId": "4a3df0c64d4e786c59334d4ea54c99b1808760a7",
                  "citationCount": 771,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 57,
                  "year": 2013,
                  "abstract": "Online social networks play a major role in the spread of information at very large scale. A lot of effort have been made in order to understand this phenomenon, ranging from popular topic detection to information diffusion modeling, including influential spreaders identification. In this article, we present a survey of representative methods dealing with these issues and propose a taxonomy that summarizes the state-of-the-art. The objective is to provide a comprehensive analysis and guide of existing efforts around information diffusion in social networks. This survey is intended to help researchers in quickly understanding existing works and possible improvements to bring.",
                  "journal": "",
                  "title": "Information diffusion in online social networks: a survey",
                  "tldr": "A survey of representative methods dealing with information diffusion in social networks and a taxonomy that summarizes the state-of-the-art is proposed, intended to help researchers in quickly understanding existing works and possible improvements to bring.",
                  "url": "https://www.semanticscholar.org/paper/4a3df0c64d4e786c59334d4ea54c99b1808760a7",
                  "venue": "SGMD",
                  "authors": "_1700578_1726350_2065394520_1678550",
                  "publicationDate": "2013-06-01"
            },
            {
                  "paperId": "1aca75eadea464667e1b68fa3250640c43df84f4",
                  "citationCount": 154,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 49,
                  "year": 2013,
                  "abstract": "The analysis of brain connectivity is a vast field in neuroscience with a frequent use of visual representations and an increasing need for visual analysis tools. Based on an in-depth literature review and interviews with neuroscientists, we explore high-level brain connectivity analysis tasks that need to be supported by dedicated visual analysis tools. A significant example of such a task is the comparison of different connectivity data in the form of weighted graphs. Several approaches have been suggested for graph comparison within information visualization, but the comparison of weighted graphs has not been addressed. We explored the design space of applicable visual representations and present augmented adjacency matrix and node-link visualizations. To assess which representation best support weighted graph comparison tasks, we performed a controlled experiment. Our findings suggest that matrices support these tasks well, outperforming node-link diagrams. These results have significant implications for the design of brain connectivity analysis tools that require weighted graph comparisons. They can also inform the design of visual analysis tools in other domains, e.g. comparison of weighted social networks or biological pathways.",
                  "journal": "",
                  "title": "Weighted graph comparison techniques for brain connectivity analysis",
                  "tldr": "The design space of applicable visual representations are explored and augmented adjacency matrix and node-link visualizations are presented to suggest that matrices support high-level brain connectivity analysis tasks well, outperforming node- link diagrams.",
                  "url": "https://www.semanticscholar.org/paper/1aca75eadea464667e1b68fa3250640c43df84f4",
                  "venue": "CHI",
                  "authors": "_2059343741_34564063_1692395_145322699_144381703",
                  "publicationDate": "2013-04-27"
            },
            {
                  "paperId": "1a5fe34a83e3b6f08b628b7af2d915876ba13819",
                  "citationCount": 163,
                  "referenceCount": 76,
                  "year": 2013,
                  "abstract": "University of Arizona 5.",
                  "journal": "",
                  "title": "Force-Directed Drawing Algorithms",
                  "url": "https://www.semanticscholar.org/paper/1a5fe34a83e3b6f08b628b7af2d915876ba13819",
                  "venue": "Handbook of Graph Drawing and Visualization",
                  "authors": "_9374807"
            },
            {
                  "paperId": "0e747a87e8700a25be06a354d3ad9e861f619403",
                  "citationCount": 159,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 51,
                  "year": 2012,
                  "abstract": "When and where is an idea dispersed? Social media, like Twitter, has been increasingly used for exchanging information, opinions and emotions about events that are happening across the world. Here we propose a novel visualization design, “Whisper”, for tracing the process of information diffusion in social media in real time. Our design highlights three major characteristics of diffusion processes in social media: the temporal trend, social-spatial extent, and community response of a topic of interest. Such social, spatiotemporal processes are conveyed based on a sunflower metaphor whose seeds are often dispersed far away. In Whisper, we summarize the collective responses of communities on a given topic based on how tweets were retweeted by groups of users, through representing the sentiments extracted from the tweets, and tracing the pathways of retweets on a spatial hierarchical layout. We use an efficient flux line-drawing algorithm to trace multiple pathways so the temporal and spatial patterns can be identified even for a bursty event. A focused diffusion series highlights key roles such as opinion leaders in the diffusion process. We demonstrate how our design facilitates the understanding of when and where a piece of information is dispersed and what are the social responses of the crowd, for large-scale events including political campaigns and natural disasters. Initial feedback from domain experts suggests promising use for todays information consumption and dispersion in the wild.",
                  "journal": "",
                  "title": "Whisper: Tracing the Spatiotemporal Process of Information Diffusion in Real Time",
                  "tldr": "In Whisper, the collective responses of communities on a given topic are summarized based on how tweets were retweeted by groups of users, through representing the sentiments extracted from the tweets, and tracing the pathways of retweets on a spatial hierarchical layout.",
                  "url": "https://www.semanticscholar.org/paper/0e747a87e8700a25be06a354d3ad9e861f619403",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_144313415_34821764_153520479_3185333_48641970_145506027",
                  "publicationDate": "2012-12-01"
            },
            {
                  "paperId": "bc831b68131939f7aedf7110543927ff8a4b6c0c",
                  "citationCount": 35,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 11,
                  "year": 2011,
                  "abstract": "Microblogs such as Twitter provide a valuable stream of diverse user-generated data. While the data extracted from Twitter is generally timely and accurate, the process by which developers extract structured data from the tweet stream is ad-hoc and requires reimplementation of common data manipulation primitives. In this paper, we present two systems for querying and extracting structure from Twitter-embedded data. The first, TweeQL, provides a streaming SQL-like interface to the Twitter API, making common tweet processing tasks simpler. The second, TwitInfo, shows how end-users can interact with and understand aggregated data from the tweet stream, in addition to showcasing the power of the TweeQL language. Together these systems show the richness of content that can be extracted from Twitter.",
                  "journal": "",
                  "title": "Processing and visualizing the data in tweets",
                  "tldr": "The first, TweeQL, provides a streaming SQL-like interface to the Twitter API, making common tweet processing tasks simpler, and the second, TwitInfo, shows how end-users can interact with and understand aggregated data from the tweet stream, in addition to showcasing the power of theTweeQL language.",
                  "url": "https://www.semanticscholar.org/paper/bc831b68131939f7aedf7110543927ff8a4b6c0c",
                  "venue": "SGMD",
                  "authors": "_145632757_145879842_2259673_1743286_144478906_152160465",
                  "publicationDate": "2011-12-01"
            },
            {
                  "paperId": "f5a0c5cdbcad1c59489e15045df128caa40a2d61",
                  "citationCount": 87,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 35,
                  "year": 2011,
                  "abstract": "In modeling infectious diseases, scientists are studying the mechanisms by which diseases spread, predicting the future course of the outbreak, and evaluating strategies applied to control an epidemic. While recent work has focused on accurately modeling disease spread, less work has been performed in developing interactive decision support tools for analyzing the future course of the outbreak and evaluating potential disease mitigation strategies. The absence of such tools makes it difficult for researchers, analysts and public health officials to evaluate response measures within outbreak scenarios. As such, our research focuses on the development of an interactive decision support environment in which users can explore epidemic models and their impact. This environment provides a spatiotemporal view where users can interactively utilize mitigative response measures and observe the impact of their decision over time. Our system also provides users with a linked decision history visualization and navigation tool that support the simultaneous comparison of mortality and infection rates corresponding to different response measures at different points in time.",
                  "journal": "",
                  "title": "Visual analytics decision support environment for epidemic modeling and response evaluation",
                  "tldr": "This research focuses on the development of an interactive decision support environment in which users can explore epidemic models and their impact and provides a spatiotemporal view where users can interactively utilize mitigative response measures and observe the impact of their decision over time.",
                  "url": "https://www.semanticscholar.org/paper/f5a0c5cdbcad1c59489e15045df128caa40a2d61",
                  "venue": "IEEE Conference on Visual Analytics Science and Technology",
                  "authors": "_2194062_1786514_33449182",
                  "publicationDate": "2011-12-15"
            },
            {
                  "paperId": "a5e3cf9f7bfdbc227673a6d8f4d59112f1b5bb3a",
                  "citationCount": 499,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 154,
                  "year": 2011,
                  "abstract": "Data analysis often involves the comparison of complex objects. With the ever increasing amounts and complexity of data, the demand for systems to help with these comparisons is also growing. Increasingly, information visualization tools support such comparisons explicitly, beyond simply allowing a viewer to examine each object individually. In this paper, we argue that the design of information visualizations of complex objects can, and should, be studied in general, that is independently of what those objects are. As a first step in developing this general understanding of comparison, we propose a general taxonomy of visual designs for comparison that groups designs into three basic categories, which can be combined. To clarify the taxonomy and validate its completeness, we provide a survey of work in information visualization related to comparison. Although we find a great diversity of systems and approaches, we see that all designs are assembled from the building blocks of juxtaposition, superposition and explicit encodings. This initial exploration shows the power of our model, and suggests future challenges in developing a general understanding of comparative visualization and facilitating the development of more comparative visualization tools.",
                  "journal": "",
                  "title": "Visual comparison for information visualization",
                  "tldr": "This paper proposes a general taxonomy of visual designs for comparison that groups designs into three basic categories, which can be combined, and provides a survey of work in information visualization related to comparison.",
                  "url": "https://www.semanticscholar.org/paper/a5e3cf9f7bfdbc227673a6d8f4d59112f1b5bb3a",
                  "venue": "Information Visualization",
                  "authors": "_1776507_38719815_145519872_2810989_144234812_1727068",
                  "publicationDate": "2011-10-01"
            },
            {
                  "paperId": "1cf2f8804eaa3050b6e8da58ed241eb490143f27",
                  "citationCount": 632,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 36,
                  "year": 2011,
                  "abstract": "Microblogs are a tremendous repository of user-generated content about world events. However, for people trying to understand events by querying services like Twitter, a chronological log of posts makes it very difficult to get a detailed understanding of an event. In this paper, we present TwitInfo, a system for visualizing and summarizing events on Twitter. TwitInfo allows users to browse a large collection of tweets using a timeline-based display that highlights peaks of high tweet activity. A novel streaming algorithm automatically discovers these peaks and labels them meaningfully using text from the tweets. Users can drill down to subevents, and explore further via geolocation, sentiment, and popular URLs. We contribute a recall-normalized aggregate sentiment visualization to produce more honest sentiment overviews. An evaluation of the system revealed that users were able to reconstruct meaningful summaries of events in a small amount of time. An interview with a Pulitzer Prize-winning journalist suggested that the system would be especially useful for understanding a long-running event and for identifying eyewitnesses. Quantitatively, our system can identify 80-100% of manually labeled peaks, facilitating a relatively complete view of each event studied.",
                  "journal": "",
                  "title": "Twitinfo: aggregating and visualizing microblogs for event exploration",
                  "tldr": "TwitInfo allows users to browse a large collection of tweets using a timeline-based display that highlights peaks of high tweet activity, and can identify 80-100% of manually labeled peaks, facilitating a relatively complete view of each event studied.",
                  "url": "https://www.semanticscholar.org/paper/1cf2f8804eaa3050b6e8da58ed241eb490143f27",
                  "venue": "International Conference on Human Factors in Computing Systems",
                  "authors": "_145632757_145879842_2259673_1743286_144478906_152160465",
                  "publicationDate": "2011-05-07"
            },
            {
                  "paperId": "c60372bd9cfa6b05d0aff9fa643796c692cda344",
                  "citationCount": 75,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 58,
                  "year": 2011,
                  "abstract": "Current visual analytics systems provide users with the means to explore trends in their data. Linked views and interactive displays provide insight into correlations among people, events, and places in space and time. Analysts search for events of interest through statistical tools linked to visual displays, drill down into the data, and form hypotheses based upon the available information. However, current systems stop short of predicting events. In spatiotemporal data, analysts are searching for regions of space and time with unusually high incidences of events (hotspots). In the cases where hotspots are found, analysts would like to predict how these regions may grow in order to plan resource allocation and preventative measures. Furthermore, analysts would also like to predict where future hotspots may occur. To facilitate such forecasting, we have created a predictive visual analytics toolkit that provides analysts with linked spatiotemporal and statistical analytic views. Our system models spatiotemporal events through the combination of kernel density estimation for event distribution and seasonal trend decomposition by loess smoothing for temporal predictions. We provide analysts with estimates of error in our modeling, along with spatial and temporal alerts to indicate the occurrence of statistically significant hotspots. Spatial data are distributed based on a modeling of previous event locations, thereby maintaining a temporal coherence with past events. Such tools allow analysts to perform real-time hypothesis testing, plan intervention strategies, and allocate resources to correspond to perceived threats.",
                  "journal": "",
                  "title": "Forecasting Hotspots—A Predictive Analytics Approach",
                  "tldr": "A predictive visual analytics toolkit that provides analysts with linked spatiotemporal and statistical analytic views, along with spatial and temporal alerts to indicate the occurrence of statistically significant hotspots.",
                  "url": "https://www.semanticscholar.org/paper/c60372bd9cfa6b05d0aff9fa643796c692cda344",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1786514_50428757_144401301_1783306_2067793483_35157864_33449182",
                  "publicationDate": "2011-04-01"
            },
            {
                  "paperId": "f4389ea5e9e4957b69328bb1569b145d82d546b2",
                  "citationCount": 249,
                  "publicationTypes": "Review",
                  "referenceCount": 54,
                  "year": 2011,
                  "journal": "",
                  "title": "The GLEaMviz computational tool, a publicly available software to explore realistic epidemic spreading scenarios at the global scale",
                  "tldr": "The user-friendly graphical interface of the GLEaMviz tool, along with its high level of detail and the realism of its embedded modeling approach, opens up the platform to simulate realistic epidemic scenarios.",
                  "url": "https://www.semanticscholar.org/paper/f4389ea5e9e4957b69328bb1569b145d82d546b2",
                  "venue": "BMC Infectious Diseases",
                  "authors": "_40121637_2771664_145621251_3239606_1730404_1690690",
                  "publicationDate": "2011-02-02"
            },
            {
                  "paperId": "22b8cbb0c9d6e490e2b229120c4848e826791283",
                  "citationCount": 55,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 60,
                  "year": 2010,
                  "abstract": "Many different approaches have been proposed for the challenging problem of visually analyzing large networks. Clustering is one of the most promising. In this paper, we propose a new clustering technique whose goal is that of producing both intracluster graphs and intercluster graph with desired topological properties. We formalize this concept in the (X,Y) -clustering framework, where Y is the class that defines the desired topological properties of intracluster graphs and X is the class that defines the desired topological properties of the intercluster graph. By exploiting this approach, hybrid visualization tools can effectively combine different node-link and matrix-based representations, allowing users to interactively explore the graph by expansion/contraction of clusters without loosing their mental map. As a proof of concept, we describe the system Visual Hybrid (X,Y)-clustering (VHYXY) that implements our approach and we present the results of case studies to the visual analysis of social networks.",
                  "journal": "",
                  "title": "Visual Analysis of Large Graphs Using (X,Y)-Clustering and Hybrid Visualizations",
                  "tldr": "This paper proposes a new clustering technique whose goal is that of producing both intracluster graphs and intercluster graph with desired topological properties, and formalizes this concept in the (X,Y) -clustering framework.",
                  "url": "https://www.semanticscholar.org/paper/22b8cbb0c9d6e490e2b229120c4848e826791283",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1753785_51222769_1713172_1716384_50782943_1737726",
                  "publicationDate": "2010-03-02"
            },
            {
                  "paperId": "ef05628ed2f8068246e837ae20991bbf0c78fc42",
                  "citationCount": 2256,
                  "referenceCount": 37,
                  "year": 2011,
                  "abstract": "Data-Driven Documents (D3) is a novel representation-transparent approach to visualization for the web. Rather than hide the underlying scenegraph within a toolkit-specific abstraction, D3 enables direct inspection and manipulation of a native representation: the standard document object model (DOM). With D3, designers selectively bind input data to arbitrary document elements, applying dynamic transforms to both generate and modify content. We show how representational transparency improves expressiveness and better integrates with developer tools than prior approaches, while offering comparable notational efficiency and retaining powerful declarative components. Immediate evaluation of operators further simplifies debugging and allows iterative development. Additionally, we demonstrate how D3 transforms naturally enable animation and interaction with dramatic performance improvements over intermediate representations.",
                  "title": "D 3 : Data-Driven Documents",
                  "tldr": "This work shows how representational transparency improves expressiveness and better integrates with developer tools than prior approaches, while offering comparable notational efficiency and retaining powerful declarative components.",
                  "url": "https://www.semanticscholar.org/paper/ef05628ed2f8068246e837ae20991bbf0c78fc42",
                  "authors": "_71367899_2715241_1803140"
            },
            {
                  "paperId": "60f8fa6f8ad87a1e9af64d3430538f96175852ae",
                  "citationCount": 1573,
                  "publicationTypes": "Book",
                  "referenceCount": 30,
                  "year": 2010,
                  "abstract": "Influence maximization, defined by Kempe, Kleinberg, and Tardos (2003), is the problem of finding a small set of seed nodes in a social network that maximizes the spread of influence under certain influence cascade models. The scalability of influence maximization is a key factor for enabling prevalent viral marketing in large-scale online social networks. Prior solutions, such as the greedy algorithm of Kempe et al. (2003) and its improvements are slow and not scalable, while other heuristic algorithms do not provide consistently good performance on influence spreads. In this paper, we design a new heuristic algorithm that is easily scalable to millions of nodes and edges in our experiments. Our algorithm has a simple tunable parameter for users to control the balance between the running time and the influence spread of the algorithm. Our results from extensive simulations on several real-world and synthetic networks demonstrate that our algorithm is currently the best scalable solution to the influence maximization problem: (a) our algorithm scales beyond million-sized graphs where the greedy algorithm becomes infeasible, and (b) in all size ranges, our algorithm performs consistently well in influence spread --- it is always among the best algorithms, and in most cases it significantly outperforms all other scalable heuristics to as much as 100%--260% increase in influence spread.",
                  "journal": "",
                  "title": "Scalable influence maximization for prevalent viral marketing in large-scale social networks",
                  "tldr": "The results from extensive simulations demonstrate that the proposed algorithm is currently the best scalable solution to the influence maximization problem and significantly outperforms all other scalable heuristics to as much as 100%--260% increase in influence spread.",
                  "url": "https://www.semanticscholar.org/paper/60f8fa6f8ad87a1e9af64d3430538f96175852ae",
                  "venue": "Knowledge Discovery and Data Mining",
                  "authors": "_2116625588_2115646925",
                  "publicationDate": "2010-07-25"
            },
            {
                  "paperId": "de837e0e18b4c695d0810f77074b9258b1b3264b",
                  "citationCount": 539,
                  "publicationTypes": "Conference",
                  "referenceCount": 18,
                  "year": 2009,
                  "abstract": "The contemporary Web is heading towards its next stage of evolution. From a clump of unorganized information spaces, the Web is becoming more focused on the meaning of information that is a Semantic Web. Trust is an integral component in semantic web, allowing people to act under uncertainty and with the risk of negative consequences. In this paper we discussed trust management and its connection to the semantic web. We first discussed aspects of semantic web and trust management including defining trust and describing trust negotiations and then relationship of them. After that we explored how mechanisms of XML access control are used to protect the confidentiality, integrity and availability of ontologies in trust management.",
                  "journal": "",
                  "title": "Trust Management for Semantic Web",
                  "tldr": "This paper discussed aspects of semantic web and trust management including defining trust and describing trust negotiations and then relationship of them and how mechanisms of XML access control are used to protect the confidentiality, integrity and availability of ontologies in trust management.",
                  "url": "https://www.semanticscholar.org/paper/de837e0e18b4c695d0810f77074b9258b1b3264b",
                  "venue": "2009 Second International Conference on Computer and Electrical Engineering",
                  "authors": "_1875831_2232730_9336868",
                  "publicationDate": "2009-12-28"
            },
            {
                  "paperId": "c7c8892617068ab7289d1cab601c06b2c7acc19b",
                  "citationCount": 1953,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 13,
                  "year": 2009,
                  "abstract": "Influence maximization is the problem of finding a small subset of nodes (seed nodes) in a social network that could maximize the spread of influence. In this paper, we study the efficient influence maximization from two complementary directions. One is to improve the original greedy algorithm of [5] and its improvement [7] to further reduce its running time, and the second is to propose new degree discount heuristics that improves influence spread. We evaluate our algorithms by experiments on two large academic collaboration graphs obtained from the online archival database arXiv.org. Our experimental results show that (a) our improved greedy algorithm achieves better running time comparing with the improvement of [7] with matching influence spread, (b) our degree discount heuristics achieve much better influence spread than classic degree and centrality-based heuristics, and when tuned for a specific influence cascade model, it achieves almost matching influence thread with the greedy algorithm, and more importantly (c) the degree discount heuristics run only in milliseconds while even the improved greedy algorithms run in hours in our experiment graphs with a few tens of thousands of nodes.\n Based on our results, we believe that fine-tuned heuristics may provide truly scalable solutions to the influence maximization problem with satisfying influence spread and blazingly fast running time. Therefore, contrary to what implied by the conclusion of [5] that traditional heuristics are outperformed by the greedy approximation algorithm, our results shed new lights on the research of heuristic algorithms.",
                  "journal": "",
                  "title": "Efficient influence maximization in social networks",
                  "tldr": "Based on the results, it is believed that fine-tuned heuristics may provide truly scalable solutions to the influence maximization problem with satisfying influence spread and blazingly fast running time.",
                  "url": "https://www.semanticscholar.org/paper/c7c8892617068ab7289d1cab601c06b2c7acc19b",
                  "venue": "Knowledge Discovery and Data Mining",
                  "authors": "_2115646925_2108974485",
                  "publicationDate": "2009-06-28"
            },
            {
                  "paperId": "790b66c3fbaedc9ccf300910258d386553442f92",
                  "citationCount": 73,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 30,
                  "year": 2008,
                  "abstract": "Exploring communities is an important task in social network analysis. Such communities are currently identified using clustering methods to group actors. This approach often leads to actors belonging to one and only one cluster, whereas in real life a person can belong to several communities. As a solution we propose duplicating actors in social networks and discuss potential impact of such a move. Several visual duplication designs are discussed and a controlled experiment comparing network visualization with and without duplication is performed, using 6 tasks that are important for graph readability and visual interpretation of social networks. We show that in our experiment, duplications significantly improve community-related tasks but sometimes interfere with other graph readability tasks. Finally, we propose a set of guidelines for deciding when to duplicate actors and choosing candidates for duplication, and alternative ways to render them in social network representations.",
                  "journal": "",
                  "title": "Improving the Readability of Clustered Social Networks using Node Duplication",
                  "tldr": "It is shown that in the experiment, duplications significantly improve community-related tasks but sometimes interfere with other graph readability tasks, and a set of guidelines for deciding when to duplicate actors and choosing candidates for duplication are proposed.",
                  "url": "https://www.semanticscholar.org/paper/790b66c3fbaedc9ccf300910258d386553442f92",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1692395_34790289_144381703",
                  "publicationDate": "2008-11-01"
            },
            {
                  "paperId": "bf73c697b337beeaa2b07b4d3dcf8a48f8e8249b",
                  "citationCount": 7,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 14,
                  "year": 2008,
                  "journal": "",
                  "title": "Effective Visualization of Information Diffusion Process over Complex Networks",
                  "tldr": "A new node embedding method based on conditional probability is proposed that explicitly addresses diffusion process using either the IC or LT models as a cross-entropy minimization problem, together with two label assignment strategies that can be simultaneously adopted.",
                  "url": "https://www.semanticscholar.org/paper/bf73c697b337beeaa2b07b4d3dcf8a48f8e8249b",
                  "venue": "ECML/PKDD",
                  "authors": "_1727070_145632693_1748072",
                  "publicationDate": "2008-09-15"
            },
            {
                  "paperId": "589f2ee3d3d5c7c90f0d8dcf298b72d43400b1aa",
                  "citationCount": 101,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 33,
                  "year": 2008,
                  "abstract": "This paper proposes novel methods for visualizing specifically the large power-law graphs that arise in sociology and the sciences. In such cases a large portion of edges can be shown to be less important and removed while preserving component connectedness and other features (e.g. cliques) to more clearly reveal the networkpsilas underlying connection pathways. This simplification approach deterministically filters (instead of clustering) the graph to retain important node and edge semantics, and works both automatically and interactively. The improved graph filtering and layout is combined with a novel computer graphics anisotropic shading of the dense crisscrossing array of edges to yield a full social network and scale-free graph visualization system. Both quantitative analysis and visual results demonstrate the effectiveness of this approach.",
                  "journal": "",
                  "title": "On the Visualization of Social and other Scale-Free Networks",
                  "tldr": "This paper proposes novel methods for visualizing specifically the large power-law graphs that arise in sociology and the sciences, and deterministically filters the graph to retain important node and edge semantics, and works both automatically and interactively.",
                  "url": "https://www.semanticscholar.org/paper/589f2ee3d3d5c7c90f0d8dcf298b72d43400b1aa",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1909025_2657469_144764367_144958037",
                  "publicationDate": "2008-04-01"
            },
            {
                  "paperId": "19b34e069ad674060001e7bfaa2f2763be26645e",
                  "citationCount": 515,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 36,
                  "year": 2007,
                  "abstract": "The need to visualize large social networks is growing as hardware capabilities make analyzing large networks feasible and many new data sets become available. Unfortunately, the visualizations in existing systems do not satisfactorily resolve the basic dilemma of being readable both for the global structure of the network and also for detailed analysis of local communities. To address this problem, we present NodeTrix, a hybrid representation for networks that combines the advantages of two traditional representations: node-link diagrams are used to show the global structure of a network, while arbitrary portions of the network can be shown as adjacency matrices to better support the analysis of communities. A key contribution is a set of interaction techniques. These allow analysts to create a NodeTrix visualization by dragging selections to and from node-link and matrix forms, and to flexibly manipulate the NodeTrix representation to explore the dataset and create meaningful summary visualizations of their findings. Finally, we present a case study applying NodeTrix to the analysis of the InfoVis 2004 coauthorship dataset to illustrate the capabilities of NodeTrix as both an exploration tool and an effective means of communicating results.",
                  "journal": "",
                  "title": "NodeTrix: a Hybrid Visualization of Social Networks",
                  "tldr": "NodeTrix is presented, a hybrid representation for networks that combines the advantages of two traditional representations: node-link diagrams are used to show the global structure of a network, while arbitrary portions of the network can be shown as adjacency matrices to better support the analysis of communities.",
                  "url": "https://www.semanticscholar.org/paper/19b34e069ad674060001e7bfaa2f2763be26645e",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1692395_144381703_3197167",
                  "publicationDate": "2007-11-01"
            },
            {
                  "paperId": "d40ed516e1848181a75cd5bd80b8874763d0f9aa",
                  "citationCount": 133,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 52,
                  "year": 2007,
                  "abstract": "Population mobility, i.e. the movement and contact of individuals across geographic space, is one of the essential factors that determine the course of a pandemic disease spread. This research views both individual‐based daily activities and a pandemic spread as spatial interaction problems, where locations interact with each other via the visitors that they share or the virus that is transmitted from one place to another. The research proposes a general visual analytic approach to synthesize very large spatial interaction data and discover interesting (and unknown) patterns. The proposed approach involves a suite of visual and computational techniques, including (1) a new graph partitioning method to segment a very large interaction graph into a moderate number of spatially contiguous subgraphs (regions); (2) a reorderable matrix, with regions ‘optimally’ ordered on the diagonal, to effectively present a holistic view of major spatial interaction patterns; and (3) a modified flow map, interactively linked to the reorderable matrix, to enable pattern interpretation in a geographical context. The implemented system is able to visualize both peoples daily movements and a disease spread over space in a similar way. The discovered spatial interaction patterns provide valuable insight for designing effective pandemic mitigation strategies and supporting decision‐making in time‐critical situations.",
                  "journal": "",
                  "title": "Visual analytics of spatial interaction patterns for pandemic decision support",
                  "tldr": "The research proposes a general visual analytic approach to synthesize very large spatial interaction data and discover interesting (and unknown) patterns that provide valuable insight for designing effective pandemic mitigation strategies and supporting decision‐making in time‐critical situations.",
                  "url": "https://www.semanticscholar.org/paper/d40ed516e1848181a75cd5bd80b8874763d0f9aa",
                  "venue": "International Journal of Geographical Information Science",
                  "authors": "_143718241",
                  "publicationDate": "2007-01-08"
            },
            {
                  "paperId": "be33ebd01f336c04a1db20830576612ab45b1b9b",
                  "citationCount": 594,
                  "referenceCount": 33,
                  "year": 2006,
                  "abstract": "We propose a graph drawing algorithm that is both efficient and high quality. This algorithm combines a multilevel approach, which effectively overcomes local minimums, with the Barnes and Hut [1] octree technique, which approximates shortand long-range force efficiently. Our numerical results show that the algorithm is comparable in speed to Walshaw’s [2] highly efficient multilevel graph drawing algorithm, yet gives better results on some of the difficult problems. In addition, an adaptive cooling scheme for the force-directed algorithms and a general repulsive force model are proposed. The proposed graph drawing algorithm and others are included with Mathematica 5.1 and later versions in the package DiscreteMath‘GraphÑ Plot.",
                  "journal": "",
                  "title": "Efficient, High-Quality Force-Directed Graph Drawing",
                  "tldr": "This algorithm combines a multilevel approach, which effectively overcomes local minimums, with the Barnes and Hut octree technique, which approximates short and long-range force efficiently.",
                  "url": "https://www.semanticscholar.org/paper/be33ebd01f336c04a1db20830576612ab45b1b9b",
                  "authors": "_50819900"
            },
            {
                  "paperId": "1413dbfbbae1b59d52656db3dc48a4ee278e082f",
                  "citationCount": 1966,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 50,
                  "year": 2004,
                  "journal": "",
                  "title": "Modelling disease outbreaks in realistic urban social networks",
                  "tldr": "The results suggest that outbreaks can be contained by a strategy of targeted vaccination combined with early detection without resorting to mass vaccination of a population.",
                  "url": "https://www.semanticscholar.org/paper/1413dbfbbae1b59d52656db3dc48a4ee278e082f",
                  "venue": "Nature",
                  "authors": "_144441581_144989585_2011494_1720151_143780771_1722191_1490666760",
                  "publicationDate": "2004-05-13"
            },
            {
                  "paperId": "656a48758f73f22be66996b732f46a086e194fa7",
                  "citationCount": 10,
                  "publicationTypes": "JournalArticle",
                  "year": 2004,
                  "journal": "",
                  "title": "Fighting Computer Virus Attacks",
                  "url": "https://www.semanticscholar.org/paper/656a48758f73f22be66996b732f46a086e194fa7",
                  "venue": "USENIX Security Symposium",
                  "authors": "_2986069"
            },
            {
                  "paperId": "13df42f24714d1d0c365a2ca6f62dd5cac9534de",
                  "citationCount": 7285,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 49,
                  "year": 2003,
                  "abstract": "Models for the processes by which ideas and influence propagate through a social network have been studied in a number of domains, including the diffusion of medical and technological innovations, the sudden and widespread adoption of various strategies in game-theoretic settings, and the effects of word of mouth in the promotion of new products. Recently, motivated by the design of viral marketing strategies, Domingos and Richardson posed a fundamental algorithmic problem for such social network processes: if we can try to convince a subset of individuals to adopt a new product or innovation, and the goal is to trigger a large cascade of further adoptions, which set of individuals should we target?We consider this problem in several of the most widely studied models in social network analysis. The optimization problem of selecting the most influential nodes is NP-hard here, and we provide the first provable approximation guarantees for efficient algorithms. Using an analysis framework based on submodular functions, we show that a natural greedy strategy obtains a solution that is provably within 63% of optimal for several classes of models; our framework suggests a general approach for reasoning about the performance guarantees of algorithms for these types of influence problems in social networks.We also provide computational experiments on large collaboration networks, showing that in addition to their provable guarantees, our approximation algorithms significantly out-perform node-selection heuristics based on the well-studied notions of degree centrality and distance centrality from the field of social networks.",
                  "journal": "",
                  "title": "Maximizing the spread of influence through a social network",
                  "tldr": "An analysis framework based on submodular functions shows that a natural greedy strategy obtains a solution that is provably within 63% of optimal for several classes of models, and suggests a general approach for reasoning about the performance guarantees of algorithms for these types of influence problems in social networks.",
                  "url": "https://www.semanticscholar.org/paper/13df42f24714d1d0c365a2ca6f62dd5cac9534de",
                  "venue": "Knowledge Discovery and Data Mining",
                  "authors": "_1765196_3371403_1746222",
                  "publicationDate": "2003-08-24"
            },
            {
                  "paperId": "b7fe79966cb86f8d2b8b8054acbb92eaf67e6c0e",
                  "citationCount": 1092,
                  "publicationTypes": "Review",
                  "referenceCount": 15,
                  "year": 2003,
                  "abstract": "Abstract Choosing effective colour schemes for thematic maps is surprisingly difficult. ColorBrewer is an online tool designed to take some of the guesswork out of this process by helping users select appropriate colour schemes for their specific mapping needs by considering: the number of data classes; the nature of their data (matched with sequential, diverging and qualitative schemes); and the end-use environment for the map (e.g., CRT, LCD, printed, projected, photocopied). ColorBrewer contains learn more tutorials to help guide users, prompts them to test-drive colour schemes as both map and legend, and provides output in five colour specification systems.",
                  "journal": "",
                  "title": "ColorBrewer.org: An Online Tool for Selecting Colour Schemes for Maps",
                  "tldr": "colorBrewer is an online tool designed to take some of the guesswork out of this process by helping users select appropriate colour schemes for their specific mapping needs by considering the number of data classes, nature of their data, and the end-use environment for the map.",
                  "url": "https://www.semanticscholar.org/paper/b7fe79966cb86f8d2b8b8054acbb92eaf67e6c0e",
                  "authors": "_2866651_2690037",
                  "publicationDate": "2003-06-01"
            },
            {
                  "paperId": "ad3df67973cb95b696386fbf5bad9db91aaf126a",
                  "citationCount": 2759,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 45,
                  "year": 2001,
                  "abstract": "One of the major applications of data mining is in helping companies determine which potential customers to market to. If the expected profit from a customer is greater than the cost of marketing to her, the marketing action for that customer is executed. So far, work in this area has considered only the intrinsic value of the customer (i.e, the expected profit from sales to her). We propose to model also the customers network value: the expected profit from sales to other customers she may influence to buy, the customers those may influence, and so on recursively. Instead of viewing a market as a set of independent entities, we view it as a social network and model it as a Markov random field. We show the advantages of this approach using a social network mined from a collaborative filtering database. Marketing that exploits the network value of customers---also known as viral marketing---can be extremely effective, but is still a black art. Our work can be viewed as a step towards providing a more solid foundation for it, taking advantage of the availability of large relevant databases.",
                  "journal": "",
                  "title": "Mining the network value of customers",
                  "tldr": "It is proposed to model also the customers network value: the expected profit from sales to other customers she may influence to buy, the customers those may influence, and so on recursively, taking advantage of the availability of large relevant databases.",
                  "url": "https://www.semanticscholar.org/paper/ad3df67973cb95b696386fbf5bad9db91aaf126a",
                  "venue": "Knowledge Discovery and Data Mining",
                  "authors": "_1740213_144422314",
                  "publicationDate": "2001-08-26"
            },
            {
                  "paperId": "19c64da92a8c67c14ddd9cced0d1d0b9ff6b39d1",
                  "citationCount": 1387,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 71,
                  "year": 2000,
                  "abstract": "We describe a package of practical tools and libraries for manipulating graphs and their drawings. Our design, which is aimed at facilitating the combination of the package components with other tools, includes stream and event interfaces for graph operations, high‐quality static and dynamic layout algorithms, and the ability to handle sizeable graphs. We conclude with a description of the applications of this package to a variety of software engineering tools. Copyright © 2000 John Wiley & Sons, Ltd.",
                  "journal": "",
                  "title": "An open graph visualization system and its applications to software engineering",
                  "tldr": "A package of practical tools and libraries for manipulating graphs and their drawings that includes stream and event interfaces for graph operations, high‐quality static and dynamic layout algorithms, and the ability to handle sizeable graphs is described.",
                  "url": "https://www.semanticscholar.org/paper/19c64da92a8c67c14ddd9cced0d1d0b9ff6b39d1",
                  "venue": "Software, Practice & Experience",
                  "authors": "_1725593_2885843",
                  "publicationDate": "2000-09-01"
            },
            {
                  "paperId": "b9e43395663f74c581982e9ca97a0d7057a0008c",
                  "citationCount": 4177,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 13,
                  "year": 1978,
                  "journal": "",
                  "title": "An analysis of approximations for maximizing submodular set functions—I",
                  "tldr": "It is shown that a “greedy” heuristic always produces a solution whose value is at least 1 −[(K − 1/K]K times the optimal value, which can be achieved for eachK and has a limiting value of (e − 1)/e, where e is the base of the natural logarithm.",
                  "url": "https://www.semanticscholar.org/paper/b9e43395663f74c581982e9ca97a0d7057a0008c",
                  "venue": "Mathematical programming",
                  "authors": "_1705564_1736128_145456487",
                  "publicationDate": "1978-12-01"
            },
            {
                  "paperId": "453c8bea532ade368c4598397b57e3364e3dd018",
                  "citationCount": 10,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 26,
                  "year": 2020,
                  "abstract": "This work proposes a cyber-physical-social system (CPSS) framework for smart factories which associates the social-network-based physical factory circumference with the cyber control through a visualization interface based on NodeTrix. The NodeTrix representation consisting of adjacency matrices and node-link diagrams has been popularly used in social network analysis. Different from previous works on NodeTrix based on square-shaped matrices, the proposed NodeTrix applies triangle-shaped matrices for visualizing overlapping communities to save the displaying space, and a simulated annealing algorithm is used to reduce the crossings among links and communities. In the CPSS for smart factories, working-in-process (WIP) products are categorized according to their attributes, and are placed at different storage locations for later different production processes. By the NodeTrix-based interface for CPSS, when users with different domains and experiences work together to make instant decisions on production and logistics, the physical production environment will be adjusted accordingly and immediately through technological support of Industry 4.0. Through the interface, the information on locations, parameters, and interoperability of WIP products can be visualized and adjusted in time. By comparison with other works, the proposed representation looks promising in displaying social networks for the CPSS with fewer crossings within a smaller screen space.",
                  "journal": "",
                  "title": "A Triangular NodeTrix Visualization Interface for Overlapping Social Community Structures of Cyber-Physical-Social Systems in Smart Factories",
                  "tldr": "This work proposes a cyber-physical-social system (CPSS) framework for smart factories which associates the social-network-based physical factory circumference with the cyber control through a visualization interface based on NodeTrix, and the proposed representation looks promising in displaying social networks for the CPSS with fewer crossings within a smaller screen space.",
                  "url": "https://www.semanticscholar.org/paper/453c8bea532ade368c4598397b57e3364e3dd018",
                  "venue": "IEEE Transactions on Emerging Topics in Computing",
                  "authors": "_70586349_145151586_3307335",
                  "publicationDate": "2020-01-01"
            },
            {
                  "paperId": "d266864fa39e54959a22539c26243f75b0bb18f0",
                  "citationCount": 33,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 67,
                  "year": 2019,
                  "abstract": "Visualizing network data is applicable in domains such as biology, engineering, and social sciences. We report the results of a study comparing the effectiveness of the two primary techniques for showing network data: node-link diagrams and adjacency matrices. Specifically, an evaluation with a large number of online participants revealed statistically significant differences between the two visualizations. Our work adds to existing research in several ways. First, we explore a broad spectrum of network tasks, many of which had not been previously evaluated. Second, our study uses two large datasets, typical of many real-life networks not explored by previous studies. Third, we leverage crowdsourcing to evaluate many tasks with many participants. This paper is an expanded journal version of a Graph Drawing (GD17) conference paper. We evaluated a second dataset, added a qualitative feedback section, and expanded the procedure, results, discussion, and limitations sections.",
                  "journal": "",
                  "title": "Node-Link or Adjacency Matrices: Old Question, New Insights",
                  "tldr": "A study comparing the effectiveness of the two primary techniques for showing network data: node-link diagrams and adjacency matrices finds statistically significant differences between the two visualizations.",
                  "url": "https://www.semanticscholar.org/paper/d266864fa39e54959a22539c26243f75b0bb18f0",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_2539121_2819751_9374807",
                  "publicationDate": "2019-10-01"
            },
            {
                  "paperId": "ed850c264ad2ee6f823691e10ca6a113aa785502",
                  "citationCount": 5,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 43,
                  "year": 2019,
                  "journal": "",
                  "title": "ChordLink: A New Hybrid Visualization Model",
                  "tldr": "ChordLink is described, a hybrid visualization model that embeds chord diagrams, used to represent dense subgraphs, into a node-link diagram, which shows the global network structure and makes it possible to interactively highlight the structure of a community while keeping the rest of the layout stable.",
                  "url": "https://www.semanticscholar.org/paper/ed850c264ad2ee6f823691e10ca6a113aa785502",
                  "venue": "GD",
                  "authors": "_1388409482_1713172_3291006_46194830_7539016",
                  "publicationDate": "2019-08-22"
            },
            {
                  "paperId": "cf3e3cb48b2e30ac910de802054b076a4ef0aaee",
                  "citationCount": 7,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 30,
                  "year": 2018,
                  "journal": "",
                  "title": "(k, p)-Planarity: A Relaxation of Hybrid Planarity",
                  "tldr": "A new model for hybrid planarity that relaxes existing hybrid representations and tightly bound the number of edges in a (k, p)-planar graph is presented, proving that (4, 1)-planarity testing and (2, 2)-planularity testing are NP-complete problems.",
                  "url": "https://www.semanticscholar.org/paper/cf3e3cb48b2e30ac910de802054b076a4ef0aaee",
                  "venue": "WALCOM",
                  "authors": "_7448104_144172235_1716384_144753700_7539016",
                  "publicationDate": "2018-06-29"
            },
            {
                  "paperId": "9dcc533183db5ea8c4bf047799f84200a4ba9301",
                  "citationCount": 16,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 23,
                  "year": 2017,
                  "journal": "",
                  "title": "NodeTrix Planarity Testing with Small Clusters",
                  "tldr": "It is shown that NodeTrix planarity testing with fixed sides can be solved in O(n) time for every flat clustered graph that can be reduced to a partial 2-tree by collapsing its clusters into single vertices, and remains NP-complete also in the free sides model.",
                  "url": "https://www.semanticscholar.org/paper/9dcc533183db5ea8c4bf047799f84200a4ba9301",
                  "venue": "Algorithmica",
                  "authors": "_115551271_1716384_1737726_145736169_7539016",
                  "publicationDate": "2017-08-30"
            },
            {
                  "paperId": "d36f99ffd84d76c5d6198feed17bef45a5c62304",
                  "citationCount": 4,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 84,
                  "year": 2018,
                  "journal": "",
                  "title": "Profiling distributed graph processing systems through visual analytics",
                  "tldr": "GiViP is presented, a visual profiler for distributed graph processing systems based on a Pregel-like computation model that captures the huge amount of messages exchanged throughout a computation and provides a powerful user interface for the visual analysis of the collected data.",
                  "url": "https://www.semanticscholar.org/paper/d36f99ffd84d76c5d6198feed17bef45a5c62304",
                  "venue": "Future Gener. Comput. Syst.",
                  "authors": "_34611540_1713172_1716384_3291006",
                  "publicationDate": "2018-10-01"
            },
            {
                  "paperId": "3a943af1229e35eff50bc24ff4d8c434b9457f96",
                  "citationCount": 7,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 30,
                  "year": 2018,
                  "abstract": "The visualization gap is one of the important challenges posed by many-objective optimization problems (MaOPs). In this paper, we present an integrated data visualization method for MaOPs, called CAP-vis plot, combining the Chord diagram, the Angular mapping and the Parallel coordinates in the same visualization. The method follows the circular design layout, showing different levels of information. This new approach allows the spatial location of points in high dimensional spaces, the visualization of harmony and conflict between objectives, as well as the comparison of the approximation sets provided by different algorithms. With this work, we try to fill the visualization gap and bring information to the eye of the decision-maker and the optimizer, with an intuitive overview of the obtained results. Some experiments were performed using the Benchmark Functions proposed for the IEEE-CEC 2018 Competition on Many-Objective Optimization. We used the tool to visualize the results obtained by NSGA-III, HypE, RVEA, MOEA/DD, PICEA-g, using the PlatEMO MATLAB platform, with the same parameter settings of the competition. The results on the Benchmark Problems show the importance of the qualitative analysis of the data. The experiments show how visualization can help interpretation of the results and identification of strengths and drawbacks of MOEA.",
                  "journal": "",
                  "title": "Information to the Eye of the Beholder: Data Visualization for Many-Objective Optimization",
                  "tldr": "This paper presents an integrated data visualization method for MaOPs, called CAP-vis plot, combining the Chord diagram, the Angular mapping and the Parallel coordinates in the same visualization, which allows the spatial location of points in high dimensional spaces, the visualization of harmony and conflict between objectives.",
                  "url": "https://www.semanticscholar.org/paper/3a943af1229e35eff50bc24ff4d8c434b9457f96",
                  "venue": "2018 IEEE Congress on Evolutionary Computation (CEC)",
                  "authors": "_8445914_3369330_1717244_1401979764",
                  "publicationDate": "2018-07-01"
            },
            {
                  "paperId": "cb9d5f4c8ede45a79092437a0efc552b4ec0be61",
                  "citationCount": 22,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 30,
                  "year": 2018,
                  "journal": "",
                  "title": "A visual analytics system to support tax evasion discovery",
                  "tldr": "TaxNet allows users to visually define classes of suspicious patterns, it exploits effective graph pattern matching technologies to rapidly extract subgraphs that correspond to one or more patterns, and it provides facilities to conveniently merge the results.",
                  "url": "https://www.semanticscholar.org/paper/cb9d5f4c8ede45a79092437a0efc552b4ec0be61",
                  "venue": "Decis. Support Syst.",
                  "authors": "_1713172_46195293_1716384_3291006_46194830",
                  "publicationDate": "2018-06-01"
            },
            {
                  "paperId": "b498b842177dd7353b48a0b29b7d611d0b9cf924",
                  "citationCount": 27,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 44,
                  "year": 2017,
                  "journal": "",
                  "title": "A new visualization method in many-objective optimization with chord diagram and angular mapping",
                  "tldr": "A multi-purposed visualization tool is proposed to be applied in an evolutionary design process, mapping the solutions from high-dimensional objective space into a 2D form of scattering that is based on norm and angle information.",
                  "url": "https://www.semanticscholar.org/paper/b498b842177dd7353b48a0b29b7d611d0b9cf924",
                  "venue": "Knowl. Based Syst.",
                  "authors": "_3369330_8445914_7170292_1717244",
                  "publicationDate": "2017-12-15"
            },
            {
                  "paperId": "9c36008c81876df8c639bc2667c197a8c4a62aa4",
                  "citationCount": 15,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 46,
                  "year": 2015,
                  "journal": "",
                  "title": "On the Planar Split Thickness of Graphs",
                  "tldr": "It is proved that it is NP-hard to recognize graphs that are 2-splittable into a planar graph, and it is shown that one can approximate the planar split thickness of a graph within a constant factor.",
                  "url": "https://www.semanticscholar.org/paper/9c36008c81876df8c639bc2667c197a8c4a62aa4",
                  "venue": "Algorithmica",
                  "authors": "_1719358_1889336_9374807_1716384_1745436_153060787_1698263_3264292_1746309_1808372",
                  "publicationDate": "2015-12-15"
            },
            {
                  "paperId": "df36a5563278ab459a4fadbca7b0681f0a955f7c",
                  "citationCount": 27,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 45,
                  "year": 2017,
                  "abstract": "Visually comparing human brain networks from multiple population groups serves as an important task in the field of brain connectomics. The commonly used brain network representation, consisting of nodes and edges, may not be able to reveal the most compelling network differences when the reconstructed networks are dense and homogeneous. In this paper, we leveraged the block information on the Region Of Interest (ROI) based brain networks and studied the problem of blockwise brain network visual comparison. An integrated visual analytics framework was proposed. In the first stage, a two-level ROI block hierarchy was detected by optimizing the anatomical structure and the predictive comparison performance simultaneously. In the second stage, the NodeTrix representation was adopted and customized to visualize the brain network with block information. We conducted controlled user experiments and case studies to evaluate our proposed solution. Results indicated that our visual analytics method outperformed the commonly used node-link graph and adjacency matrix design in the blockwise network comparison tasks. We have shown compelling findings from two real-world brain network data sets, which are consistent with the prior connectomics studies.",
                  "journal": "",
                  "title": "Blockwise Human Brain Network Visual Comparison Using NodeTrix Representation",
                  "tldr": "Results indicated that the visual analytics method outperformed the commonly used node-link graph and adjacency matrix design in the blockwise network comparison tasks.",
                  "url": "https://www.semanticscholar.org/paper/df36a5563278ab459a4fadbca7b0681f0a955f7c",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_2150441134_19284184_1822346_8163721_2145921878_145363225"
            },
            {
                  "paperId": "4730f3a549da0ef05a875e42f78b9e53249bfe88",
                  "citationCount": 22,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 22,
                  "year": 2016,
                  "journal": "",
                  "title": "Computing NodeTrix Representations of Clustered Graphs",
                  "tldr": "The complexity of constructing NodeTrix representations focusing on planarity testing problems is studied, and several (mathbb {NP})-completeness results and some polynomial-time algorithms are shown.",
                  "url": "https://www.semanticscholar.org/paper/4730f3a549da0ef05a875e42f78b9e53249bfe88",
                  "venue": "GD",
                  "authors": "_1703401_4507538_35039643_1737726",
                  "publicationDate": "2016-08-31"
            },
            {
                  "paperId": "7fcec364d44a8a5953bc4b362f2fc3da4f67d86b",
                  "citationCount": 201,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 125,
                  "year": 2016,
                  "abstract": "The expansion of the web and emergence of a large number of social networking sites (SNS) have empowered users to easily interconnect on a shared platform. A social network can be represented by a graph consisting of a set of nodes and edges connecting these nodes. The nodes represent the individuals/entities, and the edges correspond to the interactions among them. The tendency of people with similar tastes, choices, and preferences to get associated in a social network leads to the formation of virtual clusters or communities. Detection of these communities can be beneficial for numerous applications such as finding a common research area in collaboration networks, finding a set of likeminded users for marketing and recommendations, and finding protein interaction networks in biological networks. A large number of community‐detection algorithms have been proposed and applied to several domains in the literature. This paper presents a survey of the existing algorithms and approaches for the detection of communities in social networks. We also discuss some of the applications of community detection. WIREs Data Mining Knowl Discov 2016, 6:115–135. doi: 10.1002/widm.1178",
                  "journal": "",
                  "title": "Community detection in social networks",
                  "tldr": "A survey of the existing algorithms and approaches for the detection of communities in social networks is presented and some of the applications of community detection are discussed.",
                  "url": "https://www.semanticscholar.org/paper/7fcec364d44a8a5953bc4b362f2fc3da4f67d86b",
                  "venue": "WIREs Data Mining Knowl. Discov.",
                  "authors": "_1740665_2054073786",
                  "publicationDate": "2016-05-01"
            },
            {
                  "paperId": "44b28af9bc44d4c0b9f8b21dfebf2aedaa5b966a",
                  "citationCount": 22,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 20,
                  "year": 2015,
                  "abstract": "We consider drawings of graphs that contain dense subgraphs. We introduce intersection-link representations for such graphs, in which each vertex u is represented by a geometric object Ru and in which each edge u,i¾?v is represented by the intersection between Ru and Rv if it belongs to a dense subgraph or by a curve connecting the boundaries of Ru and Rv otherwise. We study a notion of planarity, called Clique Planarity, for intersection-link representations of graphs in which the dense subgraphs are cliques.",
                  "journal": "",
                  "title": "Intersection-Link Representations of Graphs",
                  "tldr": "A notion of planarity is studied, called Clique Planarity, for intersection-link representations of graphs in which the dense subgraphs are cliques, in which each vertex u is represented by a geometric object R(u) and each edge v isrepresented by the intersection between R( u) and R(v).",
                  "url": "https://www.semanticscholar.org/paper/44b28af9bc44d4c0b9f8b21dfebf2aedaa5b966a",
                  "venue": "GD",
                  "authors": "_1723517_1703401_4507538_35039643_1737726_145736169",
                  "publicationDate": "2015-08-30"
            },
            {
                  "paperId": "8f01912255c3696c3fedf47885ae745cb1a4a3eb",
                  "citationCount": 35,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 38,
                  "year": 2014,
                  "journal": "",
                  "title": "Network visualization for financial crime detection",
                  "tldr": "A new software system, VisFAN, for the visual analysis of financial activity networks makes a strong use of visual interactive tools, combined with ad-hoc clustering techniques and customizable layout constraints management, which confirms, information visualization can play a crucial role to face the discovery of financial crimes.",
                  "url": "https://www.semanticscholar.org/paper/8f01912255c3696c3fedf47885ae745cb1a4a3eb",
                  "venue": "J. Vis. Lang. Comput.",
                  "authors": "_1713172_1716384_3291006",
                  "publicationDate": "2014-08-01"
            },
            {
                  "paperId": "86fc0be6b629ae263c157e89b7efff589fd53749",
                  "citationCount": 53,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 46,
                  "year": 2014,
                  "journal": "",
                  "title": "Larger crossing angles make graphs easier to read",
                  "tldr": "This study showed that among the four proposed candidates, the minimum crossing angle on the path was the best measure for the aesthetic when path finding is important, and larger crossing angles make graphs easier to read.",
                  "url": "https://www.semanticscholar.org/paper/86fc0be6b629ae263c157e89b7efff589fd53749",
                  "venue": "J. Vis. Lang. Comput.",
                  "authors": "_1696796_1815562_122630789",
                  "publicationDate": "2014-08-01"
            },
            {
                  "paperId": "e3b02bab5657f372a1014b31957c53de822558e5",
                  "citationCount": 36,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 54,
                  "year": 2014,
                  "journal": "",
                  "title": "Fast layout computation of clustered networks: Algorithmic advances and experimental analysis",
                  "tldr": "A new drawing algorithm is proposed that combines space-filling and fast force-directed methods and runs in O(n logn+m) time, where n and m are the number of vertices and edges of the network, respectively.",
                  "url": "https://www.semanticscholar.org/paper/e3b02bab5657f372a1014b31957c53de822558e5",
                  "venue": "Inf. Sci.",
                  "authors": "_1713172_3291006",
                  "publicationDate": "2014-03-01"
            },
            {
                  "paperId": "a69888c636554f811bc71bdbc1ef0e0eae99cd56",
                  "citationCount": 16,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 29,
                  "year": 2013,
                  "abstract": "We present a prototype system developed in cooperation with a business organization that combines information visualization and pattern-matching techniques to detect fraudulent activity by employees. The system is built upon common fraud patterns searched while trying to detect occupational fraud suggested by internal auditors of a business company. The main visualization of the system consists of a multi-layer radial drawing that represents the activity of the employees and clients. Each layer represents a different examined pattern whereas heat-maps indicating suspicious activity are incorporated in the visualization. The data are first preprocessed based on a decision tree generated by the examined patterns and each employee is assigned a value indicating whether or not there exist indications of fraud. The visualization is presented as an animation and the employees are visualized one by one according to their severity values together with their related clients.",
                  "journal": "",
                  "title": "A fraud detection visualization system utilizing radial drawings and heat-maps",
                  "tldr": "A prototype system that combines information visualization and pattern-matching techniques to detect fraudulent activity by employees built upon common fraud patterns searched while trying to detect occupational fraud suggested by internal auditors of a business company is presented.",
                  "url": "https://www.semanticscholar.org/paper/a69888c636554f811bc71bdbc1ef0e0eae99cd56",
                  "venue": "2014 International Conference on Information Visualization Theory and Applications (IVAPP)",
                  "authors": "_1738808_1686540_46913559",
                  "publicationDate": "2013-11-28"
            },
            {
                  "paperId": "a965337a67757eaabe77035c38876a8cedf701b0",
                  "citationCount": 74,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 11,
                  "year": 2013,
                  "journal": "",
                  "title": "From Tweets to Semantic Trajectories: Mining Anomalous Urban Mobility Patterns",
                  "tldr": "This paper proposes and experiments new techniques to detect urban mobility patterns and anomalies by analyzing trajectories mined from publicly available geo-positioned social media traces left by the citizens (namely Twitter).",
                  "url": "https://www.semanticscholar.org/paper/a965337a67757eaabe77035c38876a8cedf701b0",
                  "venue": "CitiSens",
                  "authors": "_37149516_2120595_2178139_2255094",
                  "publicationDate": "2013-09-19"
            },
            {
                  "paperId": "4f726a278a40446ca5be9468001fff2e7d684646",
                  "citationCount": 21,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 31,
                  "year": 2013,
                  "journal": "",
                  "title": "Community Detection in Protein-Protein Interaction Networks Using Spectral and Graph Approaches",
                  "url": "https://www.semanticscholar.org/paper/4f726a278a40446ca5be9468001fff2e7d684646",
                  "venue": "CIBB",
                  "authors": "_144487965_144493859_1710901_143951838",
                  "publicationDate": "2013-06-20"
            },
            {
                  "paperId": "c4dd7f69eb39981611d6b3238d893e020de995b1",
                  "citationCount": 7,
                  "referenceCount": 25,
                  "year": 2013,
                  "journal": "",
                  "title": "Circular Drawing Algorithms",
                  "url": "https://www.semanticscholar.org/paper/c4dd7f69eb39981611d6b3238d893e020de995b1",
                  "venue": "Handbook of Graph Drawing and Visualization",
                  "authors": "_3044140_1770430"
            },
            {
                  "paperId": "bcce7708d7638fa0e39738444c42d244ef9f1c90",
                  "citationCount": 180,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 49,
                  "year": 2012,
                  "abstract": "We propose the notion of composite visualization views (CVVs) as a theoretical model that unifies the existing coordinated multiple views (CMV) paradigm with other strategies for combining visual representations in the same geometrical space. We identify five such strategies - called CVV design patterns - based on an extensive review of the literature in composite visualization. We go on to show how these design patterns can all be expressed in terms of a design space describing the correlation between two visualizations in terms of spatial mapping as well as the data relationships between items in the visualizations. We also discuss how to use this design space to suggest potential directions for future research.",
                  "journal": "",
                  "title": "Exploring the design space of composite visualization",
                  "tldr": "The notion of composite visualization views (CVVs) is proposed as a theoretical model that unifies the existing coordinated multiple views (CMV) paradigm with other strategies for combining visual representations in the same geometrical space.",
                  "url": "https://www.semanticscholar.org/paper/bcce7708d7638fa0e39738444c42d244ef9f1c90",
                  "venue": "IEEE Pacific Visualization Symposium",
                  "authors": "_2229678_1722415",
                  "publicationDate": "2012-02-28"
            },
            {
                  "paperId": "c0b374e747cbcc88341444f01afdb96d693d0a87",
                  "citationCount": 74,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 19,
                  "year": 2010,
                  "abstract": "Information visualization is essential in making sense of large datasets. Often, high-dimensional data are visualized as a collection of points in 2D space through dimensionality reduction techniques. However, these traditional methods often dont capture the underlying structural information, clustering, and neighborhoods well. GMap is a practical algorithmic framework for visualizing relational data with geographic-like maps. This approach is effective in various domains.",
                  "journal": "",
                  "title": "Visualizing Graphs and Clusters as Maps",
                  "tldr": "GMap is a practical algorithmic framework for visualizing relational data with geographic-like maps that is effective in various domains and captures the underlying structural information, clustering, and neighborhoods well.",
                  "url": "https://www.semanticscholar.org/paper/c0b374e747cbcc88341444f01afdb96d693d0a87",
                  "venue": "IEEE Computer Graphics and Applications",
                  "authors": "_50819900_1725593_9374807",
                  "publicationDate": "2010-11-01"
            },
            {
                  "paperId": "ffa9c32f5961b4ce2e0685737d33a83a85cf76a2",
                  "citationCount": 157,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 33,
                  "year": 2010,
                  "abstract": "In many common data analysis scenarios the data elements are logically grouped into sets. Venn and Euler style diagrams are a common visual representation of such set membership where the data elements are represented by labels or glyphs and sets are indicated by boundaries surrounding their members. Generating such diagrams automatically such that set regions do not intersect unless the corresponding sets have a non-empty intersection is a difficult problem. Further, it may be impossible in some cases if regions are required to be continuous and convex. Several approaches exist to draw such set regions using more complex shapes, however, the resulting diagrams can be difficult to interpret. In this paper we present two novel approaches for simplifying a complex collection of intersecting sets into a strict hierarchy that can be more easily automatically arranged and drawn (Figure 1). In the first approach, we use compact rectangular shapes for drawing each set, attempting to improve the readability of the set intersections. In the second approach, we avoid drawing intersecting set regions by duplicating elements belonging to multiple sets. We compared both of our techniques to the traditional non-convex region technique using five readability tasks. Our results show that the compact rectangular shapes technique was often preferred by experimental subjects even though the use of duplications dramatically improves the accuracy and performance time for most of our tasks. In addition to general set representation our techniques are also applicable to visualization of networks with intersecting clusters of nodes.",
                  "journal": "",
                  "title": "Untangling Euler Diagrams",
                  "tldr": "Two novel approaches for simplifying a complex collection of intersecting sets into a strict hierarchy that can be more easily automatically arranged and drawn are presented.",
                  "url": "https://www.semanticscholar.org/paper/ffa9c32f5961b4ce2e0685737d33a83a85cf76a2",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1692395_145835767",
                  "publicationDate": "2010-11-01"
            },
            {
                  "paperId": "50e7ef64c979c7dd8d18ed8b44d625afb3e881b8",
                  "citationCount": 8,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 17,
                  "year": 2010,
                  "journal": "",
                  "title": "Finding Research Community in Collaboration Network with Expertise Profiling",
                  "tldr": "A hierarchical discovery strategy which rapidly locates the core of the research community, and then incrementally extends the community, to prevent intellectually irrelevant nodes to spill-in to the current community.",
                  "url": "https://www.semanticscholar.org/paper/50e7ef64c979c7dd8d18ed8b44d625afb3e881b8",
                  "venue": "ICIC",
                  "authors": "_40792854_50774742_31726916_2058155085",
                  "publicationDate": "2010-08-18"
            },
            {
                  "paperId": "3c181c06a2839fec6e67a9cd8f0825a5a5dc220b",
                  "citationCount": 7503,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 49,
                  "year": 2009,
                  "abstract": "We created a visualization tool called Circos to facilitate the identification and analysis of similarities and differences arising from comparisons of genomes. Our tool is effective in displaying variation in genome structure and, generally, any other kind of positional relationships between genomic intervals. Such data are routinely produced by sequence alignments, hybridization arrays, genome mapping, and genotyping studies. Circos uses a circular ideogram layout to facilitate the display of relationships between pairs of positions by the use of ribbons, which encode the position, size, and orientation of related genomic elements. Circos is capable of displaying data as scatter, line, and histogram plots, heat maps, tiles, connectors, and text. Bitmap or vector images can be created from GFF-style data inputs and hierarchical configuration files, which can be easily generated by automated tools, making Circos suitable for rapid deployment in data analysis and reporting pipelines.",
                  "journal": "",
                  "title": "Circos: an information aesthetic for comparative genomics.",
                  "tldr": "Circos uses a circular ideogram layout to facilitate the display of relationships between pairs of positions by the use of ribbons, which encode the position, size, and orientation of related genomic elements.",
                  "url": "https://www.semanticscholar.org/paper/3c181c06a2839fec6e67a9cd8f0825a5a5dc220b",
                  "venue": "Genome Research",
                  "authors": "_2802123_1910082_144831170_2067444051_2225435_35099992_143622307_1778564",
                  "publicationDate": "2009-09-01"
            },
            {
                  "paperId": "9be428c9383d47b86570b1b9fc20faf006346c5d",
                  "citationCount": 9727,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 546,
                  "year": 2009,
                  "journal": "",
                  "title": "Community detection in graphs",
                  "tldr": "A thorough exposition of community structure, or clustering, is attempted, from the definition of the main elements of the problem, to the presentation of most methods developed, with a special focus on techniques designed by statistical physicists.",
                  "url": "https://www.semanticscholar.org/paper/9be428c9383d47b86570b1b9fc20faf006346c5d",
                  "venue": "ArXiv",
                  "authors": "_3334430",
                  "publicationDate": "2009-06-03"
            },
            {
                  "paperId": "abf6e992494ceaa9b3357b0fe1c81b33574f4101",
                  "citationCount": 86,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 40,
                  "year": 2009,
                  "journal": "",
                  "title": "A layout algorithm for undirected compound graphs",
                  "tldr": "An algorithm for the layout of undirected compound graphs based on the traditional force-directed layout scheme with extensions to handle multi-level nesting, edges between nodes of arbitrary nesting levels, varying node sizes, and other possible application-specific constraints is presented.",
                  "url": "https://www.semanticscholar.org/paper/abf6e992494ceaa9b3357b0fe1c81b33574f4101",
                  "venue": "Inf. Sci.",
                  "authors": "_2634668_2082826873_2048203_2498771_2807929",
                  "publicationDate": "2009-03-10"
            },
            {
                  "paperId": "beecc2eb2b2a9754668110d07ab98e52d870ad28",
                  "citationCount": 1004,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 146,
                  "year": 2009,
                  "abstract": "We survey some of the concepts, methods, and applications of community detection, which has become an increasingly important area of network science. To help ease newcomers into the field, we provide a guide to available methodology and open problems, and discuss why scientists from diverse backgrounds are interested in these problems. As a running theme, we emphasize the connections of community detection to problems in statistical physics and computational optimization.",
                  "journal": "",
                  "title": "Communities in Networks",
                  "tldr": "To help ease newcomers into the field, a guide to available methodology and open problems is provided, and why scientists from diverse backgrounds are interested in community detection is discussed.",
                  "url": "https://www.semanticscholar.org/paper/beecc2eb2b2a9754668110d07ab98e52d870ad28",
                  "venue": "ArXiv",
                  "authors": "_2554498_145667886_1794748",
                  "publicationDate": "2009-02-22"
            },
            {
                  "paperId": "c6aed2ed93d2ca4c16cc442f996f69a632c293ec",
                  "citationCount": 44,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 25,
                  "year": 2008,
                  "abstract": "Abstract graphs or networks are a commonly recurring data type in many fields. In order to visualize such graphs effectively, the graph must be laid out on the screen coherently. Many algorithms exist to do this, but many of these algorithms tend to be very slow when the input graph is large. This paper presents a new approach to the large graph layout problem, which quickly generates an effective layout. This new method proceeds by generating a clustering hierarchy for the graph, applying a treemap to this hierarchy, and finally placing the graph vertices in their associated regions in the treemap. It is ideal for interactive systems where operations such as semantic zooming are to be performed, since most of the work is done in the initial hierarchy calculation, and it takes very little work to recalculate the layout. This method is also valuable in that the resulting layout can be used as the input to an iterative algorithm (e.g., a force directed method), which greatly reduces the number of iterations required to converge to a near optimal layout.",
                  "journal": "",
                  "title": "A Treemap Based Method for Rapid Layout of Large Graphs",
                  "tldr": "A new approach to the large graph layout problem is presented, which quickly generates an effective layout and can be used as the input to an iterative algorithm (e.g., a force directed method), which greatly reduces the number of iterations required to converge to a near optimal layout.",
                  "url": "https://www.semanticscholar.org/paper/c6aed2ed93d2ca4c16cc442f996f69a632c293ec",
                  "venue": "2008 IEEE Pacific Visualization Symposium",
                  "authors": "_1726219_1707383",
                  "publicationDate": "2008-03-05"
            },
            {
                  "paperId": "780cbd901bbd712298e72af0f84babdc5e84ef03",
                  "citationCount": 52,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 100,
                  "year": 2007,
                  "abstract": "This paper describes a user study examining the eects of dierent spatial layouts on human sociogram perception. The study compares the relative eectiveness of ve sociogram drawing conventions in communicating the underlying network substance, based on task performance and user preference. The impact of edge crossings is also explored by using social network specic tasks. Both quantitative and qualitative methods are employed in the study.",
                  "journal": "",
                  "title": "Effects of Sociogram Drawing Conventions and Edge Crossings in Social Network Visualization",
                  "tldr": "The study compares the relative eectiveness of sociogram drawing conventions in communicating the underlying network substance based on task performance and user preference and explores the impact of edge crossings by using social network specic tasks.",
                  "url": "https://www.semanticscholar.org/paper/780cbd901bbd712298e72af0f84babdc5e84ef03",
                  "venue": "J. Graph Algorithms Appl.",
                  "authors": "_1696796_122630789_1815562"
            },
            {
                  "paperId": "eafd6773379c2fe0e839d35f9a982e11d95b5b72",
                  "citationCount": 135,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 43,
                  "year": 2006,
                  "abstract": "Despite extensive research, it is still difficult to produce effective interactive layouts for large graphs. Dense layout and occlusion make food Webs, ontologies and social networks difficult to understand and interact with. We propose a new interactive visual analytics component called TreePlus that is based on a tree-style layout. TreePlus reveals the missing graph structure with visualization and interaction while maintaining good readability. To support exploration of the local structure of the graph and gathering of information from the extensive reading of labels, we use a guiding metaphor of plant a seed and watch it grow. It allows users to start with a node and expand the graph as needed, which complements the classic overview techniques that can be effective at (but often limited to) revealing clusters. We describe our design goals, describe the interface and report on a controlled user study with 28 participants comparing TreePlus with a traditional graph interface for six tasks. In general, the advantage of TreePlus over the traditional interface increased as the density of the displayed data increased. Participants also reported higher levels of confidence in their answers with TreePlus and most of them preferred TreePlus",
                  "journal": "",
                  "title": "TreePlus: Interactive Exploration of Networks with Enhanced Tree Layouts",
                  "tldr": "The advantage of TreePlus over the traditional interface increased as the density of the displayed data increased and participants also reported higher levels of confidence in their answers with TreePlus and most of them preferred TreePlus.",
                  "url": "https://www.semanticscholar.org/paper/eafd6773379c2fe0e839d35f9a982e11d95b5b72",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_49132427_8594851_1764846_1799187_35025007_2926253_2064516736",
                  "publicationDate": "2006-11-01"
            },
            {
                  "paperId": "4d40d2c99f8d2f40169ca914515fdf26d7740967",
                  "citationCount": 130,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 23,
                  "year": 2006,
                  "journal": "",
                  "title": "Improved Circular Layouts",
                  "tldr": "Three independent, complementary techniques for lowering the density and improving the readability of circular layouts are suggested, able to reduce clutter, density and crossings compared with existing methods.",
                  "url": "https://www.semanticscholar.org/paper/4d40d2c99f8d2f40169ca914515fdf26d7740967",
                  "venue": "GD",
                  "authors": "_1725593_1701121",
                  "publicationDate": "2006-09-18"
            },
            {
                  "paperId": "e6987da6dc412f22ca5dd62da2affdcdd8e51d8e",
                  "citationCount": 1066,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 30,
                  "year": 2006,
                  "abstract": "A compound graph is a frequently encountered type of data set. Relations are given between items, and a hierarchy is defined on the items as well. We present a new method for visualizing such compound graphs. Our approach is based on visually bundling the adjacency edges, i.e., non-hierarchical edges, together. We realize this as follows. We assume that the hierarchy is shown via a standard tree visualization method. Next, we bend each adjacency edge, modeled as a B-spline curve, toward the polyline defined by the path via the inclusion edges from one node to another. This hierarchical bundling reduces visual clutter and also visualizes implicit adjacency edges between parent nodes that are the result of explicit adjacency edges between their respective child nodes. Furthermore, hierarchical edge bundling is a generic method which can be used in conjunction with existing tree visualization techniques. We illustrate our technique by providing example visualizations and discuss the results based on an informal evaluation provided by potential users of such visualizations",
                  "journal": "",
                  "title": "Hierarchical Edge Bundles: Visualization of Adjacency Relations in Hierarchical Data",
                  "tldr": "This paper presents a new method for visualizing compound graphs based on visually bundling the adjacency edges, i.e., non-hierarchical edges, together and discusses the results based on an informal evaluation provided by potential users of such visualizations.",
                  "url": "https://www.semanticscholar.org/paper/e6987da6dc412f22ca5dd62da2affdcdd8e51d8e",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_34943770",
                  "publicationDate": "2006-09-01"
            },
            {
                  "paperId": "d5e71778fce58565ed17ce8b96b81fea6ddc42c3",
                  "citationCount": 128,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 22,
                  "year": 2005,
                  "abstract": "We investigate the use of elastic hierarchies for representing trees, where a single graphical depiction uses a hybrid mixture, or interleaving, of more basic forms at different nodes of the tree. In particular, we explore combinations of node link and treemap forms, to combine the space efficiency of treemaps with the structural clarity of node link diagrams. A taxonomy is developed to characterize the design space of such hybrid combinations. A software prototype is described, which we used to explore various techniques for visualizing, browsing and interacting with elastic hierarchies, such as side by side overview and detail views, highlighting and rubber banding across views, visualization of multiple foci, and smooth animations across transitions. The paper concludes with a discussion of the characteristics of elastic hierarchies and suggestions for research on their properties and uses.",
                  "journal": "",
                  "title": "Elastic hierarchies: combining treemaps and node-link diagrams",
                  "tldr": "This work investigates the use of elastic hierarchies for representing trees, where a single graphical depiction uses a hybrid mixture, or interleaving, of more basic forms at different nodes of the tree, and explores combinations of node link and treemap forms.",
                  "url": "https://www.semanticscholar.org/paper/d5e71778fce58565ed17ce8b96b81fea6ddc42c3",
                  "venue": "IEEE Symposium on Information Visualization, 2005. INFOVIS 2005.",
                  "authors": "_2645457_3197167_1796394",
                  "publicationDate": "2005-10-23"
            },
            {
                  "paperId": "82038c93e6e803fad5804f2c82a8e74a657c4c31",
                  "citationCount": 330,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 14,
                  "year": 2005,
                  "journal": "",
                  "title": "On the Readability of Graphs Using Node-Link and Matrix-Based Representations: A Controlled Experiment and Statistical Analysis",
                  "tldr": "A taxonomy of generic graph related tasks along with a computer-based evaluation designed to assess the readability of two representations of graphs: matrix-based representations and node-link diagrams are described.",
                  "url": "https://www.semanticscholar.org/paper/82038c93e6e803fad5804f2c82a8e74a657c4c31",
                  "venue": "Inf. Vis.",
                  "authors": "_143976491_144381703_2355234",
                  "publicationDate": "2005-06-01"
            },
            {
                  "paperId": "4effb869de6edd5e6e7e1ec476ab402fa9d28c55",
                  "citationCount": 408,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 12,
                  "year": 2004,
                  "abstract": "In this paper, we describe a taxonomy of generic graph related tasks and an evaluation aiming at assessing the readability of two representations of graphs: matrix-based representations and node-link diagrams. This evaluation bears on seven generic tasks and leads to important recommendations with regard to the representation of graphs according to their size and density. For instance, we show that when graphs are bigger than twenty vertices, the matrix-based visualization performs better than node-link diagrams on most tasks. Only path finding is consistently in favor of node-link diagrams throughout the evaluation",
                  "journal": "",
                  "title": "A Comparison of the Readability of Graphs Using Node-Link and Matrix-Based Representations",
                  "tldr": "It is shown that when graphs are bigger than twenty vertices, the matrix-based visualization performs better than node- link diagrams on most tasks, and only path finding is consistently in favor of node-link diagrams throughout the evaluation.",
                  "url": "https://www.semanticscholar.org/paper/4effb869de6edd5e6e7e1ec476ab402fa9d28c55",
                  "venue": "IEEE Information Visualization Conference",
                  "authors": "_143976491_144381703_2355234",
                  "publicationDate": "2004-10-10"
            },
            {
                  "paperId": "3a4e9d39bd2df177b3af3ebed608042cd4691e5a",
                  "citationCount": 323,
                  "referenceCount": 21,
                  "year": 2003,
                  "journal": "",
                  "title": "Clustering and information in correlation based financial networks",
                  "tldr": "It is found that the type of growth which is responsible for creating cycles in the graph sets in much earlier for the empirical asset graph than for the random graph, and thus reflects the high degree of networking present in the market.",
                  "url": "https://www.semanticscholar.org/paper/3a4e9d39bd2df177b3af3ebed608042cd4691e5a",
                  "authors": "_145667886_145670814_3141455",
                  "publicationDate": "2003-12-29"
            },
            {
                  "paperId": "2f61d741ac23a1f385e5c03f6b21547eacc0964c",
                  "citationCount": 7,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 51,
                  "year": 2020,
                  "abstract": "The size of available graphs has drastically increased in recent years. The real-time visualization of graphs with millions of edges is a challenge but is necessary to grasp information hidden in huge datasets. This article presents an end-to-end technique to visualize huge graphs using an established Big Data ecosystem and a lightweight client running in a Web browser. For that purpose, levels of abstraction and graph tiles are generated by a batch layer and the interactive visualization is provided using a serving layer and client-side real-time computation of edge bundling and graph splatting. A major challenge is to create techniques that work without moving data to an ad hoc system and that take advantage of the horizontal scalability of these infrastructures. We introduce two novel scalable algorithms that enable to generate a canopy clustering and to aggregate graph edges. These two algorithms are both used to produce levels of abstraction and graph tiles. We prove that our technique guarantee a quality of visualization by controlling both the necessary bandwidth required for data transfer and the quality of the produced visualization. Furthermore, we demonstrate the usability of our technique by providing a complete prototype. We present benchmarks on graphs with millions of elements and we compare our results to those obtained by state of the art techniques. Our results show that new Big Data technologies can be incorporated into visualization pipeline to push out the size limits of graphs one can visually analyze.",
                  "journal": "",
                  "title": "Cornac: Tackling Huge Graph Visualization with Big Data Infrastructure",
                  "tldr": "The results show that new Big Data technologies can be incorporated into visualization pipeline to push out the size limits of graphs one can visually analyze.",
                  "url": "https://www.semanticscholar.org/paper/2f61d741ac23a1f385e5c03f6b21547eacc0964c",
                  "venue": "IEEE Transactions on Big Data",
                  "authors": "_2272149_2460043",
                  "publicationDate": "2020-03-01"
            },
            {
                  "paperId": "729918363e5775a004f379293fbb068d9155a319",
                  "citationCount": 6,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 104,
                  "year": 2020,
                  "abstract": "The outbreak of coronavirus disease (COVID-19) has swept across more than 180 countries and territories since late January 2020. As a worldwide emergency response, governments have implemented various measures and policies, such as self-quarantine, travel restrictions, work from home, and regional lockdown, to control the spread of the epidemic. These countermeasures seek to restrict human mobility because COVID-19 is a highly contagious disease that is spread by human-to-human transmission. Medical experts and policymakers have expressed the urgency to effectively evaluate the outcome of human restriction policies with the aid of big data and information technology. Thus, based on big human mobility data and city POI data, an interactive visual analytics system called Epidemic Mobility (EpiMob) was designed in this study. The system interactively simulates the changes in human mobility and infection status in response to the implementation of a certain restriction policy or a combination of policies (e.g., regional lockdown, telecommuting, screening). Users can conveniently designate the spatial and temporal ranges for different mobility restriction policies. Then, the results reflecting the infection situation under different policies are dynamically displayed and can be flexibly compared and analyzed in depth. Multiple case studies consisting of interviews with domain experts were conducted in the largest metropolitan area of Japan (i.e., Greater Tokyo Area) to demonstrate that the system can provide insight into the effects of different human mobility restriction policies for epidemic control, through measurements and comparisons.",
                  "journal": "",
                  "title": "EpiMob: Interactive Visual Analytics of CitywideHuman Mobility Restrictions for Epidemic Control",
                  "tldr": "An interactive visual analytics system based on big human mobility data and city POI data called Epidemic Mobility (EpiMob) was designed in this study to demonstrate that the system can provide insight into the effects of different human mobility restriction policies for epidemic control.",
                  "url": "https://www.semanticscholar.org/paper/729918363e5775a004f379293fbb068d9155a319",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_2128680549_46962297_1699198_31279896_40628376_1736944_1721111",
                  "publicationDate": "2020-07-07"
            },
            {
                  "paperId": "6d7e3dbb6cf874a0e6d0ca648c9e67490e6413f3",
                  "citationCount": 28,
                  "year": 2021,
                  "title": "ColorBrewer",
                  "url": "https://www.semanticscholar.org/paper/6d7e3dbb6cf874a0e6d0ca648c9e67490e6413f3"
            },
            {
                  "paperId": "e1890582b5e45df812d4bffac848ffda98a495e1",
                  "citationCount": 21278,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 29,
                  "year": 2020,
                  "abstract": "Abstract Background Since December 2019, when coronavirus disease 2019 (Covid-19) emerged in Wuhan city and rapidly spread throughout China, data have been needed on the clinical characteristics of the affected patients. Methods We extracted data regarding 1099 patients with laboratory-confirmed Covid-19 from 552 hospitals in 30 provinces, autonomous regions, and municipalities in mainland China through January 29, 2020. The primary composite end point was admission to an intensive care unit (ICU), the use of mechanical ventilation, or death. Results The median age of the patients was 47 years; 41.9% of the patients were female. The primary composite end point occurred in 67 patients (6.1%), including 5.0% who were admitted to the ICU, 2.3% who underwent invasive mechanical ventilation, and 1.4% who died. Only 1.9% of the patients had a history of direct contact with wildlife. Among nonresidents of Wuhan, 72.3% had contact with residents of Wuhan, including 31.3% who had visited the city. The most common symptoms were fever (43.8% on admission and 88.7% during hospitalization) and cough (67.8%). Diarrhea was uncommon (3.8%). The median incubation period was 4 days (interquartile range, 2 to 7). On admission, ground-glass opacity was the most common radiologic finding on chest computed tomography (CT) (56.4%). No radiographic or CT abnormality was found in 157 of 877 patients (17.9%) with nonsevere disease and in 5 of 173 patients (2.9%) with severe disease. Lymphocytopenia was present in 83.2% of the patients on admission. Conclusions During the first 2 months of the current outbreak, Covid-19 spread rapidly throughout China and caused varying degrees of illness. Patients often presented without fever, and many did not have abnormal radiologic findings. (Funded by the National Health Commission of China and others.)",
                  "journal": "",
                  "title": "Clinical Characteristics of Coronavirus Disease 2019 in China",
                  "tldr": "During the first 2 months of the current outbreak, Covid-19 spread rapidly throughout China and caused varying degrees of illness, and patients often presented without fever, and many did not have abnormal radiologic findings.",
                  "url": "https://www.semanticscholar.org/paper/e1890582b5e45df812d4bffac848ffda98a495e1",
                  "venue": "New England Journal of Medicine",
                  "authors": "_40527353_1510934695_2117972483_2113674110_6082350_153146864_2150801388_144713402_35547703_145414689_2064619241_2117550695_153202505_145537748_9842917_15720036_1624168812_82127949_51036064_2118325136_2116563124_51105152_1596643937_2113553733_2144384819_2113663721_144189266_2144499303_1596529507_2144171709_1516868042_120964391_1510844634_2116782941_1596634018_1596650009_46761241",
                  "publicationDate": "2020-02-28"
            },
            {
                  "paperId": "7ebe99282b42e0c22ed4d595b782c84b390a90c1",
                  "citationCount": 4,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 29,
                  "year": 2017,
                  "abstract": "Heuristic evaluation technique is a classical evaluation method in Human-Computer Interaction area. Researchers and software developers broadly use it, given that it is fast, cheap and easy to use. Using it in other areas demands creating a new heuristic set able to identify common problems of these areas. Information Visualization (InfoVis) researchers commonly use this technique with the original usability heuristic set proposed by Nielsen, which does not cover many relevant aspects of InfoVis. InfoVis literature presents sets of guidelines that cover InfoVis concepts, but it does not present most of them as heuristics, or they cover much specific concepts. This work presents a method for defining a set of InfoVis heuristics for use in heuristic evaluation. The method clusters heuristics and guidelines found in a literature review, and creates a new heuristic set based on each group. As a result, we created a new set of 15 generic heuristics, from a set of 62 ones, which we hypothesize that will help evaluators to take into account a broad set of visualization aspects during evaluation with possibly less cognitive effort.",
                  "journal": "",
                  "title": "Adapting Heuristic Evaluation to Information Visualization - A Method for Defining a Heuristic Set by Heuristic Grouping",
                  "tldr": "A method for defining a set of InfoVis heuristics for use in heuristic evaluation is presented, which hypothesize will help evaluators to take into account a broad set of visualization aspects during evaluation with possibly less cognitive effort.",
                  "url": "https://www.semanticscholar.org/paper/7ebe99282b42e0c22ed4d595b782c84b390a90c1",
                  "venue": "VISIGRAPP",
                  "authors": "_10733003_153711877",
                  "publicationDate": "2017-08-22"
            },
            {
                  "paperId": "c7cff02f75d3bfe9763160ea1b80d3f99d4c3ed2",
                  "citationCount": 33,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 49,
                  "year": 2015,
                  "journal": "",
                  "title": "Drawing Large Graphs by Multilevel Maxent-Stress Optimization",
                  "tldr": "A novel multilevel algorithm to compute a graph layout with respect to the maxent-stress metric proposed by Gansner et al. (2013) that combines layout stress and entropy is presented.",
                  "url": "https://www.semanticscholar.org/paper/c7cff02f75d3bfe9763160ea1b80d3f99d4c3ed2",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1732161_1714834_40262967",
                  "publicationDate": "2015-06-14"
            },
            {
                  "paperId": "6db92b763b3d892e5df36b037d044a2cce7905ef",
                  "citationCount": 19,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 9,
                  "year": 2018,
                  "abstract": "The wide adoption of social networks has brought a new demand on influence analysis. This paper presents OCTOPUS that offers social network users and analysts valuable insights through topic-aware social influence analysis services. OCTOPUS has the following novel features. First, OCTOPUS provides a user-friendly interface that allows users to employ simple and easy-to-use keywords to perform influence analysis. Second, OCTOPUS provides three powerful keyword-based topic-aware influence analysis tools: keyword-based influential user discovery, personalized influential keywords suggestion, and interactive influential paths exploration. These tools can not only discover influential users, but also provide insights on how the users influence the network. Third, OCTOPUS enables online influence analysis, which provides end-users with instant results. We have implemented and deployed OCTOPUS, and demonstrate its usability and efficiency on two social networks.",
                  "journal": "",
                  "title": "OCTOPUS: An Online Topic-Aware Influence Analysis System for Social Networks",
                  "tldr": "OCTOPUS is presented that offers social network users and analysts valuable insights through topic-aware social influence analysis services through a user-friendly interface that allows users to employ simple and easy-to-use keywords to perform influence analysis.",
                  "url": "https://www.semanticscholar.org/paper/6db92b763b3d892e5df36b037d044a2cce7905ef",
                  "venue": "2018 IEEE 34th International Conference on Data Engineering (ICDE)",
                  "authors": "_1704755170_47902984_1823512389_2112723334_2712862_47949377_145472073_144589756",
                  "publicationDate": "2018-04-16"
            },
            {
                  "paperId": "a3e8d90e8490d99093236b2c4b96c4c4a5ce9ef1",
                  "citationCount": 13,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 45,
                  "year": 2019,
                  "abstract": "In the last decade, there has been an exponential growth of asynchronous online conversations (e.g. blogs), thanks to the rise of social media. Analyzing and gaining insights from such discussions can be quite challenging for a user, especially when the user deals with hundreds of comments that are scattered around multiple different conversations. A promising solution to this problem is to automatically mine the major topics from conversations and organize them into a hierarchical structure. However, the resultant topic hierarchy can be noisy and/or it may not match the user’s current information needs. To address this problem, we introduce a novel human-in-the-loop approach that allows the user to revise the topic hierarchy based on her feedback. We incorporate this approach within a visual text analytics system that helps users in analyzing and getting insights from conversations by exploring and revising the topic hierarchy. We evaluated the resulting system with real users in a lab-based study. The results from the user study, when compared to its counterpart that does not support interactive revisions of a hierarchical topic model, provide empirical evidence of the potential utility of our system in terms of both performance and subjective measures. Finally, we summarize generalizable lessons for introducing human-in-the-loop computation within a visual text analytics system.",
                  "journal": "",
                  "title": "Interactive topic hierarchy revision for exploring a collection of online conversations",
                  "tldr": "A novel human-in-the-loop approach that allows the user to revise the topic hierarchy based on her feedback is introduced within a visual text analytics system that helps users in analyzing and getting insights from conversations by exploring and revising thetopic hierarchy.",
                  "url": "https://www.semanticscholar.org/paper/a3e8d90e8490d99093236b2c4b96c4c4a5ce9ef1",
                  "venue": "Inf. Vis.",
                  "authors": "_2939577_1825424",
                  "publicationDate": "2019-07-01"
            },
            {
                  "paperId": "efa69373d1d7ce99f81617e3e05566cea5ca0e24",
                  "citationCount": 7,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 32,
                  "year": 2015,
                  "journal": "",
                  "title": "GO: A cluster algorithm for graph visualization",
                  "tldr": "This paper presents a new clustering algorithm that is particularly designed for visualization so as to reduce the visual complexity of a layout, together with a strategy for improving the scalability of the algorithm.",
                  "url": "https://www.semanticscholar.org/paper/efa69373d1d7ce99f81617e3e05566cea5ca0e24",
                  "venue": "J. Vis. Lang. Comput.",
                  "authors": "_1680567_1696796",
                  "publicationDate": "2015-06-01"
            },
            {
                  "paperId": "1bb23fd4252a76b55ff77ed982fc78c3e06d1452",
                  "citationCount": 245,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 128,
                  "year": 2018,
                  "abstract": "False information can be created and spread easily through the web and social media platforms, resulting in widespread real-world impact. Characterizing how false information proliferates on social platforms and why it succeeds in deceiving readers are critical to develop efficient detection algorithms and tools for early detection. A recent surge of research in this area has aimed to address the key issues using methods based on feature engineering, graph mining, and information modeling. Majority of the research has primarily focused on two broad categories of false information: opinion-based (e.g., fake reviews), and fact-based (e.g., false news and hoaxes). Therefore, in this work, we present a comprehensive survey spanning diverse aspects of false information, namely (i) the actors involved in spreading false information, (ii) rationale behind successfully deceiving readers, (iii) quantifying the impact of false information, (iv) measuring its characteristics across different dimensions, and finally, (iv) algorithms developed to detect false information. In doing so, we create a unified framework to describe these recent methods and highlight a number of important directions for future research.",
                  "journal": "",
                  "title": "False Information on Web and Social Media: A Survey",
                  "tldr": "A comprehensive survey spanning diverse aspects of false information is presented, namely the actors involved in spreading false information, rationale behind successfully deceiving readers, quantifying the impact offalse information, and algorithms developed to detect false information.",
                  "url": "https://www.semanticscholar.org/paper/1bb23fd4252a76b55ff77ed982fc78c3e06d1452",
                  "venue": "ArXiv",
                  "authors": "_39703734_145474474",
                  "publicationDate": "2018-04-23"
            },
            {
                  "paperId": "4c74ed130534600624a2db5e1102d994fd680a35",
                  "citationCount": 3,
                  "year": 2018,
                  "journal": "",
                  "title": "Revisit",
                  "url": "https://www.semanticscholar.org/paper/4c74ed130534600624a2db5e1102d994fd680a35",
                  "venue": "A Practical Guide to Enquiry-Based Primary Teaching",
                  "authors": "_118287981",
                  "publicationDate": "2018-11-01"
            },
            {
                  "paperId": "8a9415cd76753fef1b455f78f4bcbe86a02f7c8c",
                  "citationCount": 1,
                  "referenceCount": 15,
                  "year": 2018,
                  "journal": "",
                  "title": "Diffusive Phenomena in Dynamic Networks: A Data-Driven Study",
                  "tldr": "This work compares the behaviors of classical spreading models when used to analyze a given social network whose topological dynamics are observed at different temporal granularities and provides an alternative formulation of two classical diffusion models.",
                  "url": "https://www.semanticscholar.org/paper/8a9415cd76753fef1b455f78f4bcbe86a02f7c8c",
                  "authors": "_2650673_37340414_1693341_1685102",
                  "publicationDate": "2018-03-05"
            },
            {
                  "paperId": "0cd9b2ef1ead9bea120ac67503140df60b7d1cf6",
                  "citationCount": 241,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 167,
                  "year": 2017,
                  "abstract": "Dynamic graph visualization focuses on the challenge of representing the evolution of relationships between entities in readable, scalable and effective diagrams. This work surveys the growing number of approaches in this discipline. We derive a hierarchical taxonomy of techniques by systematically categorizing and tagging publications. While static graph visualizations are often divided into node‐link and matrix representations, we identify the representation of time as the major distinguishing feature for dynamic graph visualizations: either graphs are represented as animated diagrams or as static charts based on a timeline. Evaluations of animated approaches focus on dynamic stability for preserving the viewers mental map or, in general, compare animated diagrams to timeline‐based ones. A bibliographic analysis provides insights into the organization and development of the field and its community. Finally, we identify and discuss challenges for future research. We also provide feedback from experts, collected with a questionnaire, which gives a broad perspective of these challenges and the current state of the field.",
                  "journal": "",
                  "title": "A Taxonomy and Survey of Dynamic Graph Visualization",
                  "tldr": "A hierarchical taxonomy of techniques is derived by systematically categorizing and tagging publications and identifying the representation of time as the major distinguishing feature for dynamic graph visualizations.",
                  "url": "https://www.semanticscholar.org/paper/0cd9b2ef1ead9bea120ac67503140df60b7d1cf6",
                  "venue": "Computer graphics forum (Print)",
                  "authors": "_46905197_144484816_1680836_69863469",
                  "publicationDate": "2017-01-01"
            },
            {
                  "paperId": "7ba050aa995c9293a1e224a46f3463088d33bf68",
                  "citationCount": 5,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 31,
                  "year": 2017,
                  "abstract": "In a recent SIGMOD paper titled Debunking the Myths of Influence Maximization: An In-Depth Benchmarking Study, Arora et al. [1] undertake a performance benchmarking study of several well-known algorithms for influence maximization. In the process, they contradict several published results, and claim to have unearthed and debunked several myths that existed around the research of influence maximization. It is the goal of this article to examine their claims objectively and critically, and refute the erroneous ones. Our investigation discovers that first, the overall experimental methodology in Arora et al. [1] is flawed and leads to scientifically incorrect conclusions. Second, the paper [1] is riddled with issues specific to a variety of influence maximization algorithms, including buggy experiments, and draws many misleading conclusions regarding those algorithms. Importantly, they fail to appreciate the trade-off between running time and solution quality, and did not incorporate it correctly in their experimental methodology. In this article, we systematically point out the issues present in [1] and refute 11 of their misclaims.",
                  "journal": "",
                  "title": "Refutations on Debunking the Myths of Influence Maximization: An In-Depth Benchmarking Study",
                  "tldr": "The investigation discovers that first, the overall experimental methodology in Arora et al.",
                  "url": "https://www.semanticscholar.org/paper/7ba050aa995c9293a1e224a46f3463088d33bf68",
                  "venue": "ArXiv",
                  "authors": "_2153424520_33285410_145784723_2112440523_1708593",
                  "publicationDate": "2017-05-15"
            },
            {
                  "paperId": "9e86700f379fa8c00a9c7d59a0883a6a9513b870",
                  "citationCount": 65,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 43,
                  "year": 2014,
                  "abstract": "In this paper, we present a graph partitioning algorithm to partition graphs with trillions of edges. To achieve such scale, our solution leverages the vertex-centric Pregel abstraction provided by Giraph, a system for large-scale graph analytics. We designed our algorithm to compute partitions with high locality and fair balance, and focused on the characteristics necessary to reach wide adoption by practitioners in production. Our solution can (i) scale to massive graphs and thousands of compute cores, (ii) efficiently adapt partitions to changes to graphs and compute environments, and (iii) seamlessly integrate in existing systems without additional infrastructure. We evaluate our solution on the Facebook and Instagram graphs, as well as on other large-scale, real-world graphs. We show that it is scalable and computes partitionings with quality comparable, and sometimes outperforming, existing solutions. By integrating the computed partitionings in Giraph, we speedup various real-world applications by up to a factor of 5.6 compared to default hash-partitioning.",
                  "journal": "",
                  "title": "Spinner: Scalable Graph Partitioning in the Cloud",
                  "tldr": "This paper designs a graph partitioning algorithm to partition graphs with trillions of edges that leverages the vertex-centric Pregel abstraction provided by Giraph, a system for large-scale graph analytics.",
                  "url": "https://www.semanticscholar.org/paper/9e86700f379fa8c00a9c7d59a0883a6a9513b870",
                  "venue": "IEEE International Conference on Data Engineering",
                  "authors": "_3244826_40024798_1737053",
                  "publicationDate": "2014-04-15"
            },
            {
                  "paperId": "252d4a906f05e75f4bc816137144d72d96988193",
                  "citationCount": 122,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 50,
                  "year": 2016,
                  "journal": "",
                  "title": "Locating influential nodes in complex networks",
                  "tldr": "This work capitalize on the properties of the K-truss decomposition, a triangle-based extension of the core decomposition of graphs, to locate individual influential nodes and indicates that the nodes belonging to the maximal K- Truss subgraph show better spreading behavior compared to previously used importance criteria, leading to faster and wider epidemic spreading.",
                  "url": "https://www.semanticscholar.org/paper/252d4a906f05e75f4bc816137144d72d96988193",
                  "venue": "Scientific reports",
                  "authors": "_2817467_2840531_1690383",
                  "publicationDate": "2016-01-18"
            },
            {
                  "paperId": "11fe69d9677d62d96dcca860d6f48df2687006c9",
                  "citationCount": 22,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 19,
                  "year": 2016,
                  "abstract": "The increase in analysis of real life social networks has led to a better understanding of the ways humans socialize in a group. Since trust is an important part of any social interaction, researchers use such networks to understand the nuances of trust relationships. One of the major requirements in trust applications is identifying the trustworthy actors in these networks. This paper proposes a pair of complementary measures that can be used to measure trust scores of actors in a social network using involvement of social networks. Based on the proposed measures, an iterative matrix convergence algorithm is developed that calculates the trustingness and the trustworthiness of each actor in the network. Trustingness of an actor is defined as the propensity of an actor to trust his neighbors in the network. Trustworthiness, on the other hand, is defined as the willingness of the network to trust an individual actor. The algorithm is proposed based on the idea that a person having higher trustingness score contributes to the trustworthiness of its neighbors to a lower degree. Conversely, a higher trustworthiness score is a result of lots of neighbors linked to the actor having low trustingness scores. The algorithm runs in O(k × |E|) time where k denotes the number of iterations and |E| denotes the number of edges in the network. Moreover, the paper shows that the algorithm converges to a finite value quickly. Finally the proposed scores for trust prediction is implemented for various social networks and is shown that the proposed algorithm performs better (average 5%) than the state of the art trust scoring algorithms. The full version of the paper along with the coding implementation can be found at [3].",
                  "journal": "",
                  "title": "Trustingness & trustworthiness: A pair of complementary trust measures in a social network",
                  "tldr": "A pair of complementary measures that can be used to measure trust scores of actors in a social network using involvement of social networks are proposed and an iterative matrix convergence algorithm is developed that calculates the trustingness and the trustworthiness of each actor in the network.",
                  "url": "https://www.semanticscholar.org/paper/11fe69d9677d62d96dcca860d6f48df2687006c9",
                  "venue": "2016 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM)",
                  "authors": "_143922076_39946066_144235071_3290129",
                  "publicationDate": "2016-08-18"
            },
            {
                  "paperId": "2299f57e7a8bbf2c24c5a5303035925470df5821",
                  "citationCount": 24,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 16,
                  "year": 2016,
                  "abstract": "The key challenges of visualizing social interaction data include the difficulties of understanding the general structure of social interactions and representing the data in the context of various user activities to reveal different behavior patterns. The design of the proposed interactive visualization tool Episogram is based on an anatomy of social interaction process in which the actors and objects involved can be formally represented as a time-varying tripartite network. The authors show the effectiveness of the proposed technique using real-world datasets and user studies.",
                  "journal": "",
                  "title": "Episogram: Visual Summarization of Egocentric Social Interactions",
                  "tldr": "The design of the proposed interactive visualization tool Episogram is based on an anatomy of social interaction process in which the actors and objects involved can be formally represented as a time-varying tripartite network.",
                  "url": "https://www.semanticscholar.org/paper/2299f57e7a8bbf2c24c5a5303035925470df5821",
                  "venue": "IEEE Computer Graphics and Applications",
                  "authors": "_144313415_34821764_37298954_1490970698",
                  "publicationDate": "2016-09-01"
            },
            {
                  "paperId": "2d58434a5a5c92033d5c479f7ffa22822e3b9e0d",
                  "citationCount": 78,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 49,
                  "year": 2014,
                  "abstract": "In this paper, we present a visual analytics approach that provides decision makers with a proactive and predictive environment in order to assist them in making effective resource allocation and deployment decisions. The challenges involved with such predictive analytics processes include end-users understanding, and the application of the underlying statistical algorithms at the right spatiotemporal granularity levels so that good prediction estimates can be established. In our approach, we provide analysts with a suite of natural scale templates and methods that enable them to focus and drill down to appropriate geospatial and temporal resolution levels. Our forecasting technique is based on the Seasonal Trend decomposition based on Loess (STL) method, which we apply in a spatiotemporal visual analytics context to provide analysts with predicted levels of future activity. We also present a novel kernel density estimation technique we have developed, in which the prediction process is influenced by the spatial correlation of recent incidents at nearby locations. We demonstrate our techniques by applying our methodology to Criminal, Traffic and Civil (CTC) incident datasets.",
                  "journal": "",
                  "title": "Proactive Spatiotemporal Resource Allocation and Predictive Visual Analytics for Community Policing and Law Enforcement",
                  "tldr": "A visual analytics approach that provides decision makers with a proactive and predictive environment in order to assist them in making effective resource allocation and deployment decisions and a novel kernel density estimation technique that is influenced by the spatial correlation of recent incidents at nearby locations are presented.",
                  "url": "https://www.semanticscholar.org/paper/2d58434a5a5c92033d5c479f7ffa22822e3b9e0d",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_2599852_1786514_152281810_34922264_33449182",
                  "publicationDate": "2014-11-06"
            },
            {
                  "paperId": "7f7c9c928515e8484ad2889459208a39eb3b3ab2",
                  "citationCount": 157,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 34,
                  "year": 2014,
                  "abstract": "Temporal event sequence data is increasingly commonplace, with applications ranging from electronic medical records to financial transactions to social media activity. Previously developed techniques have focused on low-dimensional datasets (e.g., with less than 20 distinct event types). Real-world datasets are often far more complex. This paper describes DecisionFlow, a visual analysis technique designed to support the analysis of high-dimensional temporal event sequence data (e.g., thousands of event types). DecisionFlow combines a scalable and dynamic temporal event data structure with interactive multi-view visualizations and ad hoc statistical analytics. We provide a detailed review of our methods, and present the results from a 12-person user study. The study results demonstrate that DecisionFlow enables the quick and accurate completion of a range of sequence analysis tasks for datasets containing thousands of event types and millions of individual events.",
                  "journal": "",
                  "title": "DecisionFlow: Visual Analytics for High-Dimensional Temporal Event Sequence Data",
                  "tldr": "The study results demonstrate that DecisionFlow enables the quick and accurate completion of a range of sequence analysis tasks for datasets containing thousands of event types and millions of individual events.",
                  "url": "https://www.semanticscholar.org/paper/7f7c9c928515e8484ad2889459208a39eb3b3ab2",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1714488_2581366",
                  "publicationDate": "2014-11-06"
            },
            {
                  "paperId": "9f0f85c57f796445cdc2ad16bf021edd5a7091ca",
                  "citationCount": 18,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 35,
                  "year": 2014,
                  "abstract": "We present strategic portgraph rewriting as a basis for the implementation of visual modelling and analysis tools. The goal is to facilitate the specification, analysis and simulation of complex systems, using port graphs. A system is represented by an initial graph and a collection of graph rewriting rules, together with a user-defined strategy to control the application of rules. The strategy language includes constructs to deal with graph traversal and management of rewriting positions in the graph. We give a small-step operational semantics for the language, and describe its implementation in the graph transformation and visualisation tool PORGY.",
                  "journal": "",
                  "title": "Strategic Port Graph Rewriting: An Interactive Modelling and Analysis Framework",
                  "tldr": "This work presents strategic portgraph rewriting as a basis for the implementation of visual modelling and analysis tools, and gives a small-step operational semantics for the language, and describes its implementation in the graph transformation and visualisation tool PORGY.",
                  "url": "https://www.semanticscholar.org/paper/9f0f85c57f796445cdc2ad16bf021edd5a7091ca",
                  "venue": "Conference on Computer Graphics and Interactive Techniques in Australasia and Southeast Asia",
                  "authors": "_144258850_145490472_2100834",
                  "publicationDate": "2014-04-05"
            },
            {
                  "paperId": "e9200586af209324a4bd7a8ae80712650ce07ae4",
                  "citationCount": 34,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 58,
                  "year": 2014,
                  "journal": "",
                  "title": "Viral marketing for dedicated customers",
                  "tldr": "This paper proposes a new paradigm of viral marketing where the company can specify which types of users in the social network are of interest when promoting a specific product, and develops an approximate algorithm which can provide error guarantees for J-MIN-Seed, which is NP-hard.",
                  "url": "https://www.semanticscholar.org/paper/e9200586af209324a4bd7a8ae80712650ce07ae4",
                  "venue": "Inf. Syst.",
                  "authors": "_143671461_1723745",
                  "publicationDate": "2014-12-01"
            },
            {
                  "paperId": "8616f667541e15194f80efe51ba6fe70dc7ebf81",
                  "citationCount": 59,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 28,
                  "year": 2014,
                  "abstract": "Visualizing sets to reveal relationships between constituent elements is a complex representational problem. Recent research presents several automated placement and grouping techniques to highlight connections between set elements. However, these techniques do not scale well for sets with cardinality greater than one hundred elements. We present OnSet, an interactive, scalable visualization technique for representing large-scale binary set data. The visualization technique defines a single, combined domain of elements for all sets, and models each set by the elements that it both contains and does not contain. OnSet employs direct manipulation interaction and visual highlighting to support easy identification of commonalities and differences as well as membership patterns across different sets of elements. We present case studies to illustrate how the technique can be successfully applied across different domains such as bio-chemical metabolomics and task and event scheduling.",
                  "journal": "",
                  "title": "OnSet: A Visualization Technique for Large-scale Binary Set Data",
                  "tldr": "OnSet is presented, an interactive, scalable visualization technique for representing large-scale binary set data that employs direct manipulation interaction and visual highlighting to support easy identification of commonalities and differences as well as membership patterns across different sets of elements.",
                  "url": "https://www.semanticscholar.org/paper/8616f667541e15194f80efe51ba6fe70dc7ebf81",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_2119571_12231155_143746804_1691661",
                  "publicationDate": "2014-12-01"
            },
            {
                  "paperId": "87ee57c4915c5f7c5c7b9486df0c8af7e31bd747",
                  "citationCount": 3009,
                  "publicationTypes": "Conference",
                  "year": 2016,
                  "abstract": "In the recent years, micro blogging platforms like Twitter have become instrumental in gauging public mood. So it makes it a feasible predictive strategy to speculate the rise and fall of stock prices. This paper aims to undertake a stepwise methodology to determine the effects of an average persons tweets over fluctuation of stock prices of a multinational firm called Samsung Electronics Ltd. It involves extracting tweets from twitter, data cleansing and application of a suitable algorithm in order to get the adequate sentiment analysis. The vast impact created by twitter data feed has been greatly studied in this paper. Attempts have been made to design an algorithm which works well analysing the positive, negative and neutral tweets.",
                  "journal": "",
                  "title": "Opinion mining and sentiment analysis",
                  "tldr": "This paper aims to undertake a stepwise methodology to determine the effects of an average persons tweets over fluctuation of stock prices of a multinational firm called Samsung Electronics Ltd.",
                  "url": "https://www.semanticscholar.org/paper/87ee57c4915c5f7c5c7b9486df0c8af7e31bd747",
                  "venue": "International Conference on Computing for Sustainable Global Development",
                  "authors": "_13996086_2074891035_50592897_2060326506",
                  "publicationDate": "2016-03-16"
            },
            {
                  "paperId": "74994aaddccffe70a779cc14df1cc2d6f7f6caea",
                  "citationCount": 151,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 40,
                  "year": 2013,
                  "abstract": "Analyzing large textual collections has become increasingly challenging given the size of the data available and the rate that more data is being generated. Topic-based text summarization methods coupled with interactive visualizations have presented promising approaches to address the challenge of analyzing large text corpora. As the text corpora and vocabulary grow larger, more topics need to be generated in order to capture the meaningful latent themes and nuances in the corpora. However, it is difficult for most of current topic-based visualizations to represent large number of topics without being cluttered or illegible. To facilitate the representation and navigation of a large number of topics, we propose a visual analytics system - HierarchicalTopic (HT). HT integrates a computational algorithm, Topic Rose Tree, with an interactive visual interface. The Topic Rose Tree constructs a topic hierarchy based on a list of topics. The interactive visual interface is designed to present the topic content as well as temporal evolution of topics in a hierarchical fashion. User interactions are provided for users to make changes to the topic hierarchy based on their mental model of the topic space. To qualitatively evaluate HT, we present a case study that showcases how HierarchicalTopics aid expert users in making sense of a large number of topics and discovering interesting patterns of topic groups. We have also conducted a user study to quantitatively evaluate the effect of hierarchical topic structure. The study results reveal that the HT leads to faster identification of large number of relevant topics. We have also solicited user feedback during the experiments and incorporated some suggestions into the current version of HierarchicalTopics.",
                  "journal": "",
                  "title": "HierarchicalTopics: Visually Exploring Large Text Collections Using Topic Hierarchies",
                  "tldr": "A case study is presented that showcases how HierarchicalTopics aid expert users in making sense of a large number of topics and discovering interesting patterns of topic groups, and a user study is conducted to quantitatively evaluate the effect of hierarchical topic structure.",
                  "url": "https://www.semanticscholar.org/paper/74994aaddccffe70a779cc14df1cc2d6f7f6caea",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1778084_2149483553_2118774683_2116417009_49907592",
                  "publicationDate": "2013-12-01"
            },
            {
                  "paperId": "4bc31853ab9de45df2e03a0ea991f89d9449e42b",
                  "citationCount": 597,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 54,
                  "year": 2013,
                  "abstract": "X-Stream is a system for processing both in-memory and out-of-core graphs on a single shared-memory machine. While retaining the scatter-gather programming model with state stored in the vertices, X-Stream is novel in (i) using an edge-centric rather than a vertex-centric implementation of this model, and (ii) streaming completely unordered edge lists rather than performing random access. This design is motivated by the fact that sequential bandwidth for all storage media (main memory, SSD, and magnetic disk) is substantially larger than random access bandwidth. We demonstrate that a large number of graph algorithms can be expressed using the edge-centric scatter-gather model. The resulting implementations scale well in terms of number of cores, in terms of number of I/O devices, and across different storage media. X-Stream competes favorably with existing systems for graph processing. Besides sequential access, we identify as one of the main contributors to better performance the fact that X-Stream does not need to sort edge lists during preprocessing.",
                  "journal": "",
                  "title": "X-Stream: edge-centric graph processing using streaming partitions",
                  "tldr": "X-Stream is novel in using an edge-centric rather than a vertex-centric implementation of this model, and streaming completely unordered edge lists rather than performing random access, and competes favorably with existing systems for graph processing.",
                  "url": "https://www.semanticscholar.org/paper/4bc31853ab9de45df2e03a0ea991f89d9449e42b",
                  "venue": "SOSP",
                  "authors": "_14610544_35111103_1711100",
                  "publicationDate": "2013-11-03"
            },
            {
                  "paperId": "258c6257ed9f27cb5c7b94bce57351e610d8474e",
                  "citationCount": 9,
                  "referenceCount": 56,
                  "year": 2014,
                  "journal": "",
                  "title": "How Do You Connect Moving Dots? Insights from User Studies on Dynamic Network Visualizations",
                  "tldr": "This work evaluated visual analytics techniques for dynamic networks during their development, performing intermediate evaluations by means of mock-up and eye-tracking studies and a final evaluation of the running interactive prototype, traceing three pathways of development in detail.",
                  "url": "https://www.semanticscholar.org/paper/258c6257ed9f27cb5c7b94bce57351e610d8474e",
                  "venue": "Handbook of Human Centric Visualization",
                  "authors": "_2370912_145674284_3112363_1696098_2593413_1692521"
            },
            {
                  "paperId": "e472957e0af8118f5dd29b006a4a17987ff4b625",
                  "citationCount": 928,
                  "publicationTypes": "Review",
                  "referenceCount": 103,
                  "year": 2010,
                  "abstract": "Human behaviour plays an important role in the spread of infectious diseases, and understanding the influence of behaviour on the spread of diseases can be key to improving control efforts. While behavioural responses to the spread of a disease have often been reported anecdotally, there has been relatively little systematic investigation into how behavioural changes can affect disease dynamics. Mathematical models for the spread of infectious diseases are an important tool for investigating and quantifying such effects, not least because the spread of a disease among humans is not amenable to direct experimental study. Here, we review recent efforts to incorporate human behaviour into disease models, and propose that such models can be broadly classified according to the type and source of information which individuals are assumed to base their behaviour on, and according to the assumed effects of such behaviour. We highlight recent advances as well as gaps in our understanding of the interplay between infectious disease dynamics and human behaviour, and suggest what kind of data taking efforts would be helpful in filling these gaps.",
                  "journal": "",
                  "title": "Modelling the influence of human behaviour on the spread of infectious diseases: a review",
                  "tldr": "Recent efforts to incorporate human behaviour into disease models are reviewed, and it is proposed that such models can be broadly classified according to the type and source of information which individuals are assumed to base their behaviour on, andAccording to the assumed effects of such behaviour.",
                  "url": "https://www.semanticscholar.org/paper/e472957e0af8118f5dd29b006a4a17987ff4b625",
                  "venue": "Journal of the Royal Society Interface",
                  "authors": "_2262177_3046313_39075362",
                  "publicationDate": "2010-09-06"
            },
            {
                  "paperId": "799f1ddc00f6813fc937dc281f9874e09c528e3b",
                  "citationCount": 103,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 25,
                  "year": 2011,
                  "abstract": "Detection of emerging topics is now receiving renewed interest motivated by the rapid growth of social networks. Conventional-term-frequency-based approaches may not be appropriate in this context, because the information exchanged in social-network posts include not only text but also images, URLs, and videos. We focus on emergence of topics signaled by social aspects of theses networks. Specifically, we focus on mentions of users--links between users that are generated dynamically (intentionally or unintentionally) through replies, mentions, and retweets. We propose a probability model of the mentioning behavior of a social network user, and propose to detect the emergence of a new topic from the anomalies measured through the model. Aggregating anomaly scores from hundreds of users, we show that we can detect emerging topics only based on the reply/mention relationships in social-network posts. We demonstrate our technique in several real data sets we gathered from Twitter. The experiments show that the proposed mention-anomaly-based approaches can detect new topics at least as early as text-anomaly-based approaches, and in some cases much earlier when the topic is poorly identified by the textual contents in posts.",
                  "journal": "",
                  "title": "Discovering Emerging Topics in Social Streams via Link-Anomaly Detection",
                  "tldr": "This work proposes a probability model of the mentioning behavior of a social network user, and proposes to detect the emergence of a new topic from the anomalies measured through the model, which can detect emerging topics only based on the reply/mention relationships in social-network posts.",
                  "url": "https://www.semanticscholar.org/paper/799f1ddc00f6813fc937dc281f9874e09c528e3b",
                  "venue": "IEEE Transactions on Knowledge and Data Engineering",
                  "authors": "_2117191458_2870603_34755863",
                  "publicationDate": "2011-10-13"
            },
            {
                  "paperId": "f134d026032538968185abaeab7871984cf84c3f",
                  "citationCount": 1934,
                  "referenceCount": 40,
                  "year": 2012,
                  "abstract": "We present the qgraph package for R, which provides an interface to visualize data through network modeling techniques. For instance, a correlation matrix can be represented as a network in which each variable is a node and each correlation an edge; by varying the width of the edges according to the magnitude of the correlation, the structure of the correlation matrix can be visualized. A wide variety of matrices that are used in statistics can be represented in this fashion, for example matrices that contain (implied) covariances, factor loadings, regression parameters and p values. qgraph can also be used as a psychometric tool, as it performs exploratory and confirmatory factor analysis, using sem and lavaan; the output of these packages is automatically visualized in qgraph, which may aid the interpretation of results. In this article, we introduce qgraph by applying the package functions to data from the NEO-PI-R, a widely used personality questionnaire.",
                  "journal": "",
                  "title": "Qgraph: Network visualizations of relationships in psychometric data",
                  "tldr": "The qgraph package for R is presented, which provides an interface to visualize data through network modeling techniques, and is introduced by applying the package functions to data from the NEO-PI-R, a widely used personality questionnaire.",
                  "url": "https://www.semanticscholar.org/paper/f134d026032538968185abaeab7871984cf84c3f",
                  "authors": "_3018477_5138971_2936830_3229169_3237553",
                  "publicationDate": "2012-05-24"
            },
            {
                  "paperId": "7fdc03495fa1690c008ce06179c727be8a71ea52",
                  "citationCount": 9,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 24,
                  "year": 2012,
                  "journal": "",
                  "title": "Planar Preprocessing for Spring Embedders",
                  "tldr": "The effect of using various plane initial drawings as an inputs to a spring embedder is studied, measuring the percent improvement in reducing crossings and in increasing node separation, edge length uniformity, and angular resolution.",
                  "url": "https://www.semanticscholar.org/paper/7fdc03495fa1690c008ce06179c727be8a71ea52",
                  "venue": "GD",
                  "authors": "_145462821_9374807",
                  "publicationDate": "2012-09-19"
            },
            {
                  "paperId": "43e3a15e0b2ac55542ef0614e92165272bddb040",
                  "citationCount": 121,
                  "referenceCount": 16,
                  "year": 2013,
                  "abstract": "Although extensive studies have been conducted on top of online social networks (OSNs), it is not clear how to characterise information propagation and social influence, two types of important but not well defined social behaviour. This paper presents a measurement study of 58 M messages collected from 700 K users on Twitter.com, a popular social medium. We analyse the propagation patterns of general messages and show how breaking news (Michael Jackson’s death) spread through Twitter. Furthermore, we evaluate different social influences by examining their stabilities, assessments, and correlations. This paper addresses the complications and challenges we encounter when measuring message propagation and social influence on OSNs. We believe that our results here provide valuable insights for future OSN research.",
                  "title": "Measuring message propagation and social influence on Twitter",
                  "tldr": "This paper presents a measurement study of 58 M messages collected from 700 K users on Twitter.com, a popular social medium, and analyzes different social influences by examining their stabilities, assessments, and correlations.",
                  "url": "https://www.semanticscholar.org/paper/43e3a15e0b2ac55542ef0614e92165272bddb040",
                  "authors": "_2090416832"
            },
            {
                  "paperId": "51ec8194cff157eb712382d589174909e087acf8",
                  "citationCount": 537,
                  "publicationTypes": "Book",
                  "referenceCount": 33,
                  "year": 2011,
                  "abstract": "Little research exists on one of the most common, oldest, and most utilized forms of online social geographic information: the location field found in most virtual community user profiles. We performed the first in-depth study of user behavior with regard to the location field in Twitter user profiles. We found that 34% of users did not provide real location information, frequently incorporating fake locations or sarcastic comments that can fool traditional geographic information tools. When users did input their location, they almost never specified it at a scale any more detailed than their city. In order to determine whether or not natural user behaviors have a real effect on the locatability of users, we performed a simple machine learning experiment to determine whether we can identify a users location by only looking at what that user tweets. We found that a users country and state can in fact be determined easily with decent accuracy, indicating that users implicitly reveal location information, with or without realizing it. Implications for location-based services and privacy are discussed.",
                  "journal": "",
                  "title": "Tweets from Justin Biebers heart: the dynamics of the location field in user profiles",
                  "tldr": "The first in-depth study of user behavior with regard to the location field in Twitter user profiles found that a users country and state can in fact be determined easily with decent accuracy, indicating that users implicitly reveal location information, with or without realizing it.",
                  "url": "https://www.semanticscholar.org/paper/51ec8194cff157eb712382d589174909e087acf8",
                  "venue": "International Conference on Human Factors in Computing Systems",
                  "authors": "_32980371_2217278_3994427_2226805",
                  "publicationDate": "2011-05-07"
            },
            {
                  "paperId": "f3da640b7902c96f75977f9f05cde753b82f9c09",
                  "citationCount": 1045,
                  "year": 2011,
                  "journal": "",
                  "title": "United States Census Bureau",
                  "url": "https://www.semanticscholar.org/paper/f3da640b7902c96f75977f9f05cde753b82f9c09",
                  "authors": "_71766834",
                  "publicationDate": "2011-12-19"
            },
            {
                  "paperId": "12b28ba9461b3e5ec95dbb9f8c42088f6b28cf31",
                  "citationCount": 54,
                  "publicationTypes": "Review",
                  "referenceCount": 142,
                  "year": 2013,
                  "abstract": "Across many types of tasks, our ability to process multiple objects or locations at once is limited by a finite processing resource. This chapter describes 15 classic examples of such resources limits. The chapter then reviews evidence suggesting that this resource primarily reflects competition for representation, across two types of representation. First, limits on the identification of objects may reflect competition within networks that represent object identity (the ventral visual stream). Second, limits on the selection of multiple locations may reflect competition between selected locations within representations of visual space (the dorsal visual stream). This definition of visual resources provides a parsimonious explanation for many effects in the visual cognition literature, and it makes concrete predictions about manipulations that should affect performance across a wide variety of visual tasks.",
                  "journal": "",
                  "title": "The Nature and Status of Visual Resources",
                  "tldr": "This definition of visual resources provides a parsimonious explanation for many effects in the visual cognition literature, and it makes concrete predictions about manipulations that should affect performance across a wide variety of visual tasks.",
                  "url": "https://www.semanticscholar.org/paper/12b28ba9461b3e5ec95dbb9f8c42088f6b28cf31",
                  "authors": "_1836170",
                  "publicationDate": "2013-03-11"
            },
            {
                  "paperId": "130b32280d64422971c9bf9866b047dc824e2047",
                  "citationCount": 1447,
                  "year": 2013,
                  "title": "What is Twitter",
                  "url": "https://www.semanticscholar.org/paper/130b32280d64422971c9bf9866b047dc824e2047",
                  "authors": "_15181932"
            },
            {
                  "paperId": "aed52f2ac21cd5a09bc60b0bdb84993c416fec36",
                  "citationCount": 151,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 54,
                  "year": 2010,
                  "abstract": "As data sources become larger and more complex, the ability to effectively explore and analyze patterns among varying sources becomes a critical bottleneck in analytic reasoning. Incoming data contain multiple variables, high signal-to-noise ratio, and a degree of uncertainty, all of which hinder exploration, hypothesis generation/exploration, and decision making. To facilitate the exploration of such data, advanced tool sets are needed that allow the user to interact with their data in a visual environment that provides direct analytic capability for finding data aberrations or hotspots. In this paper, we present a suite of tools designed to facilitate the exploration of spatiotemporal data sets. Our system allows users to search for hotspots in both space and time, combining linked views and interactive filtering to provide users with contextual information about their data and allow the user to develop and explore their hypotheses. Statistical data models and alert detection algorithms are provided to help draw user attention to critical areas. Demographic filtering can then be further applied as hypotheses generated become fine tuned. This paper demonstrates the use of such tools on multiple geospatiotemporal data sets.",
                  "journal": "",
                  "title": "A Visual Analytics Approach to Understanding Spatiotemporal Hotspots",
                  "tldr": "A suite of tools designed to facilitate the exploration of spatiotemporal data sets is presented, combining linked views and interactive filtering to provide users with contextual information about their data and allow the user to develop and explore their hypotheses.",
                  "url": "https://www.semanticscholar.org/paper/aed52f2ac21cd5a09bc60b0bdb84993c416fec36",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1786514_144401301_50428757_2603013_6378303_2168047_35157864_2121453_33449182",
                  "publicationDate": "2010-03-01"
            },
            {
                  "paperId": "ecba7abfbd2a59fafef9610b5e4ed8a5781bc000",
                  "citationCount": 720,
                  "year": 2013,
                  "journal": "",
                  "title": "Centers for Disease Control and Prevention(CDC)での生活",
                  "url": "https://www.semanticscholar.org/paper/ecba7abfbd2a59fafef9610b5e4ed8a5781bc000",
                  "authors": "_2075164899",
                  "publicationDate": "2013-04-01"
            },
            {
                  "paperId": "4fa5f021b860dab8007da1acdd0fcc69df930290",
                  "citationCount": 48,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 34,
                  "year": 2009,
                  "abstract": "Visualizing large-scale online social network is a challenging yet essential task. This paper presents HiMap, a system that visualizes it by clustered graph via hierarchical grouping and summarization. HiMap employs a novel adaptive data loading technique to accurately control the visual density of each graph view, and along with the optimized layout algorithm and the two kinds of edge bundling methods, to effectively avoid the visual clutter commonly found in previous social network visualization tools. HiMap also provides an integrated suite of interactions to allow the users to easily navigate the social map with smooth and coherent view transitions to keep their momentum. Finally, we confirm the effectiveness of HiMap algorithms through graph-travesal based evaluations.",
                  "journal": "",
                  "title": "HiMap: Adaptive visualization of large-scale online social networks",
                  "tldr": "This paper presents HiMap, a system that visualizes it by clustered graph via hierarchical grouping and summarization using a novel adaptive data loading technique and provides an integrated suite of interactions to allow the users to easily navigate the social map with smooth and coherent view transitions to keep their momentum.",
                  "url": "https://www.semanticscholar.org/paper/4fa5f021b860dab8007da1acdd0fcc69df930290",
                  "venue": "2009 IEEE Pacific Visualization Symposium",
                  "authors": "_2117204931_144313415_48641970_32944882_2106348133_2110430906_1738536_1689953",
                  "publicationDate": "2009-04-20"
            },
            {
                  "paperId": "422494a3c7e6bdbc6e467aebbc2f101f5c3d5f1b",
                  "citationCount": 1572,
                  "referenceCount": 1,
                  "year": 2012,
                  "abstract": "For whatever reason consciousness evolved, our awareness of ourselves in our ecological niche would be expected to be experienced as compatible. The industrial revolution challenged this compatibility because many individuals worked and lived in inhumane conditions. The technological revolution provides another (less compelling) challenge to this compatibility. Donald A. Normans goal is to help relieve feelings of incompatibility by putting the blame on the poor design of everyday things in our environment rather than on ourselves. When we fail to deal appropriately with our environment of water faucets, doors, and VCRs, we usually blame ourselves. Norman demonstrates that much of the blame should be placed on the designer and, in so doing, illustrates once again that psychology is relevant to our everyday life. Theories developed and tested in the laboratory can be used to rationalize behavioral successes and failures in everyday life. Although the book seeks to show that the incompatibility is due to the environment and not the participant, it does not address the reason that we blame ourselves. Perhaps our psychology might also speak to this issue as well as the other.",
                  "title": "The Psychology of Everyday Things",
                  "url": "https://www.semanticscholar.org/paper/422494a3c7e6bdbc6e467aebbc2f101f5c3d5f1b",
                  "authors": "_145109055_144343609_108800937"
            },
            {
                  "paperId": "b0b08e739aa5a674430c54e4e7e540ce81ea5b2a",
                  "citationCount": 916,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 31,
                  "year": 2009,
                  "abstract": "In large social networks, nodes (users, entities) are influenced by others for various reasons. For example, the colleagues have strong influence on ones work, while the friends have strong influence on ones daily life. How to differentiate the social influences from different angles(topics)? How to quantify the strength of those social influences? How to estimate the model on real large networks?\n To address these fundamental questions, we propose Topical Affinity Propagation (TAP) to model the topic-level social influence on large networks. In particular, TAP can take results of any topic modeling and the existing network structure to perform topic-level influence propagation. With the help of the influence analysis, we present several important applications on real data sets such as 1) what are the representative nodes on a given topic? 2) how to identify the social influences of neighboring nodes on a particular node?\n To scale to real large networks, TAP is designed with efficient distributed learning algorithms that is implemented and tested under the Map-Reduce framework. We further present the common characteristics of distributed learning algorithms for Map-Reduce. Finally, we demonstrate the effectiveness and efficiency of TAP on real large data sets.",
                  "journal": "",
                  "title": "Social influence analysis in large-scale networks",
                  "tldr": "Topical Affinity Propagation (TAP) is designed with efficient distributed learning algorithms that is implemented and tested under the Map-Reduce framework and can take results of any topic modeling and the existing network structure to perform topic-level influence propagation.",
                  "url": "https://www.semanticscholar.org/paper/b0b08e739aa5a674430c54e4e7e540ce81ea5b2a",
                  "venue": "Knowledge Discovery and Data Mining",
                  "authors": "_46199760_1738536_2116628808_2111906216",
                  "publicationDate": "2009-06-28"
            },
            {
                  "paperId": "0899073a12cd970bb8dffa1e9f9b47a29cd996ff",
                  "citationCount": 25,
                  "publicationTypes": "JournalArticle",
                  "year": 2007,
                  "abstract": "Recent developments in information systems technologies have resulted in computerizing many applications in various business areas. Data has become a critical resource in many organizations, and therefore, efficient access to data, sharing the data, extracting information from the data, and making use of the information has become an urgent need. As a result, there have been many efforts on not only integrating the various data sources scattered across several sites, but extracting information from these databases in the form of patterns and trends has also become important. These data sources may be databases managed by database management systems, or they could be data warehoused in a repository from multiple data sources.",
                  "journal": "",
                  "title": "Building Trustworthy Semantic Webs",
                  "tldr": "Information systems technologies have resulted in computerizing many applications in various business areas, and extracting information from these databases in the form of patterns and trends has also become important.",
                  "url": "https://www.semanticscholar.org/paper/0899073a12cd970bb8dffa1e9f9b47a29cd996ff",
                  "venue": "IRI",
                  "authors": "_72558235",
                  "publicationDate": "2007-12-05"
            },
            {
                  "paperId": "d48a86b59a29bab943e6fbf63877fa5c9dcf26f1",
                  "citationCount": 366,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 32,
                  "year": 2008,
                  "abstract": "In this paper, we study the spread of influence through a social network, in a model initially studied by Kempe, Kleinberg and Tardos [14, 15]: We are given a graph modeling a social network, where each node v has a (fixed) threshold tv, such that the node will adopt a new product if tv of its neighbors adopt it. Our goal is to find a small set S of nodes such that targeting the product to S would lead to adoption of the product by a large number of nodes in the graph.\n We show strong inapproximability results for several variants of this problem. Our main result says that the problem of minimizing the size of S, while ensuring that targeting S would influence the whole network into adopting the product, is hard to approximate within a polylogarithmic factor. This implies similar results if only a fixed fraction of the network is ensured to adopt the product. Further, the hardness of approximation result continues to hold when all nodes have majority thresholds, or have constant degree and threshold two. The latter answers a complexity question proposed in [10, 29]. We also give some positive results for more restricted cases, such as when the underlying graph is a tree.",
                  "journal": "",
                  "title": "On the approximability of influence in social networks",
                  "tldr": "The main result says that the problem of minimizing the size of S, while ensuring that targeting S would influence the whole network into adopting the product, is hard to approximate within a polylogarithmic factor.",
                  "url": "https://www.semanticscholar.org/paper/d48a86b59a29bab943e6fbf63877fa5c9dcf26f1",
                  "venue": "ACM-SIAM Symposium on Discrete Algorithms",
                  "authors": "_144354006",
                  "publicationDate": "2008-01-20"
            },
            {
                  "paperId": "76af6552c9c710281d07700e93c7cf46e275d9a1",
                  "citationCount": 188,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 19,
                  "year": 2007,
                  "journal": "",
                  "title": "MatLink: Enhanced Matrix Visualization for Analyzing Social Networks",
                  "tldr": "This article presents MatLink, a hybrid representation with links overlaid on the borders of a matrix and dynamic topological feedback as the pointer moves that showed significant advantages for most tasks, especially path-related ones where standard matrices are weak.",
                  "url": "https://www.semanticscholar.org/paper/76af6552c9c710281d07700e93c7cf46e275d9a1",
                  "venue": "IFIP TC13 International Conference on Human-Computer Interaction",
                  "authors": "_1692395_144381703",
                  "publicationDate": "2007-09-10"
            },
            {
                  "paperId": "03231c89ecfd4790914bba49f188ac5ce69230f1",
                  "citationCount": 217,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 14,
                  "year": 2007,
                  "abstract": "We consider the combinatorial optimization problem of finding the most influential nodes on a large-scale social network for two widely-used fundamental stochastic diffusion models. It was shown that a natural greedy strategy can give a good approximate solution to this optimization problem. However, a conventional method under the greedy algorithm needs a large amount of computation, since it estimates the marginal gains for the expected number of nodes influenced by a set of nodes by simulating the random process of each model many times. In this paper, we propose a method of efficiently estimating all those quantities on the basis of bond percolation and graph theory, and apply it to approximately solving the optimization problem under the greedy algorithm. Using real-world large-scale networks including blog networks, we experimentally demonstrate that the proposed method can outperform the conventional method, and achieve a large reduction in computational cost.",
                  "journal": "",
                  "title": "Extracting Influential Nodes for Information Diffusion on a Social Network",
                  "tldr": "This paper proposes a method of efficiently estimating all those quantities on the basis of bond percolation and graph theory, and applies it to approximately solving the optimization problem under the greedy algorithm, and demonstrates that it can outperform the conventional method, and achieve a large reduction in computational cost.",
                  "url": "https://www.semanticscholar.org/paper/03231c89ecfd4790914bba49f188ac5ce69230f1",
                  "venue": "AAAI",
                  "authors": "_145632693_1727070_1763517",
                  "publicationDate": "2007-07-22"
            },
            {
                  "paperId": "2114078c887ebba6a81a8c5d1f0d7bb8f622f433",
                  "citationCount": 718,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 37,
                  "year": 2008,
                  "journal": "",
                  "title": "On variants of shortest-path betweenness centrality and their generic computation",
                  "tldr": "In this paper, a number of variants are reviewed, placed into context, and shown to be computable with simple variants of the algorithm commonly used for the standard case.",
                  "url": "https://www.semanticscholar.org/paper/2114078c887ebba6a81a8c5d1f0d7bb8f622f433",
                  "venue": "Soc. Networks",
                  "authors": "_1689559",
                  "publicationDate": "2008-05-01"
            },
            {
                  "paperId": "09044fcac95489b0ee5cef903cd9e050714112e4",
                  "citationCount": 161,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 70,
                  "year": 2008,
                  "abstract": "Information visualization (InfoVis) is now an accepted and growing field, but questions remain about the best uses for and the maturity of novel visualizations. Usability studies and controlled experiments are helpful, but generalization is difficult. We believe that the systematic development of benchmarks will facilitate the comparison of techniques and help identify their strengths under different conditions. We were involved in the organization and management of three InfoVis contests for the 2003, 2004, and 2005 IEEE InfoVis Symposia, which requested teams to report on insights gained while exploring data. We give a summary of the state of the art of evaluation in InfoVis, describe the three contests, summarize their results, discuss outcomes and lessons learned, and conjecture the future of visualization contests. All materials produced by the contests are archived in the InfoVis benchmark repository.",
                  "journal": "",
                  "title": "Promoting Insight-Based Evaluation of Visualizations: From Contest to Benchmark Repository",
                  "tldr": "A summary of the state of the art of evaluation in InfoVis is given, and the systematic development of benchmarks will facilitate the comparison of techniques and help identify their strengths under different conditions.",
                  "url": "https://www.semanticscholar.org/paper/09044fcac95489b0ee5cef903cd9e050714112e4",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1764846_144381703_48590079"
            },
            {
                  "paperId": "cb258b326e6de1fcc95abd989825a28828d66f1f",
                  "citationCount": 29,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 31,
                  "year": 2006,
                  "abstract": "We introduce an interactive graph generator, GreenSketch, designed to facilitate the creation of descriptive graphs required for different visual analytics tasks. The human-centric design approach of GreenSketch enables users to master the creation process without specific training or prior knowledge of graph model theory. The customized user interface encourages users to gain insight into the connection between the compact matrix representation and the topology of a graph layout when they sketch their graphs. Both the human-enforced and machine-generated randomnesses supported by GreenSketch provide the flexibility needed to address the uncertainty factor in many analytical tasks. This paper describes more than two dozen examples that cover a wide variety of graph creations from a single line of nodes to a real-life small-world network that describes a snapshot of telephone connections. While the discussion focuses mainly on the design of GreenSketch, we include a case study that applies the technology in a visual analytics environment and a usability study that evaluates the strengths and weaknesses of our design approach",
                  "journal": "",
                  "title": "Generating Graphs for Visual Analytics through Interactive Sketching",
                  "tldr": "An interactive graph generator, GreenSketch, designed to facilitate the creation of descriptive graphs required for different visual analytics tasks is introduced and the human-centric design approach enables users to master the creation process without specific training or prior knowledge of graph model theory.",
                  "url": "https://www.semanticscholar.org/paper/cb258b326e6de1fcc95abd989825a28828d66f1f",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_9881377_145553092_144084221_40377038_144465343",
                  "publicationDate": "2006-11-01"
            },
            {
                  "paperId": "6e5bdd048285862688718f5a8ce63cedd5a96a48",
                  "citationCount": 164,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 89,
                  "year": 2004,
                  "journal": "",
                  "title": "Multilevel Refinement for Combinatorial Optimisation Problems",
                  "tldr": "The issue of multilevel refinement for combinatorial optimisation problems is addressed and a case is made for its use as a metaheuristic, with the aid of examples and results in graph partitioning, graph colouring and the travelling salesman problem.",
                  "url": "https://www.semanticscholar.org/paper/6e5bdd048285862688718f5a8ce63cedd5a96a48",
                  "venue": "Ann. Oper. Res.",
                  "authors": "_1798877",
                  "publicationDate": "2004-10-01"
            },
            {
                  "paperId": "bab2df1ed212dcc9de74aeb3225b25bea7c23bbb",
                  "citationCount": 383,
                  "publicationTypes": "Review",
                  "referenceCount": 37,
                  "year": 2003,
                  "journal": "",
                  "title": "Planning for smallpox outbreaks",
                  "tldr": "This work reviews the use of models in smallpox planning within the broader epidemiological context set by recent outbreaks of both novel and re-emerging pathogens.",
                  "url": "https://www.semanticscholar.org/paper/bab2df1ed212dcc9de74aeb3225b25bea7c23bbb",
                  "venue": "Nature",
                  "authors": "_1766275_1783305_7151802_14562441_2275517_145424340_47424234",
                  "publicationDate": "2003-10-16"
            },
            {
                  "paperId": "d7c5ace20b07669323611abfbd4c79bc0c9b9a03",
                  "citationCount": 995,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 23,
                  "year": 2005,
                  "journal": "",
                  "title": "Influential Nodes in a Diffusion Model for Social Networks",
                  "tldr": "A natural and general model of influence propagation that is generalizing models used in the sociology and economics communities, and shows that in the decreasing cascade model, a natural greedy algorithm is a 1-1/ e-e approximation for selecting a target set of size k.",
                  "url": "https://www.semanticscholar.org/paper/d7c5ace20b07669323611abfbd4c79bc0c9b9a03",
                  "venue": "International Colloquium on Automata, Languages and Programming",
                  "authors": "_1765196_3371403_1746222",
                  "publicationDate": "2005-07-11"
            },
            {
                  "paperId": "6e55267cdd368ada94dee79711103d11fc59fa6c",
                  "citationCount": 217,
                  "year": 2000,
                  "journal": "",
                  "title": "Atlas of Cancer Mortality in the United States 1950-94",
                  "url": "https://www.semanticscholar.org/paper/6e55267cdd368ada94dee79711103d11fc59fa6c",
                  "authors": "_80586916_40280227_143911529",
                  "publicationDate": "2000-07-01"
            },
            {
                  "paperId": "491fa6915fdd7a2d83f8c31432db0503743adb95",
                  "citationCount": 1376,
                  "year": 2002,
                  "journal": "",
                  "title": "Small World",
                  "url": "https://www.semanticscholar.org/paper/491fa6915fdd7a2d83f8c31432db0503743adb95",
                  "authors": "_153121908",
                  "publicationDate": "2002-03-21"
            },
            {
                  "paperId": "18f910f755ac1ced2d8a644a50c7fdb200836b60",
                  "citationCount": 5378,
                  "referenceCount": 35,
                  "year": 2010,
                  "abstract": "Written by the three pioneers behind the Unified Modeling Language (UML) standard, The Unified Modeling Language Reference Manual provides an excellent real-world guide to working with UML. This title provides expert knowledge on all facets of todays UML standard, helping developers who are encountering UML on the job for the first time to be more productive. The book begins with a history of UML, from structured design methods of the 60s and 70s to the competing object-oriented design standards that were unified in 1997 to create UML. For the novice, the authors illustrate key diagram types such as class, use case, state machine, activity, and implementation. (Of course, learning these basic diagram types is what UML is all about. The authors use an easy-to-understand ticket-booking system for many of their examples.) After a tour of basic document types, The Unified Modeling Language Reference Manual provides an alphabetical listing of more than 350 UML terms. Entries range from a sentence or two to several pages in length. (Class, operation, and use case are just a few of the important terms that are covered.) Though you will certainly need to be acquainted with software engineering principles, this reference will serve the working software developer well. As the authors note, this isnt UML for Dummies, but neither is it an arcane academic treatise. The authors succeed in delivering a readable reference that will answer any UML question, no matter how common or obscure. --Richard Dragan",
                  "journal": "",
                  "title": "The unified modeling language reference manual",
                  "tldr": "This title provides expert knowledge on all facets of todays UML standard, helping developers who are encountering UML on the job for the first time to be more productive.",
                  "url": "https://www.semanticscholar.org/paper/18f910f755ac1ced2d8a644a50c7fdb200836b60",
                  "authors": "_1718702_34838618_1746499",
                  "publicationDate": "2010-05-03"
            },
            {
                  "paperId": "3e9d14246a6b6c09942779b52a7f4c7bf58378f9",
                  "citationCount": 516,
                  "referenceCount": 3,
                  "year": 1979,
                  "abstract": "In the course of the deliberations of the 1977 Lanchester Prize Committee, Alan J. Goldman brought to our attention an error in the proof of Lemma 1 of our paper (Cornuejols, G., M. L. Fisher, G. L. Nemhauser. 1977. Location of bank accounts to optimize float: an analytic study of exact and approximate algorithms. Management Sci. 23 789-810.). The lemma, however, is true and the original correct, but long and intricate, proof was provided to the Committee, see (Cornuejols, G., M. L. Fisher, G. L. Nemhauser. 1977. On the uncapacitated location problem. Ann. Discrete Math. 1 163-178.) for details.",
                  "journal": "",
                  "title": "Note--On Location of Bank Accounts to Optimize Float: An Analytic Study of Exact and Approximate Algorithms",
                  "tldr": "In the course of the deliberations of the 1977 Lanchester Prize Committee, Alan J. Goldman brought to the authors attention an error in the proof of Lemma 1 of their paper, which is true and the original correct, but long and intricate, proof was provided.",
                  "url": "https://www.semanticscholar.org/paper/3e9d14246a6b6c09942779b52a7f4c7bf58378f9",
                  "authors": "_71533324_145456487_1705564",
                  "publicationDate": "1979-08-01"
            }
      ]
}