{
      "papers": [
            {
                  "paperId": "d132c90d28b8067a1e4026c5c86ac85a922bf95f",
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 62,
                  "year": 2022,
                  "abstract": "In social networks, individuals decisions are strongly influenced by recommendations from their friends, acquaintances, and favorite renowned personalities. The popularity of online social networking platforms makes them the prime venues to advertise products and promote opinions. The Influence Maximization (IM) problem entails selecting a seed set of users that maximizes the influence spread, i.e., the expected number of users positively influenced by a stochastic diffusion process triggered by the seeds. Engineering and analyzing IM algorithms remains a difficult and demanding task due to the NP-hardness of the problem and the stochastic nature of the diffusion processes. Despite several heuristics being introduced, they often fail in providing enough information on how the network topology affects the diffusion process, precious insights that could help researchers improve their seed set selection. In this paper, we present VAIM, a visual analytics system that supports users in analyzing, evaluating, and comparing information diffusion processes determined by different IM algorithms. Furthermore, VAIM provides useful insights that the analyst can use to modify the seed set of an IM algorithm, so to improve its influence spread. We assess our system by: (i)(i) a qualitative evaluation based on a guided experiment with two domain experts on two different data sets; (ii)(ii) a quantitative estimation of the value of the proposed visualization through the ICE-T methodology by Wall et al. (IEEE TVCG - 2018). The twofold assessment indicates that VAIM effectively supports our target users in the visual analysis of the performance of IM algorithms.",
                  "journal": "",
                  "title": "Influence Maximization With Visual Analytics",
                  "tldr": "VAIM is presented, a visual analytics system that supports users in analyzing, evaluating, and comparing information diffusion processes determined by different IM algorithms and provides useful insights that the analyst can use to modify the seed set of an IM algorithm, so to improve its influence spread.",
                  "url": "https://www.semanticscholar.org/paper/d132c90d28b8067a1e4026c5c86ac85a922bf95f",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_34611540_1713172_1716384_1692521_3291006",
                  "publicationDate": "2022-07-13"
            },
            {
                  "paperId": "4192a5dd9ad2e81e8e570c9ee6d64e1f6d573c7f",
                  "citationCount": 3,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 60,
                  "year": 2020,
                  "abstract": "Many real-world networks are globally sparse but locally dense. Typical examples are social networks, biological networks, and information networks. This double structural nature makes it difficult to adopt a homogeneous visualization model that clearly conveys both an overview of the network and the internal structure of its communities at the same time. As a consequence, the use of hybrid visualizations has been proposed. For instance, NodeTrix combines node-link and matrix-based representations (Henry et al., 2007). In this article we describe ChordLink, a hybrid visualization model that embeds chord diagrams, used to represent dense subgraphs, into a node-link diagram, which shows the global network structure. The visualization makes it possible to interactively highlight the structure of a community while keeping the rest of the layout stable. We discuss the intriguing algorithmic challenges behind the ChordLink model, present a prototype system that implements it, and illustrate case studies on real-world networks.",
                  "journal": "",
                  "title": "Hybrid Graph Visualizations With ChordLink: Algorithms, Experiments, and Applications",
                  "tldr": "ChordLink is described, a hybrid visualization model that embeds chord diagrams, used to represent dense subgraphs, into a node-link diagram, which shows the global network structure and makes it possible to interactively highlight the structure of a community while keeping the rest of the layout stable.",
                  "url": "https://www.semanticscholar.org/paper/4192a5dd9ad2e81e8e570c9ee6d64e1f6d573c7f",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_1388409482_1713172_3291006_46194830_7539016",
                  "publicationDate": "2020-08-12"
            },
            {
                  "paperId": "e4061cc4301cb3779134c6c81cf0fed3287406df",
                  "citationCount": 6,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 66,
                  "year": 2020,
                  "journal": "",
                  "title": "On visualization techniques comparison for large social networks overview: A user experiment",
                  "tldr": "Jasper can be seen as an all-encompassing solution for quickly producing legible and compact overviews of large social networks on a single modern computer.",
                  "url": "https://www.semanticscholar.org/paper/e4061cc4301cb3779134c6c81cf0fed3287406df",
                  "venue": "Vis. Informatics",
                  "authors": "_2100834_48362356_2482136",
                  "publicationDate": "2020-12-01"
            },
            {
                  "paperId": "b43256127cd372563291b980a1862f7df8ecaba2",
                  "citationCount": 13,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 33,
                  "year": 2020,
                  "abstract": "Public health officials dealing with pandemics like COVID-19 have to evaluate and prepare response plans. This planning phase requires not only looking into the spatiotemporal dynamics and impact of the pandemic using simulation models, but they also need to plan and ensure the availability of resources under different spread scenarios. To this end, we have developed a visual analytics environment that enables public health officials to model, simulate, and explore the spread of COVID-19 by supplying county-level information such as population, demographics, and hospital beds. This environment facilitates users to explore spatiotemporal model simulation data relevant to COVID-19 through a geospatial map with linked statistical views, apply different decision measures at different points in time, and understand their potential impact. Users can drill-down to county-level details such as the number of sicknesses, deaths, needs for hospitalization, and variations in these statistics over time. We demonstrate the usefulness of this environment through a use case study and also provide feedback from domain experts. We also provide details about future extensions and potential applications of this work.",
                  "journal": "",
                  "title": "A Visual Analytics Based Decision Making Environment for COVID-19 Modeling and Visualization",
                  "tldr": "This work has developed a visual analytics environment that enables public health officials to model, simulate, and explore the spread of COVID-19 by supplying county-level information such as population, demographics, and hospital beds through a geospatial map with linked statistical views.",
                  "url": "https://www.semanticscholar.org/paper/b43256127cd372563291b980a1862f7df8ecaba2",
                  "venue": "Visual ..",
                  "authors": "_2194062_2635216_1400826283_145906801_1761518_48004695",
                  "publicationDate": "2020-10-01"
            },
            {
                  "paperId": "41acfad7b0136859c77687dcc43f801daeecc0f3",
                  "citationCount": 2,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 24,
                  "year": 2020,
                  "journal": "",
                  "title": "VAIM: Visual Analytics for Influence Maximization",
                  "tldr": "VAIM is a visual analytics system that supports users in analyzing the information diffusion process determined by different IM algorithms and can simulate the information spread for a given seed set on a large network and modify the seed sets to improve the corresponding influence spread.",
                  "url": "https://www.semanticscholar.org/paper/41acfad7b0136859c77687dcc43f801daeecc0f3",
                  "venue": "GD",
                  "authors": "_34611540_1713172_1716384_1692521_3291006",
                  "publicationDate": "2020-08-20"
            },
            {
                  "paperId": "22edc9d8bb18253cdbb7905492c73387b4aee8c4",
                  "citationCount": 25,
                  "referenceCount": 10,
                  "year": 2020,
                  "abstract": "The COVID-19 (formerly, 2019-nCoV) epidemic has become a global health emergency, as such, WHO declared PHEIC. China has taken the most hit since the outbreak of the virus, which could be dated as far back as late November by some experts. It was not until January 23rd that the Wuhan government finally recognized the severity of the epidemic and took a drastic measure to curtain the virus spread by closing down all transportation connecting the outside world. In this study, we seek to answer a few questions: How did the virus get spread from the epicenter Wuhan city to the rest of the country? To what extent did the measures, such as, city closure and community quarantine, help controlling the situation? More importantly, can we forecast any significant future development of the event had some of the conditions changed? By collecting and visualizing publicly available data, we first show patterns and characteristics of the epidemic development; we then employ a mathematical model of disease transmission dynamics to evaluate the effectiveness of some epidemic control measures, and more importantly, to offer a few tips on preventive measures.",
                  "journal": "",
                  "title": "Visual Data Analysis and Simulation Prediction for COVID-19",
                  "tldr": "This study seeks to answer a few questions about how did the virus get spread from the epicenter Wuhan city to the rest of the country, and to evaluate the effectiveness of some epidemic control measures.",
                  "url": "https://www.semanticscholar.org/paper/22edc9d8bb18253cdbb7905492c73387b4aee8c4",
                  "venue": "International Journal of Educational Excellence",
                  "authors": "_2028246830_23461814_1492178041_1492179598_150123444_1492178134_2145361446_4525094_144188146_2070017295",
                  "publicationDate": "2020-02-14"
            },
            {
                  "paperId": "240654fdb653a39a4d3f9f6035c3f832f1effe85",
                  "citationCount": 36,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 36,
                  "year": 2019,
                  "abstract": "Recently, an approach for determining the value of a visualization was proposed, one moving beyond simple measurements of task accuracy and speed. The value equation contains components for the time savings a visualization provides, the insights and insightful questions it spurs, the overall essence of the data it conveys, and the confidence about the data and its domain it inspires. This articulation of value is purely descriptive, however, providing no actionable method of assessing a visualizations value. In this work, we create a heuristic-based evaluation methodology to accompany the value equation for assessing interactive visualizations. We refer to the methodology colloquially as ICE-T, based on an anagram of the four value components. Our approach breaks the four components down into guidelines, each of which is made up of a small set of low-level heuristics. Evaluators who have knowledge of visualization design principles then assess the visualization with respect to the heuristics. We conducted an initial trial of the methodology on three interactive visualizations of the same data set, each evaluated by 15 visualization experts. We found that the methodology showed promise, obtaining consistent ratings across the three visualizations and mirroring judgments of the utility of the visualizations by instructors of the course in which they were developed.",
                  "journal": "",
                  "title": "A Heuristic Approach to Value-Driven Evaluation of Visualizations",
                  "tldr": "A heuristic-based evaluation methodology to accompany the value equation for assessing interactive visualizations showed promise, obtaining consistent ratings across the three visualizations and mirroring judgments of the utility of the visualizations by instructors of the course in which they were developed.",
                  "url": "https://www.semanticscholar.org/paper/240654fdb653a39a4d3f9f6035c3f832f1effe85",
                  "venue": "IEEE Transactions on Visualization and Computer Graphics",
                  "authors": "_2065740541_144867797_34636768_3424845_34560661_3200296_1691661",
                  "publicationDate": "2019-01-01"
            },
            {
                  "paperId": "10672e13dfcec206a78170f2dedb80515f999c6a",
                  "citationCount": 28,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 57,
                  "year": 2016,
                  "journal": "",
                  "title": "A Distributed Multilevel Force-Directed Algorithm",
                  "tldr": "Multi-GiLA is presented, the first multilevel force-directed graph visualization algorithm based on a vertex-centric computation paradigm and experiments show that it can be successfully applied to compute high quality layouts of very large graphs on inexpensive cloud computing platforms.",
                  "url": "https://www.semanticscholar.org/paper/10672e13dfcec206a78170f2dedb80515f999c6a",
                  "venue": "IEEE Transactions on Parallel and Distributed Systems",
                  "authors": "_34611540_1713172_1716384_3291006",
                  "publicationDate": "2016-08-30"
            },
            {
                  "paperId": "de5e4c789209dfed61d427675e20ccf7362b9375",
                  "citationCount": 310,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 120,
                  "year": 2018,
                  "abstract": "Influence Maximization (IM), which selects a set of k  users (called seed set) from a social network to maximize the expected number of influenced users (called influence spread), is a key algorithmic problem in social influence analysis. Due to its immense application potential and enormous technical challenges, IM has been extensively studied in the past decade. In this paper, we survey and synthesize a wide spectrum of existing studies on IM from an algorithmic perspective, with a special focus on the following key aspects: (1) a review of well-accepted diffusion models that capture the information diffusion process and build the foundation of the IM problem, (2) a fine-grained taxonomy to classify existing IM algorithms based on their design objectives, (3) a rigorous theoretical comparison of existing IM algorithms, and (4) a comprehensive study on the applications of IM techniques in combining with novel context features of social networks such as topic, location, and time. Based on this analysis, we then outline the key challenges and research directions to expand the boundary of IM research.",
                  "journal": "",
                  "title": "Influence Maximization on Social Graphs: A Survey",
                  "tldr": "This paper surveys and synthesizes a wide spectrum of existing studies on IM from an algorithmic perspective, with a special focus on a review of well-accepted diffusion models that capture the information diffusion process and build the foundation of the IM problem.",
                  "url": "https://www.semanticscholar.org/paper/de5e4c789209dfed61d427675e20ccf7362b9375",
                  "venue": "IEEE Transactions on Knowledge and Data Engineering",
                  "authors": "_1823512389_1704755170_2220456_145472073",
                  "publicationDate": "2018-10-01"
            },
            {
                  "paperId": "33b742794fe949b6b48cfa38a3dd8709aabbec5c",
                  "citationCount": 44,
                  "publicationTypes": "JournalArticle",
                  "referenceCount": 163,
                  "year": 2018,
                  "journal": "",
                  "title": "Exploring the Limits of Complexity: A Survey of Empirical Studies on Graph Visualisation",
                  "tldr": "This paper surveys the literature on human-centred experiments to understand how, in practice, different features and characteristics of nodelink diagrams affect visual complexity.",
                  "url": "https://www.semanticscholar.org/paper/33b742794fe949b6b48cfa38a3dd8709aabbec5c",
                  "venue": "Vis. Informatics",
                  "authors": "_2279094_2503181_1680836_145835767_2056819537_32489306_2702080",
                  "publicationDate": "2018-09-02"
            }
      ]
}